[
    {
        "body": "I was in a higher end department store today (rhymes with loomingtales) and happened to end up next to two teenage aged girls while shopping. One of the girls had picked out a pair of VERY expensive boots and they were both fawning over them. Second girl must have looked at price tag and asks boots girl if she’s really gonna spend that much on boots. Girl with boots says something along the lines of “it’s fine I have my dads credit card I’m not paying ” which instantly caught my attention because THATS NOT HER CARD. I’ve told my son multiple times he’s never allowed to use my card so I’m interested to see how this girl thinks she’s going to get away with fraud but had split up from the girls at this point because they had found something else.\n\nWe end up at the same register (me behind) and I see her total hit well over four digits. The girl is about to swipe her card when I decide that I can’t let her get away with something like this and someone has to parent this kid if no one else will. I tell cashier that isn’t her card but her father’s and I’m not sure she has permission. Girl and friend turn and glare at me giving me possibly the dirtiest look I’ve ever seen. I swear this girl was going to throw a tantrum right there, I don’t think she was ever told no.\n\nGirl tells cashier her father gave her the card to shop with because it’s the stores credit card and it gives him the points. Now that I’ve pointed out it wasn’t hers cashier tells her she can’t use that card. Girl tries to show ID to prove they have the same last name ( yeah that will help) and I tell her it’s still fraud. Girl says it’s not fraud because she has permission and tells me to mind my own business. I tell her that it is my business that she’s doing something illegal she needs to pay with her own card or I call the cops. Girl is pissed now and people are glaring at me. She uses her own card and leaves crying. Cashier looks mad at me and I tell my husband when I get home only for him to agree I was in the wrong.",
        "edited": "False",
        "id": "cdypge",
        "is_asshole": 1,
        "num_comments": 7872.0,
        "score": 41140,
        "timestamp": 1563291671.0,
        "title": "AITA for telling cashier that wasn’t the girls credit card?",
        "verdict": "asshole"
    },
    {
        "body": "I'm the VP of Sales at a software company and one of our sales development reps parents passed away at the beginning of April, sadly they were involved in a car crash and both lost their lives. Now the employee in question in very young 22 year old guy and has been with us for about 10 months now. He's a great employee and we were thinking about promotions in the next \\~6 months for him. His job is a high paying one for a new grad, about \\~90k with commission and base so we expect a lot from this position. Because of the accident we let him take a 1 month paid leave of absence from work and he's returned a few weeks ago and his performance is severely lacking. He's super unmotivated, not cold calling, out reaching to prospects for the last 2-3 weeks enough since he's come back. Our whole mgmt team has noticed this and we decided to let him go because we feel like he'd need months and months to be able to produce again and we can't just wait that long.\n\nWe called him into a meeting on Friday afternoon and gave him the bad news, he was very calm and rude about it. Told us to go fuck ourselves and got up and went to his desk grabbed his few things and left. I thought this was very very unprofessional and extremely rude.\n\nI told my boyfriend about all of this and he said myself and my mgmt team are a bunch of asses and pricks with no hearts.",
        "edited": "1559509325.0",
        "id": "bvxqh8",
        "is_asshole": 1,
        "num_comments": 3461.0,
        "score": 40294,
        "timestamp": 1559484633.0,
        "title": "AITA For Firing An Employee After His Parents Died?",
        "verdict": "asshole"
    },
    {
        "body": "My wife is pregnant with our daughter. Initially we were really happy and excited about it. But then, she starts acting like a nut job. She gets angry and irritated for small things, insults me when she doesn't like the food I make, starts acting insecure and accuses me of losing attraction for her.\n\nFor example, she wanted to eat chicken sandwiches for dinner last week. Well, I made chicken sandwiches. So she eats all the sandwiches, leaves me nothing and told me that they tasted like shit. I wasn't pissed because she left me nothing. But if she didn't like them, why did she have to eat everything? When I asked her this she told me that she was hungry. Ok fine. She does this every time. Eats everything I make and calls it shit. I don't argue with her because I work for more than 80 hours a week and I really want to have some peace when I'm home.\n\nSo, yesterday, a random girl starts at flirting with me after the gym and asked me if I wanted to meet up with her for some drinks. I rejected her and told her that I was married. And when I got home, my wife started to hug me and apologise. When I asked her what happened, she told me that her best friend suggested a test for my loyalty. So they asked a mutual friend to flirt with me and asked me out. And I passed. Yay!!. I'm really pissed. I'm done with her antics.",
        "edited": "1556583602.0",
        "id": "birkjn",
        "is_asshole": 1,
        "num_comments": 4167.0,
        "score": 38259,
        "timestamp": 1556555709.0,
        "title": "WIBTA if I ask my pregnant wife to move out because she and her best friend decided to \"test\" my loyalty?",
        "verdict": "asshole"
    },
    {
        "body": "What I thought would be a total non issue has ballooned into a huge problem and I'm up at 7:05 AM dealing with it. I figured while I wait for a text, I could post here to see if what I did was really that bad. \n\nI'm a big fat ass, there's no way around it. I love to eat which probably borders on addiction but I figure since I'm only hurting myself it's probably better to just live my life. I have some great friends although there is no doubt I'm the \"harmless, funny token fat guy\" of the otherwise pretty good looking group. I guess that sets the stage enough. \n\nLast night my friend hosted UFC and I was invited. He got a 6 foot party sub. I also brought homemade wings that are sort of my specialty. Well of course people flocked to the food and I had basically one serving of the sandwich but people devoured my wings and I didn't get to have a single one. Which is totally fine that's why I brought them but maybe an hour later I was starving. I kept eyeing the sandwich and I'd say there was about 3 feet of it left. I waited an hour, then another half hour and no one had touched it (but they were still munching on chips, pretzels and what not). So I was like screw it...I took about half of what was left and ate it. Then the last half sat for another 10-15 minutes and no one said anything so ate the rest. \n\nWell to be sure as I was swallowing the last bite the host's girlfriend asked where the sandwich was. Like I was the guilty party pretty much everyone pointed at me. I guess they'd noticed me eating the sandwich. She was furious and said that I was an incredible pig and that I had been super selfish to eat 3 feet of a sandwich. I felt so bad I tried to explain to her that I really did wait over an hour and thought people had lost interest. I also tried to explain how everyone had ate my wings and she said something along the lines of \"you brought them to share Alan, if someone had eaten over half by themselves that's not fucking sharing is it?\" \n\nI offered to order pizza or even go get subways and she said that it was a pathetic offer because the party sub had been from a local shop owned by her friends. I said I was sorry but the night was so tense from then on out. \n\nI woke up this morning to several texts from my twin sisters (the host's girlfriend's best friends) saying that I had to get my shit under control and that everyone is really mad at me and that I embarrassed myself last night. I tried to explain to them what my mindset had been and they haven't responded. \n\nWas I the asshole for eating that much of the sandwich last night?",
        "edited": "1562526783.0",
        "id": "ca7bdz",
        "is_asshole": 1,
        "num_comments": 3239.0,
        "score": 34039,
        "timestamp": 1562509233.0,
        "title": "AITA because I ate more than \"my share\" of a 6 foot party sub last night?",
        "verdict": "asshole"
    },
    {
        "body": "I’m 26 and clean from heroin for 3 years. \n\nI was also a piece of shit and used to deal for a while. \n\nI managed to get with a beautiful girl named Marcy when I first started getting into the thick of things. She knew who I was but she said she loved me. \n\nI will regret this for the rest of my life, but I was the person who shot up Marcy for the first time. After that, there was no stopping her. She stuck around with me, probably because I was her dealer more than anything, but then I got clean and never saw her again for a long time. \n\nA year ago she reached out to me on Facebook and told me that she had been clean for a few months and she said that she didn’t hate me for what happened and she hoped I was still clean. \n\nLast week I got a call from my sister who told me that she saw on Facebook that Marcy had OD’d and there was a funeral service this upcoming Thursday.\n\nI immediately just burst into tears because I hoped that this would never happen and I feel so much guilt over it. \n\nI want to go to the funeral service for her but I’m afraid that my presence would be unwanted. At the most I would just slip in the back, pay my respects and leave. I need to do this for myself.",
        "edited": "False",
        "id": "cg1u8p",
        "is_asshole": 1,
        "num_comments": 948.0,
        "score": 31048,
        "timestamp": 1563731508.0,
        "title": "AITA for wanting to go to the funeral of a girl that I helped get addicted to drugs?",
        "verdict": "asshole"
    },
    {
        "body": "I have waited tables for the last three years.\n\nDuring my shift last night, a group of four women in their late 20s came in. They were a pleasure to have as customers. They ordered four of our house cocktails to start with and then went over the menu for their entrees. \n\nWhen I was on my way back to their booth with the drinks on a tray, I walked by the back side and overheard one of them talking about how she was 14 weeks along. When I rounded back, they were talking about the same topic and it was clear to me that she was pregnant. I figured her having one drink wasn't a big deal. They ordered their entrees and I went off to handle other tables.\n\nAbout five minutes later, they called me over again and asked for another round. At this point I started getting concerned, but I took the order and cheerfully said I'd be right back. This time, I went to the bartender, and asked him to make one of them a virgin cocktail. He was confused but since he's a good friend of mine, I told him to just trust me. \n\nA few cocktails later (hers strictly virgin) they started getting rowdy, and Mrs. Pregnant Woman was also getting into it. I figured that since she didn't notice, things were OK. The problem came when I took them their check, and they asked to split the bill at the register. When Mrs. Pregnant Woman got to the counter, I saw her cocktails were marked with (virgin). My bartender had edited each in the system for inventory.\n\nIt was too late for me to edit them back, so I just had her pay, hoping that she wouldn't look at the receipt. They all thanked me and left, leaving a generous tip in the process. They were talking in the parking lot for the next short while, presumably waiting for an Uber.\n\nSeveral minutes later Mrs. Pregnant Woman came back and asked what (virgin) on the receipt meant. I fessed up that it meant non-alcoholic. She blank stared me for a few seconds and then asked if she had ordered a non-alcoholic cocktail. I said no, but told her that I assumed she wanted one seeing as she was pregnant. It was a lame lie and I'll admit it, but she looked me in the eye and asked me to return her part of the tip. I did so. Then she talked to my manager. My manager took me into her office and literally shrieked at me until hoarse. \n\nI stood my ground and told her that I'm not going to be responsible for FAS. She told me that she was taking me off the calendar until she decided what to do with me. She also informed me that I could get the restaurant in serious trouble for discrimination, and upon examination of my state's laws, she is correct. \n\nBut when I talked to my mother and father about it tonight, they told me that they understood my position. The entire staff at the restaurant is against me and I think that I'm going to call in and tell my manager that I quit, but I still feel in the right here. I would like some perspective on this and if I'm the asshole here.",
        "edited": "False",
        "id": "ch3vqi",
        "is_asshole": 1,
        "num_comments": 2799.0,
        "score": 30558,
        "timestamp": 1563945624.0,
        "title": "AITA for serving a pregnant woman a non-alcoholic cocktail?",
        "verdict": "asshole"
    },
    {
        "body": "My younger sister and I were very close when young but no so much now. I was born in fairly well to do Hindu family. I fell in love and married a Muslim man and had to convert to his religion. My family was pretty pissed off that I converted but we've kept in touch.\n\nRecently my sister announced that she was in love with a guy she'd met while trekking and they had plans to marry. My mom invited me for a 'girl's day', just me, her and my sister at my parent's home for a fun day.\n\nMy sister began to talk about her fiance, how they hated each other at first but then fell in love etc etc. I was happy for her.\n\nIt all began when I asked what religion he was. Imagine my surprise when she said that he was Hindu AND THE SAME COMMUNITY AS OUR PARENTS. This would mean that it would make my father absolutely over the moon.\n\nI asked her if she was sure she loved him, because it seemed unbelievable that she would meet someone from the same small community as our parents' and fall in love. She got angry and told me that she was absolutely sure she was in love with him. \nI suggested that maybe she thought she was in love because it was easy and there was no challenges involved.\n\nI explained to her that if she was truly in love, she wouldn't choose someone so obviously a match. It was as though our parents chose him from a catalogue. \n\nShe told me that it didn't matter, she loved him and thats it, and I was being rude. I told her that I wasn't, I was just looking out for her and didn't want her to bear the brunt of societal expectations on who to marry.  I then asked her if she was marrying him to appease our parents.\n \nAt this point my sister blew up on me and began fuming that she was not a kid, she didn't need to appease anyone etc etc. At this point my mom told me(not her) to get out of the house.\n\n\nLater my sister told me never to contact her again, nor ever see her face or come to her wedding. She called me 'toxic'.\n\nI was just looking out for her.",
        "edited": "False",
        "id": "c9uay1",
        "is_asshole": 1,
        "num_comments": 1009.0,
        "score": 29700,
        "timestamp": 1562424120.0,
        "title": "AITA for suggesting that my sister chose an easy love?",
        "verdict": "asshole"
    },
    {
        "body": "Not a clickbait title, that's actually what happened. I got called an asshole for it, so now I have come here out of curiosity for you fine people to help settle the disagreement.\n\nI met a girl online and we clicked, and have gone on a couple dates. Two nights ago was our third date and I was treating her to dinner at a local burger place in the city. Nothing fancy, I just wanted some good conversation over a tasty meal. This girl is a knockout, has the rare quality of being a great listener, and isn't obsessed with herself. She's funny, charming, and smart. We had had several great dates and I was getting close to asking her to be my girlfriend. She is also the one who called me an asshole before the night was done (not her exact words, but we'll get there.)\n\nOur waitress for dinner was great. Actually enthusiastic and friendly, on point with the refills, and just top notch service all around. At one point in the evening she did spill a partially-full glass of water on our table, but it wasn't really her fault because she had gotten bumped into, and she was very quick to apologize and wipe the table dry with a smile on her face, so if anything that was a point in her column.\n\nAt the end of the meal, she brought the check and I told her I would like to speak with her manager. She asked if there was something wrong, and I calmly repeated that I would like to speak with her manager and could she please go get him. She leaves and reappears with the manager a few moments later, and I proceed to tell him that we had gotten *excellent* service that night, and that (her name) was one of their best. He thanked me for the feedback and she also looked very happy at the compliment and thanked me.\n\nThe only one not happy was my date. She said, \"If that was supposed to impress me, it didn't.\" and said that I was full of myself. She didn't say much else as we gathered our things to leave and there was no kiss at the door that night. I texted her saying I was sorry for whatever I did wrong and that I'd like to see her again soon, so far no response.\n\nSo pardon my french, but what the fuck?",
        "edited": "False",
        "id": "ak0zkc",
        "is_asshole": 1,
        "num_comments": 4384.0,
        "score": 28166,
        "timestamp": 1548510642.0,
        "title": "AITA for telling my waitress's manager she did a great job?",
        "verdict": "asshole"
    },
    {
        "body": "I’m 40M, my wife is 39F, son in 15. \n\nYesterday when it was dinner time I called him to come downstairs few times. He didn’t answer me so I assumed that he didn’t hear me. I went upstairs and knocked on his door, he said he’d come downstairs in few minutes. After 15 minutes he still didn’t come downstairs so I walked in his room. I knocked first. He was obviously crying. I asked him what was wrong but he didn’t answer me so I didn’t push him more. \n\n I went downstairs and told my wife about it. She went upstairs to talk to him and stayed there for half an hour. She came back and brought him food upstairs. When I asked her what was wrong she said that it wasn’t anything important and told me to drop it. I got kind of upset because I want to know what was wrong and I’m his parent as well. \n\nI haven’t been fully ignoring them but I’ve been acting kinda distant since yesterday. My wife got mad at said that I was acting extremely immature.",
        "edited": "False",
        "id": "d84fui",
        "is_asshole": 1,
        "num_comments": 171.0,
        "score": 27960,
        "timestamp": 1569233059.0,
        "title": "AITA for being upset because my son didn’t talk to me, but talked to my wife.",
        "verdict": "asshole"
    },
    {
        "body": "So my girlfriend (her 27 me 28) wants to go to this fancy new restaurant in the city that she’s heard good things about. We get there and it seems like one of those hipster places but whatever, I’m hungry. \n\nI look at the menu and this place is crazy expensive - like every dish is more than $15-$20 and half the ingredients I’ve never heard of. I order the bison steak ($26) and my girlfriend orders some weird pasta, noki I think ($18). Very important, these were listed as ENTREES on the menu. Mind you with drinks plus tip this is going to come out to over $60 which is already ridiculous for dinner for two people.\n\nSo anyway we order as we are starving. My steak arrives and I am shocked, it’s like 6 small pieces of sliced steak with some weird sauce on the side and a small handful of salad. I joke to the waiter “where’s the rest of my steak?” and he explains they serve smaller portions at this restaurant because they focus on getting the highest quality ingredients. I don’t care if this bison was blessed by the pope himself it’s absurd to charge that much for such a small bit of steak, it’s highway robbery. When I go to restaurants I expect an entree to fill me up and be enough for leftovers.\n\nI’m complaining to my girlfriend and she’s getting annoyed with me. Similar situation with her pasta it was like maybe 12 pieces of noki dressed up with some frou frou bullshit. Granted the food was pretty good but I can not get over how tiny these portions are. I’m a big guy and I like to eat, what can I say. \n\nWhen the waiter comes back I inform him we will not be paying for our meal, and that they are falsely advertising entrees that barely qualify as a light snack. My girlfriend is begging me to stop but that’s where we’re different, I don’t let businesses push me around and rip me off. \n\nA manager comes and apologizes but asks us to leave. I don’t end up paying as they realized I called them out on their bullshit. My girlfriend is silent the entire time on the way back. Im still hungry so I drive through McDonald’s and get a burger, and when I did that she asked to be dropped off at her place. It’s now the next day and I’m starting to think I didn’t handle the situation as well as I could have (I could have probably just asked for a discount). My girlfriend hasn’t responded to my texts so now I’m starting to think I’m an asshole.\n\nAm I the asshole?",
        "edited": "False",
        "id": "cblw2u",
        "is_asshole": 1,
        "num_comments": 2793.0,
        "score": 27513,
        "timestamp": 1562790017.0,
        "title": "AITA for refusing to pay at a restaurant that was false advertising?",
        "verdict": "asshole"
    },
    {
        "body": "Saw another post that reminded me of this situation.\n\nA few years ago, my close childhood friend gave birth to triplets. Her husband is a light black man. Of the three, two were the same skin tone as her husband, and the third was much darker. The skin tones made me a little suspicious that her husband might not be the father.\n\nI pulled her aside privately and asked her seriously if her husband was the father. She didn’t even listen or answer rationally, she just freaked out at me and acted super insulted and kicked me out. I reached out to her husband and told him about her reaction and told him he should get a paternity test and he called me an asshole and blocked me. Neither has spoken to me since.\n\nI’ve always thought that they dramatically over reacted and were probably hiding something because of their responses, but they’re still married and sometimes I feel bad about what happened. I just felt a lot of empathy for her husband because I would be devastated if I wasn’t confident that I was the father of my future children. Was I an asshole for asking privately?\n\n",
        "edited": "1558829502.0",
        "id": "bt0m1g",
        "is_asshole": 1,
        "num_comments": 1047.0,
        "score": 27444,
        "timestamp": 1558823944.0,
        "title": "AITA for privately asking my friend about the paternity of her children",
        "verdict": "asshole"
    },
    {
        "body": "Just for context, I am 6'2 and my wife is 4'11. She is insecure about her height and while I try my best to tell her that she is stupendously beautiful the way she is, she got bullied about it pretty bad and it's just an aspect she doesn't like about herself.\n\nWith this in mind, we recently went to one of my favorite places to eat. Now, this restaurant has a really large counter and my wife is petite, so the cashier couldn't really see her. \nWe ordered our food, and were heading out when the cashier held out a giant piece of candy and said 'for your lovely daughter' to me.\n\nI honestly couldn't help but burst out laughing to the point that I had tears in my eyes and I had to compose myself before driving back home. \n\nMy wife was obviously pretty pissed.",
        "edited": "False",
        "id": "dmcw3y",
        "is_asshole": 1,
        "num_comments": 3107.0,
        "score": 24695,
        "timestamp": 1571901807.0,
        "title": "AITA For laughing my ass off at my wife's expense?",
        "verdict": "asshole"
    },
    {
        "body": "My friends and I went sightseeing, aware that the weather forecast was warning of heavy rain.\n\nWe’re from England, where the correct response to rain is to not acknowledge it, but things are a little different in Japan. It is impossible to walk outside without getting fully soaked. I warned my friends of this and stopped at a shop to buy an umbrella. They were reluctant to get one; either underestimating the rain or thinking they could get one later, if it actually rained.\n\nI warned them multiple times that if it rains, I would not let them borrow my umbrella.\n\nOne friend had a raincoat so was mostly fine but the other did not. I reminded them that I would not share a few more times while we were walking. \n\nRoughly an hour later, it started raining. Hard. It was unlikely to stop raining any time soon and we had a train to catch so we walked in the rain for half an hour to the train station. I stood by my word and refused to let them use my umbrella (which could easily fit 2 people under it). When we arrived, the friend without the raincoat was completely soaked, and the other was far from dry. Neither were particularly happy.",
        "edited": "False",
        "id": "csfejp",
        "is_asshole": 1,
        "num_comments": 4626.0,
        "score": 22775,
        "timestamp": 1566211660.0,
        "title": "AITA for not letting a friend use my umbrella in a Japanese downpour?",
        "verdict": "asshole"
    },
    {
        "body": "My ex husband and I share custody of our 10 year old daughter and 12 year old son. We have a 2-2-3 schedule which usually looks like I have the kids Friday after school and then he gets them Monday after school. I get them back Wednesday after school and then he gets them Friday after school and then the week flip flops. We've done this since our divorce 5 years ago and it works well. I'm a nurse in the OR so I schedule my shifts for the days during the week when they are with their dad and my one call weekend every 6 weeks is a weekend they are with their dad. \n\nRecently, the kids said they want to try splitting up on the weekends, so instead of both of them being with one us during the weekend, one will go with dad and one will be with me. My son said he would make sure he was with me on call weekends because he can stay by himself if I have to get called in or can hang out at the hospital until I'm done. My ex is on board with this because he says it will allow us to spend one on one time with the kids and will allow the kids a break from each other (they squabble occasionally and annoy one another). While they have a point- sometimes it is hard to not feel like you are disappointing one by trying to accommodate the other, I do not want to give up my free weekends. It took me a few months to get used to not having my kids all the time after the divorce but now my weekends without them are filled with activities or travel. My ex agreed if there was a weekend trip I wanted to take he would be fine having both the kids that weekend but I honestly don't want to have to take his schedule into consideration when planning my trips, and sometimes they are spontaneous trips. \n\nI was talking to my family about this at breakfast this morning and they are all kind of appalled by me not wanting to do this. My sister pointed out that if I was still married, then I wouldn't have all the child free time I have now and many mothers don't get a break from their kids like I do. My mom said she can't believe I'd deny my children quality time with their parents for selfish reasons like not wanting to give up my weekends. My SIL seemed to understand where I was coming from but said that she would still do it and just incorporate the child into whatever I was doing and pointed out my daughter would love to go on the NYC shopping trip I had planned for December and my son would happily join me for my Saturday morning spin classes. I considered that but my SIL loves taking her kids everywhere so I don't know that she is aware of how nice it is to just be an adult without the responsibility of a child wherever you go. They were really making me feel like an asshole though.",
        "edited": "False",
        "id": "dx7hty",
        "is_asshole": 1,
        "num_comments": 5785.0,
        "score": 20708,
        "timestamp": 1573914328.0,
        "title": "AITA for not wanting my kids every weekend?",
        "verdict": "asshole"
    },
    {
        "body": "We were at a local restaurant last Saturday evening. This is a locally owned establishment, not a chain. There was a 30-45 minute wait for tables.  There was another family waiting in the wait area, and the \"mom\" went to the bar and came back with three drinks. A beer for \"dad\" and a margarita for her and one of the young women. There was another young woman there who looked of college age, and had on a college sorority t-shirt, but no drink was brought for her.\n\nBut as I watched I noticed that the mom was sharing her margarita with the 4th girl, who I assumed was under 21 as she had no drink of her own. In fact, I'd guess the 4th girl consumed MOST of the mom's margarita. I mentioned this to my husband and he said so what, forget it. Full disclosure that I'm a non drinker myself and certainly don't approve of underage drinking, not to mention that this behavior might put the restaurant at risk. So I mentioned it to the hostess. A short time later a manager (I assume) came and asked to see the girls' ID's. The girl with her own drink produced one. The second girl who had been drinking from Mom's drink did not.  I did not hear the exchange, but the family left thereafter. I assume they were asked to do so. \n\nMy husband said that it was a crappy thing for me to do. I feel like I was protecting the restaurant. Was I the Asshole?",
        "edited": "False",
        "id": "c1nkh3",
        "is_asshole": 1,
        "num_comments": 1213.0,
        "score": 20666,
        "timestamp": 1560778375.0,
        "title": "AITA for getting a family thrown out of a restaurant for underage drinking?",
        "verdict": "asshole"
    },
        {
        "body": "I am a high schooler with a weekend job at a coffee shop. My coworkers who work weekends are: \n\nJames - the owners son, he goes to my school. He's a shift manager but it's not a real formal thing, he's a friendly guy.\n\nDanielle - A college student who sometimes works weekends too.\n\nSo sometimes customers will come in and just be angry about such little stuff. Like literally blow up about nothing. I dunno if theyre in a bad mood already and looking for someone to take it out on or what, but it's a lot... Like how sad so your have to be to be a grown-ass man taking your anger out on high school and college kids.\n\nSo James and I were joking about having a little fun with them and hopefully getting them off our backs.\n\nSo one day I was at work and some guy was having a temper about how we don't make the coffee hot enough... Which I couldn't do a thing about because I gave it to him right out of the machine.\n\nSo James came in and was like \"sir is there a problem here\" and the guy started ranting at him too. So he was just like \"OP, this is unacceptable, you're fired.\" \n\nI started acting real sad, like \"no please don't fire me, my family needs the money, I need this job, pleaseeee\" and he played up being a hard-ass, telling me to take off my apron and leave.\n\nThe angry guy started to backtrack, like \"It isn't that big of a problem, you don't need to fire her over it. I didn't mean it\" and James was like \"No, we pride ourselves on the best customer service\"\n\nOf course after all that drama I still had my job, we were just acting. And we've done it a couple times, whenever a customer will lose their temper at Danielle or I, James will storm in and \"fire\" us. And almost every time, the person who had come in angry will apologise and say that they didn't mean it. It's kind of satisfying, making people realize their actions might actually have consequences. \n\nAnyway, I was telling my friends from school about this and a few of them thought it was a mean prank, to let someone go away thinking they'd gotten someone who desperately needs the money fired.",
        "edited": "False",
        "id": "e5k3z2",
        "is_asshole": 0,
        "num_comments": 3628.0,
        "score": 59187,
        "timestamp": 1575392873.0,
        "title": "AITA for pretending to get fired when customers get a temper with me?",
        "verdict": "not the asshole"
    },
    {
        "body": "Dad here, old fart, loves his daughter to pieces but I’m struggling to see eye to eye with my teenager and wife on this one. \n\nWe’ve always been a meat eating family, we live in the rural Midwest and bacon for breakfast is pretty much a given. This year my 14 y/o daughter decided to go vegan, and I jumped onto her support team with enthusiasm. We learned how to substitute ingredients, cook new things, try new things, I adjusted our budget to include more expensive vegan substitutes for her, etc. \n\nNone of this has been a problem for me until recently. She saw me cook bacon in a pan, and then I rinsed it out to load in the dishwasher. She exploded in anger (teen years, I’m not too fussed about the anger explosion, I know she doesn’t mean it) and said that that was HER pan for vegan food. I was completely floored and said, kiddo this here is a family pan, older than you, it’s not YOUR pan. \n\nShe asked me to purchase her a pan that she can solely use for vegan food. I didn’t want her to feel weird about food, so I said sure, and ordered her a few colored ones that are only for her. The reason they’re colored is so it helps me remember that I’m not to touch them unless I’m cooking vegan. \n\nThat wasn’t good enough. Now apparently the dishwasher is ‘contaminated’ with animal product, and the fridge has ‘bacon grease fingers’ on it (because I eat bacon and then touch the fridge) and she’s asked me and her mom to completely stop eating meat at home. I don’t mean I literally touch the fridge with greasy bacon hands, because I wash my hands, but it’s clearly enough that it upsets my daughter. \n\nfrankly I’m on team hell no, her mom is much more amenable and strongly wants me to consider taking our daughter up on the request. My wife’s reasoning is that both our parents live close so we can eat meat products there, and that she doesn’t want our daughter to feel uncomfortable in the kitchen. My daughter says she is fine with cheese and butter in the fridge, but it’s specifically meat products that make her feel sick. Now I’m sorry for her, but I feel like she just needs to adapt and live side by side, because I’m not going to stop eating bacon in my own house.",
        "edited": "False",
        "id": "dkqv29",
        "is_asshole": 0,
        "num_comments": 7700.0,
        "score": 50676,
        "timestamp": 1571609951.0,
        "title": "WIBTA for refusing to stop cooking bacon in my kitchen due to my teenage daughters vegan lifestyle?",
        "verdict": "not the asshole"
    },
    {
        "body": "So it was my birthday couple months ago. Had a party. Got some gifts. My friend “Mandy” for me a “super cute bikini”. I liked it. Said thanks. She had ripped the tags off but whatever. \n\nAnyway. Went to the community pool with my roommate. Wore bikini. Got in the water. Roommate immediately is like uhm girl.... I look and see that this bikini is now kinda see thru. \n\nHaha good joke Mandy. \n\nAnyway, Mandy invited me over to her place to hang out with her and her bf and a few others. Most leave and we’re still hanging out. I’m like hey, what if we get in your hot tub? I go change after them. And meet her bf in the hot tub she’s getting new drinks. I hop in. Immediately, he’s looking at my chest. I pretend I don’t notice and just make small talk. She comes out a few min after. And just looks in shock. Eventually gets in. “Uhh is that the one I bought?” Yeah I love it. I wear it everywhere. Make up some stuff about how I wore it to the beach, some party with lots of guys, etc. and she’s just like “oh”. \n\nWe’re in the tub for 20-30. Eventually get out and change. She approached me after and was like. “Uhm I’m sorry thought you’d notice. But it goes kinda see thru”. I’m like yeah I know why’d you buy me a ducking see thru bathing suit? “She’s like it’s a joke. Wait you knew? So you just spent last 30’ flashing my bf on purpose?” I reply I’m just wearing my birthday gift from her.",
        "edited": "False",
        "id": "d7yuot",
        "is_asshole": 0,
        "num_comments": 4130.0,
        "score": 50523,
        "timestamp": 1569197811.0,
        "title": "Aita for wearing the “joke” bikini my friend got me?",
        "verdict": "not the asshole"
    },
    {
        "body": "So my son had a long-distance gf recently for about two years. She was great, a really nice girl and we all loved her welcomed her with open arms. She was flying here constantly to visit him, like a weekend a month and he didn’t lift a finger to go visit her. \n\nI tried talking to him about it several times and told him he should really start looking into flying over to her instead of expecting her to do all the travelling. He said no. And my wife probably had something to do with it as she constantly told him she was afraid of him flying. I spoke to them both and said this girl is great for him, she was willing to move over to our country too, but said there was one condition and that was he’d have to fly over to her country too. Which is fair enough. \n\nHe said no, he didn’t want to fly or travel anywhere. My son was becoming lazier and lazier, eventually telling his gf and us that he was perfectly fine never travelling anywhere including holidays etc. \n\nLast week, he told us she’s dumped him. I went on her fb page as we’re all still friends (she wrote us an apology letter about how she’s upset it didn’t work out but these things happen, so we’re on good terms) and looks like she’s with a new guy already. Me and my wife have no doubt she was seeing him whilst still in a relationship with my son. \n\nI confessed to them both that I actually agree with her decision and he should have expected it. He did not treat her properly and I hope he learns lessons for the next one because he needs to make more of an effort. I said he deserves it for his lack of effort in the relationship and for essentially just allowing this girl to spend all her money and time coming here all the time. \n\nWife and son are very upset that I said this. Very very upset and my wife says I am being horrible.",
        "edited": "False",
        "id": "daglhs",
        "is_asshole": 0,
        "num_comments": 4083.0,
        "score": 47324,
        "timestamp": 1569680504.0,
        "title": "AITA for telling my son he deserved his gf breaking up with him?",
        "verdict": "not the asshole"
    },
    {
        "body": "I recently won a ‘fuck you’ amount of money. I won’t say exactly how much but it’s in the millions. It makes me feel funny even typing It’s enough to change the life of myself and my family. \n\nMy ex wife is the mother of my 2 kids. She is an amazing woman and good to the bone. We divorced 6 years ago because I had an affair with my current partner. I was in a low place in my life and I fucked up. She was in incredible pain but - like a fucking saint- she allowed me to still see our kids who mean the world to me, allowed our divorce to be as pain free as possible despite the fact that I know she was hurting. She still is close with my parents. She is respectful to me although she refuses to talk to my gf. \n\nShe was actually the first person I phoned after my mom and pops after I found out I won the lottery. She was pleased for me, joked that I could take the kids on a world round trip, and that was that. Nothing else. as soon as I won, I knew I wanted to give her a significant amount. I still love her. She’s the mother of my babies and I feel like this is some small tiny way I can show her that I’m not a complete fuck up. She deserves to know that I care despite my mistakes. She also works a shitty job in the public library which pays her peanuts- she would actually be able to pursue her hobbies this way. Give our kids a better life between us. I haven’t discussed this with my ex yet, but I have with my parents who strongly agree and my lawyer who was very surprised but on board. \n\nLong story short, when I told my gf, she was my livid. Screaming that I’m disrespecting her, accusing me of still being in love with my ex wife- I’m not *in* love with her. We’ve both grown apart, but of course I still *love* her for being an excellent co parenting partner and mother to my kids. My gf is threatening to break up with me, and tbh I’m feeling incredibly relieved over the threats. I don’t plan on changing my plans.",
        "edited": "False",
        "id": "b43t53",
        "is_asshole": 0,
        "num_comments": 5487.0,
        "score": 45413,
        "timestamp": 1553253204.0,
        "title": "AITA for giving my ex wife a large amount of money I won despite the anger of my gf?",
        "verdict": "not the asshole"
    },
    {
        "body": "I (19f) study drama at uni, and my boyfriend is on the same course. My boyfriend is a really good-looking guy, but he doesn't seem to know it. He gets a lot of attention from girls and for the most part, doesn't seem to get that they're flirting with him. I'm not generally annoyed by this, and never really say anything.\n\nHowever, there's one girl in our class, let's call her Victoria, who is obsessed with my boyfriend. She goes out of her way to be paired with him in group activities (for example, if the professor picks groups by numbering us 1, 2, 3, she will move herself to be in the same number as him) and she recently stepped down from a main role in a play we're doing so she could be in a more minor one, simply because this character has a romance with my boyfriend. I know this is the case, because I've heard her say to her friends that she thinks he's hot and what not.\n\nI've never said anything to her about it, because she seems pretty insecure (always complaining about how she thinks she's ugly) and I don't see it as a big deal because my boyfriend doesn't care. However, we recently performed the play and had a small afterparty where she got slightly drunk and was bragging about how she 'definitely felt something' when they kissed in the play and she's 'going to ask him if he felt the same'. I rolled my eyes and again ignored it, until she actually went up to my boyfriend. She was a little bit drunk, and when she went up to him I was there too.\n\nVictoria started saying that she knows he must have felt a spark, he's a really good kisser, etc. I snapped, and sort of shouted at her that 'you sound incredibly desperate, going after somebody else's boyfriend. You're pathetic if you think a stage kiss means you should be together.'\n\nShe looked super embarrassed and walked away, and I later heard she'd gone home crying. I feel like a dick because she's obviously insecure and whatnot, and her friends haven't stopped calling me a bitch since. She 100% knows that I am his girlfriend, I have heard her talking about me being his girlfriend before.",
        "edited": "1573235084.0",
        "id": "dtg4jw",
        "is_asshole": 0,
        "num_comments": 4383.0,
        "score": 43361,
        "timestamp": 1573223122.0,
        "title": "AITA for telling the girl who kissed my boyfriend for a play that she is desperate and pathetic?",
        "verdict": "not the asshole"
    },
    {
        "body": "Some backstory: I had been dating my ex fiancé Sarah for four years. We had been planning to get married in November 2020 but I found out at the start of this month that she cheated on me. She begged me to give her another chance but I broke it off. \n\n\nThe problem was that being cheated on is, in my mind, completely emasculating and humiliating. So I never told anyone that was the reason we broke up. For obvious reasons, Sarah also didn’t tell people we broke up because she cheated. So people have “blamed” me for the breakup, including my mom. They just see that I dumped her out of the blue. \n\n\nI’ve gone very strict no contact with Sarah after I discovered she was cheating on me. Sarah has been talking with my mom and has convinced her that if we could talk one more time, we would be able to reconcile. My mom has been applying hard core pressure on me to talk with Sarah but I’ve explained that there’s no chance we will ever get back together. \n\n\nSo tonight I go over to my mom’s place because she’s hosting family for Christmas Eve. I’m there for a bit talking with my aunts and uncles and cousins when the doorbell rings and I can see it’s Sarah. I ask wtf is going on and my mom says she invited Sarah so we can work this out in the spirit of the holidays. \n\n\nI’m pissed now because the only way to explain my side of the story is to tell everyone I was cheated on. Complete humiliation in front of my whole family. So as my mom goes to the front door, I go into the bathroom. My mom starts knocking on the door saying that I need to come out and talk to my ex like an adult. I say fuck it, kick out the window screen and get in my car and go home. \n\n\nMy mom called a short while ago saying she’s cutting ties with me over my behavior (she’s really fixated on me jumping out of a window) and that Sarah will always be like a child to her. My sister called me after to ream me out for ruining Christmas. I broke down and told her that Sarah cheated on me which is why I dumped her and didn’t want to see her under any circumstances. She called me a big asshole who was lying to cover for myself.  Am I really in the wrong?",
        "edited": "False",
        "id": "efcc8u",
        "is_asshole": 0,
        "num_comments": 1804.0,
        "score": 41505,
        "timestamp": 1577250390.0,
        "title": "AITA for jumping out of a bathroom window to avoid my mom’s attempt at forcing a reunion between me and my ex fiancé?",
        "verdict": "not the asshole"
    },
    {
        "body": "My mother died when I was 16. My dad married another woman two years later.\n\nMy grandparents, my dad's parents, HATE my stepmother. I really don't like her either.\n\nEven after my half-siblings were born, my grandparents never warmed up to her.\n\nMy grandparents are quite wealthy. My father has been banking on this inheritance for a while. He has even been not paying into his retirement because he's so sure that he will inherit the millions.\n\nI just found out on Saturday that I'm getting the majority of my grandparents estate. My father is getting a token amount of $50000 so he can't dispute it.\n\nMy grandparents made me promise not to give out any money after and I intend to keep  my word.\n\nBut I do feel really guilty that my father just spends his money as it's coming in because he's relying on money he won't get.\n\nI also found out my dad is in a lot of debt.",
        "edited": "False",
        "id": "dgfkt3",
        "is_asshole": 0,
        "num_comments": 3358.0,
        "score": 41273,
        "timestamp": 1570802379.0,
        "title": "AITA for not telling my Dad he isn't getting the inheritance he's expecting?",
        "verdict": "not the asshole"
    },
    {
        "body": "I am the  by-product of my parents extra-marital affair. Both of them had spouses at the time. My birth-mother got pregnant and had to tell her husband as he was overseas when I was conceived so there was no way I was his. A few months after I was born they decided not to divorce. I was given to my grandparents on my mothers side to raise with my birth father secretly paying child support without his wife's knowledge.\n\nBoth my parents had other children, my dad's side knows nothing about me but my siblings on my mum's side were told that I am adopted by my grandparents. Recently I decided that I wanted to know more about my dad's family and I sent a friend's request to one of my siblings and my dad so I could get to know him. Well he freaked out and contacted my birth mum and they asked to speak to me over Skype. They both told me that they couldnt risk staying in contact with me and told me that they were going no-contact and to please respect it and move on with my life. \n\nWell I did pretty much the opposite. I contacted my dad's wife and shared screen shots of our conversations and told her everything. She is now divorcing him while on my mother's side I told both my siblings who then went on to tell extended family including her husband's side so now they are seperated and my siblings hate my mother. \n\nCurrently my siblings on both sides lives have been upturned and after the satisfaction has worn off I feel like I unnecessarily hurt them through my parents.",
        "edited": "False",
        "id": "cohdqj",
        "is_asshole": 0,
        "num_comments": 2387.0,
        "score": 41041,
        "timestamp": 1565439833.0,
        "title": "AITA for ruining both my parents marriages for disowning me?",
        "verdict": "not the asshole"
    },
    {
        "body": "I'm a software engineer, with a full time job and a side hustle of doing freelance coding work in my own time. I've always been the type to have a side hustle I put a lot of my free time into; I get really bored sitting idle.\n\nMy freelance hourly rates are $60 an hour, and at my full time job, my hourly pay works out to about $40 an hour. So that's how I value my time. \n\nAnyway, over Christmas vacation, I was staying at my parents house. My cousin was also staying over with her three young kids from Christmas to new year's.\n\nI'd been planning on doing some work on my freelance projects when I had free time; in the mornings when my family had no plans. I wasn't in any rush; I was already ahead of schedule on them all, but I didn't really have anything else to do. It was in a really rural area and it's like an hour drive to the nearest anything\n\nThen my cousin and her husband asked if I could babysit all day for three days, so they could visit some friends in the area and hang out with just adults. I said I had planned on doing freelance work at the library, and she offered to pay me to babysit.\n\nI said I could if they got close to my freelance rates. She wanted a number, and although my freelance rates are $60 I didn't feel like that was right, it was high. But I didn't want to go too low; honestly babysitting 3 kids would be harder for me than the routine coding work I had for my freelance project. I don't know a lot about kids and I've never babysat for long, and I had a feeling it would be stressful and difficult.\n\nSo I said $35, which is below what I make hourly at work, and what is the bare minimum I'd value my time for, if that time is spent doing difficult work. \n\nAnd she went crazy at me, saying that's a ridiculous rate for babysitting, that I was entitled and being selfish, that I'm trying to take advantage of how she didn't have other options, etc.\n\nI said that's way below what I'd be making if I had the time to do my own work, and I'd be putting off my own work to babysit. \n\nHer husband then got mad at me saying that I was a 24 year old girl, that I'm damn near a child myself, that my time is not worth that much and it's childish to say that it was. And that I was a stupid girl for not knowing that babysitting costs like 15 an hour, when I grew up and have kids of my own I will see how stupid I was being.\n\nI was kind of done with being called stupid so I just told them I hoped they could find someone else.\n\nMy mom thinks that I asked for something offensive, and my cousin and her husband obviously did too.",
        "edited": "False",
        "id": "eizcvf",
        "is_asshole": 0,
        "num_comments": 9043.0,
        "score": 39521,
        "timestamp": 1577977774.0,
        "title": "AITA for saying my babysitting rates are $35 an hour?",
        "verdict": "not the asshole"
    },
    {
        "body": "I sound like a real asshole but I've completely lost my mind over this.\n\nI'm 17 and my stepbrother is 17. We both have our driving license.\n\nI just found out 5 days ago that my dad and stepmom bought a used car for my stepbrother. They got me a 600 dollar gift card to best buy. \n\nI know $600 is a lot of money but what the fuck? Am I crazy or is it super unfair? It's literally the straw that broke the goddamn camel's back.\n\nI'm actually so pissed off that I've moved to my mom's house full time.\n\nMy dad seems to be genuinely sorry and told me he's looking for a car now but that it'll take a while.\n\nI messaged him back saying that I'll decide if I want to see him after he decides to be fair for once. I've ignored all other calls and messages from him since.\n\nMy stepbrother messaged me saying that I need to chill out and that he'll let me use his car. He also said that I need to stop bitching and ruining everyone's Christmas. I told him to get in his civic and fuck off.",
        "edited": "False",
        "id": "ebjcyh",
        "is_asshole": 0,
        "num_comments": 4241.0,
        "score": 34366,
        "timestamp": 1576522509.0,
        "title": "AITA for demanding the same Christmas present my stepbrother got?",
        "verdict": "not the asshole"
    },
    {
        "body": "I’m 15 years old. I have a stepsister who is a couple years older than me and she is really seriously disabled. I’m not sure what’s wrong with her because no one ever wants to discuss it with me but she’s non verbal, breaks her bones a lot, and has severe epilepsy and will have many fitting episodes. She also doesn’t understand stuff. That’s probably the easiest way to put it. She’s just a human body with nothing inside. \n\nShe’s my stepmoms daughter. My stepmom married my dad 3 years ago and they dated only for a year before that. I don’t know my stepmom very well and I don’t really get on with her. We are respectful to each other but I’m basically living with strangers because she’s so busy with her daughter and my dad. I am always on my own and I used to hate it but I’m used to it now.\n\nEver since they moved in to live with us life changed drastically for me because all the care now revolves around my stepsister. That’s fine, I get it, but both my stepmom and my dad ask me to do things for my stepsister that I don’t want to do and I resent doing. Stuff like staying home when I want to go to the mall with my friends, they’re disappointed that I don’t get her anything for her birthday with my very limited funds, etc. \n\nMy own mom passed away when I was small so I can’t go and stay anywhere else and all in all I’m just a lot more angry than I used to be because they seem really disappointed whenever I say I don’t want to do anything for her. Even stuff like feeding her- like- I don’t want to sit there feeding her banana pudding and wiping her drool. I didn’t ask for this. \n\nAnyway, she recently fell a few days ago and had a seizure for 8 minutes. She was taken to hospital and the doctors want to keep her in and look after her. I don’t want to go and visit her. I remember seeing my mom in hospital before she died and I just hate hospitals and I sort of hate my stepsister and I just don’t want to go and visit someone who doesn’t even know I’m there. \n\nMy stepmom is really upset with me and so is my dad. They haven’t yelled at me or anything but they are both being super cold towards me because I don’t want to visit. My grandma who lives in Canada called me up out the blue and told me it was okay and I don’t need to force myself to go to the hospital so I’m assuming my dad has told her I’m refusing to go. He keeps pleading with me but I keep telling him I’m not doing it. I told him hospitals remind me of mom and he got even more upset and said my stepsister might die and I need to stop being so selfish towards my stepmom.",
        "edited": "False",
        "id": "d1btlg",
        "is_asshole": 0,
        "num_comments": 4383.0,
        "score": 38421,
        "timestamp": 1567954116.0,
        "title": "AITA because I refuse to go and visit my special needs stepsister in hospital even though she’s very sick? I low key hate her.",
        "verdict": "not the asshole"
    },
    {
        "body": "I have a female co-worker who repeatedly calls me out regarding my weight. I'm female 5'9\" 115lbs and very thin. She is very overweight. All the time she makes comments about my weight. She doesn't call me by name she calls me \"slim\" and I even heard her say one time \"go ask toothpick\" and she has said stuff like \"you need some meat on your bones\" & \"you need to eat\". I have only worked there 8 days. I have asked her very nicely to stop. Yesterday I asked her to stop calling me slim again and she basically said it's her mouth and she can say what she wants. \n\nToday when she said \"morning slim\" I replied \"morning chunky\" and she got upset and actually started crying. Everybody here at work, (only 6 of us total) is saying I'm wrong and I should apologize because being called fat is \"different\" than being called skinny because being called skinny is a \"compliment\". I said as long as she calls me slim, I will call her chunky and now I'm the bad person. AITA if I don't apologize? The owner/manager has completely ignored the situation saying it's \"a high school issue and we should figure it out\".\n\n",
        "edited": "1558030129.0",
        "id": "bpe2di",
        "is_asshole": 0,
        "num_comments": 1896.0,
        "score": 37093,
        "timestamp": 1558021056.0,
        "title": "AITA For calling my co-worker \"chunky\" after she repeatedly calls me \"slim\" and makes references to my weight after I asked her multiple times not to.",
        "verdict": "not the asshole"
    },
    {
        "body": "I gave birth four weeks ago, and we decided to have a ''baby ceremony'', where everyone gets to meet our lovely daughter Charlotte. \n\nMy cousin Alice and her parents were among the guests. The first thing I'll say about her is that she has expensive taste. She's the sort of person who has a *minimum* price range for how much she spends on clothing. She doesn't own anything that isn't designer and has some items of clothing that cost thousands. She is a banker and still lives with parents so can afford the lifestyle. \n\nIt was Alice's turn to hold the baby and she was happy to at first, but suddenly Charlotte vomited on her. Alice handed Charlotte back to me and ran off crying, and spent the rest of the event crying in the car. I went to see her to apologise but she didn't want to hear any of it. My mum gave her one of her shirts which was too big for her and she felt completely upset and humiliated.\n\nToday I got a call from my mum, saying that she'd been on the phone to her sister (Alice's mum) saying that they want me to reimburse the cost of the blouse (roughly £1800) since it was completely ruined. \n\nI have said no. At the end of the day we all know what babies can be like. She took a risk wearing something so expensive knowing a baby was nearby and unfortunately it backfired. I feel bad for her but it was not my fault. \n\nAm I doing the right thing by refusing to pay up?",
        "edited": "False",
        "id": "cw43oc",
        "is_asshole": 0,
        "num_comments": 9024.0,
        "score": 36204,
        "timestamp": 1566910725.0,
        "title": "AITA for refusing to pay back my cousin after my baby ruined her blouse?",
        "verdict": "not the asshole"
    },
    {
        "body": "So my last name is Doe. It hasn't affected my life much apart from occasionally being called \"Dodo\" while growing up or friends spelling it \"D'Oh\" as a joke, and I'm generally pretty neutral about it.\n\nMy wife is six months pregnant and wants to name our future son after her grandfather, who died of cancer in September. His name was John. \n\nI liked her grandfather, and I know he and my wife were very close, but I won't even consider it, not even for our son's middle name. I feel that's just setting him up a world of problems, especially when he grows up and has to apply for jobs. Nobody's going to believe \"John Doe\" is his real name. \n\nMy wife thinks I'm being an asshole for vetoing a name with a strong family connection and says I'm exaggerating the issues he would face.",
        "edited": "False",
        "id": "ejycvt",
        "is_asshole": 0,
        "num_comments": 4160.0,
        "score": 35587,
        "timestamp": 1578153807.0,
        "title": "AITA for not wanting my son to literally be named \"John Doe?\"",
        "verdict": "not the asshole"
    },
    {
        "body": "Note. My step-daughter, Madeline, was about a year old when I married her mother, Jessica. Madeline’s father died before she was born. \n \nMadeline is currently 15, and she’s rebelling for almost everything. She did something bad, so while picking her up, I set a punishment up for her. Then she said “You’re not my dad. I don’t have to follow you”. Honestly, I got a bit hurt from that. But I understand that she didn’t mean it, and that she’d probably change. I just replied “I’m still your legal guardian for the next 3 years, and as long as your in my house, you have to follow my rules.” \n \nThat happened about 2 days ago. So our family was going grocery shopping, when Madeline said “I’m hungry. I need food.” I decide to be extremely cheeky and say “Hi Hungry, I’m not your dad.” My son just started to laugh uncontrollably. My daughter was just quiet with embarrassment. And my wife was berating me “Not to stoop down to her level.” \n \nI honestly thought it was a funny dad joke. And my son agrees. I did adopt her. So legally I am her parent.",
        "edited": "1571535756.0",
        "id": "dhfeg9",
        "is_asshole": 1,
        "num_comments": 2051.0,
        "score": 55775,
        "timestamp": 1570995686.0,
        "title": "AITA for making a dad joke?",
        "verdict": "everyone sucks"
    },
    {
        "body": "This line at a Starbucks I went to was really long. I was in line for a good maybe 20 minutes. Until this lady in a Mercedes tries to cut in front of me and like 8 others behind me. I laid on the horn and tried to block her from cutting me but she succeeded anyway and flipped me off. \n\nOkay. I’m the type of person who will not let someone get away with shit like this. So I waited until she pulls up and as soon as she tries to order, I honk. She then looks at me with a dirty look and gives me the finger which I already had a middle finger of my own ready for her. Each time she makes an attempt to order something I honk and sometimes lay on the horn for 3 seconds. We stopped as soon as she drove off. We then ordered and went about our day. \n\nI just can’t people who are extremely rude like that lady and I couldn’t simply let this go.",
        "edited": "False",
        "id": "chvyp2",
        "is_asshole": 1,
        "num_comments": 2752.0,
        "score": 34797,
        "timestamp": 1564101578.0,
        "title": "AITA for honking at another driver who cut in front of me at a drive thru each time she tries to order",
        "verdict": "everyone sucks"
    },
    {
        "body": "Ever since we(27) had a baby, my wife had been talking like a baby herself.\n\n\nRather than teaching the baby to talk like a person, it's as if my wife's language has become baby-like. She would make noises in between conversations like \"Bo-dee-bo-dee-chooop\" and \"Awowo-fwatata\", even when talking with adults. This is especially embarrassing when I am with her in public places, when she talks like that to complete strangers. \n\n\nI have been telling nicely to her to not do that but she would just laugh it off, totally oblivious to how people around us stare whenever she talk like a baby. I have to point out that she is not in the spectrum, just a crazy new mum, in fact too crazy sometimes.\n\n\nIt was a day off for us when we have my parents babysitting the baby and we finally have some time by ourselves. We went out for dinner and she done it again, talking to the waiter, something like this:\n\n\n\"Yippy thanks ya-ha-ha-hah. Owoyoyaya by the way can you give us an extra plate for this?\"\n\n\nSeeing how the waiter staring at her as if she is some kind of mentality challenged. I rolled my eyes and told her:\n\n\n\"I am taking a break today and don't need another baby who cannot even talk properly to look after. Please excuse me.\" \n\n\nThen I left the restaurant without her. I don't know what occurred to me but I probably shouldn't have done that, but I guess it kinda just snapped.",
        "edited": "False",
        "id": "dk2rkt",
        "is_asshole": 1,
        "num_comments": 3832.0,
        "score": 33902,
        "timestamp": 1571486035.0,
        "title": "AITA for leaving my wife by herself when she talks in a cringy manner",
        "verdict": "everyone sucks"
    },
    {
        "body": "I am 31, and have an identical twin brother. For a while I’ve told my wife that none of her family members notice me or care about anything I do on Christmas Eve but they insist on me attending. She told me that’s not true, they genuinely like me and enjoy talking to me. But I know that the only times they’ve included me I had to basically insert myself into conversations and it feels awkward and unnatural. \n\nSo I had a wager with my wife. Bring my twin brother Steve instead of me, and see if anyone notices. I purposefully did not prep Steve on anything, he went in completely clueless (he knew why we were doing it and was game. I gave him $20.)  \n\nAs I suspected, Steve confirmed that he wasn’t approached all night, nobody could tell he wasn’t me, and he admitted he even felt excluded and he could only imagine how I felt. \n\nSo this morning on Christmas I invited Steve to join (normally he’s with my mom and dad every year as he’s not married or in a relationship.) they know about him obviously but didn’t know about the switcheroo. That was when I revealed that last night “I” was Steve and expressed disappointment that nobody noticed and said this is why I stopped trying, nobody talks to me. \n\nMy wife drew the line here, she was hoping we would keep this between the two of us as a funny prank. But how can I expect her family to see what jerks they’ve been if I don’t expose it? FWIW Steve was fine.",
        "edited": "False",
        "id": "efmpvl",
        "is_asshole": 1,
        "num_comments": 1997.0,
        "score": 32832,
        "timestamp": 1577312504.0,
        "title": "AITA for replacing myself with my twin brother at my in-laws’ Christmas Eve party to see if anyone noticed?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Unfortunately my girlfriend's social skills aren't excellent and as a result whenever she is annoyed at me she is totally incapable of expressing why she is annoyed, so she resorts to totally ignoring me.\n\nYesterday at 1:00 we were supposed to meet up for a birthday meal for a good friend. In the morning I sent her a few messages saying \"what time should I pick you up\" and such, all of which went ignored. I decided to just pretend that she was asleep and I went without her. When I arrived I just made a joke saying \"I think she's still asleep\", she hasn't replied to any of my messages. At about 12:45 I got a string of messages asking where I was and what's going on. I just played dumb and said \"Wait, you're ready? I thought you were still in bed or something??\"\n\nI knew fine well that she was ready to leave the house but I didn't want to play this stupid game and I don't like the disrespect of being totally ignored like this, so I just decided to not pick her up.\n\nObviously she was mad at me and had no idea how to express her emotions besides bursts of anger and then ghosting.",
        "edited": "False",
        "id": "dnrvcc",
        "is_asshole": 1,
        "num_comments": 3740.0,
        "score": 28682,
        "timestamp": 1572174354.0,
        "title": "AITA for not picking my girlfriend up for a birthday meal and telling everyone she is probably asleep because she ignored my text",
        "verdict": "everyone sucks"
    },
    {
        "body": "I went on a dinner double date with my girlfriend, my girlfriend’s friend Amy, and Amy’s boyfriend. We’re all in our early 20s. My girlfriend hangs out with Amy quite often. I see her from time to time, but I’ve never cared for her cheeky attitude. The tipping point was tonight. \n\n\nDinner was going alright until Amy’s boyfriend innocently commented on how little my girlfriend ate. She usually gives me half her entrée. After that, Amy, who isn’t stick thin like my girlfriend, snidely remarked that my girlfriend wouldn’t need fake boobs if she ate like a real woman. \n\n\nI loudly told her to watch her fat goddamn mouth and that her comment was both rude and unnecessary. Amy isn’t overweight by most standards, but that adjective slipped out because of what she said prior. Many people turned their eyes toward us. \n\n\nMy girlfriend and Amy’s boyfriend tried to quell the ruckus, but Amy got up and told me to have fun with my Barbie doll before she motioned Amy’s boyfriend to get up and leave with her. Don’t worry, you pay before you get your food at this restaurant. \n\n\nMy girlfriend and I talked about Amy. She kept saying that Amy and some of her friends make those comments all the time and they don’t mean them to be derogatory. I tried to convince my girlfriend that no friend would make those types of comments and she’s better off without someone like Amy in her life. \n\n\nMy girlfriend still thinks that Amy didn’t mean to hurt her with the “real woman” and “Barbie doll” comments and I didn’t read the room correctly. She told me she feared Amy not wanting to be friends with her anymore after my creating a rift between them. I couldn’t get though to her no matter how much I tried.",
        "edited": "False",
        "id": "e5dc9j",
        "is_asshole": 1,
        "num_comments": 3363.0,
        "score": 23532,
        "timestamp": 1575356830.0,
        "title": "AITA for telling my girlfriend’s friend to watch her mouth when she insinuated that my girlfriend isn’t a real woman?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I'm 99% sure I'm a megga asshole but I came here to just be sure. \n\nmy sister 23f is a megga pro life advocate, here is the stupid part, I held her hand a year ago when she got her abortion. she never mentions it and I can guarantee that I'm the only one who knew. \n\nI always feel like she is being super hypocritical because she got an easy access to have an abortion and then wants to take that away from others. \n\nI was getting sick of seeing her abortion kills babys posts and how she hates pro choice people so I decided to comment on one of her posts. I commented, you where definitely pro life when I held your had last year at the abortion clinic. \n\nI've now been blocked and she was banned from most of her pro life fb groups. \n\nAITA?",
        "edited": "False",
        "id": "c2esxa",
        "is_asshole": 1,
        "num_comments": 4335.0,
        "score": 23320,
        "timestamp": 1560935644.0,
        "title": "AITA for telling people my sister had an abortion.",
        "verdict": "everyone sucks"
    },
    {
        "body": "My friend is marrying my ex boyfriend of four years. It's been pretty awkward. I was kicked out of her wedding party because I was uncomfortable wearing a very revealing bridesmaid's gown. This wasn't that big of a deal as we're not exactly close since she got with my ex. However, she still expects me to take on all the duties of a bridesmaid. I told her that was ridiculous and that she needed to find a new bridesmaid. She then almost uninvited me from the wedding but instead decided I could go I follow a very specific set of rules (ranging from how to dress to who I could talk to). I was absolutely crushed as I was still looking forward to the wedding even if I wasn't going to be in it. I found out through a mutual friend who is still in the wedding party the bride continuously makes fun of me and talks shit about me constantly and so do several of the other bridesmaids. I was about to just not go when I ran into the bride's ex who is also invited to the wedding (He's the groom's cousin). He was also kicked out of the wedding party and was given a list of rules to follow. He and I have decided we're going to go together and have fun breaking as many rules that we can (such as wearing what we want to wear, drinking at the open bar, talking to whoever we want to, and dancing- WE'RE NOT ALLOWED TO DANCE). Nothing we would do would distract from the bride's big day other than breaking the ridiculously petty rules that we're supposed to follow. We're also both at the point where we're both ready to sever ties with the bride and groom. Would we be the assholes? Sorry if this was scattered, a lot happened in the past month and her wedding is in three weeks. Thanks in advance, I'm willing to accept my judgement!",
        "edited": "False",
        "id": "eg8hdn",
        "is_asshole": 1,
        "num_comments": 3518.0,
        "score": 22022,
        "timestamp": 1577434288.0,
        "title": "WIBTA for taking my friend's ex as my date to her wedding after I got kicked out of her wedding party?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Every year on our anniversary, my fiance and I wake up early to go to the beach and watch the sunrise together. It's a very special tradition, as we have both overcome a number of personal challenges during our time together, and the symbolism of watching a new day begin is deeply meaningful for us. \n\nWe decided we wanted to incorporate this into our wedding. Our plan is to have our ceremony on the beach the and have everyone walk over to a beachfront restaurant for breakfast, bloody Marys and mimosas (we've already talked to the restaurant owner about this, who loves the idea and said he'd be happy to open early for us). After that, everyone is free for the remainder of the day. Our friends and family are mostly local and should all be able to travel to the beach in under an hour, except for some extended family flying in from Canada, but that's unavoidable.\n\nBased on our geographic location and the date of the wedding next summer, we've scheduled the ceremony start time for 5:30 a.m., when there should be plenty of light but the sun itself won't be quite visible yet.\n\nWe've been getting a LOT of backlash from our families about this, who say this is way too early and we need to move the ceremony to a more \"normal\" time of day. But my fiance and I don't feel like we're asking for anything that unreasonable.",
        "edited": "False",
        "id": "dnh2km",
        "is_asshole": 1,
        "num_comments": 3352.0,
        "score": 21579,
        "timestamp": 1572111516.0,
        "title": "AITA for wanting a sunrise wedding?",
        "verdict": "everyone sucks"
    },
    {
        "body": "My GF and I were out at a club to see a DJ. We were dancing, drinking, having a good time. My GF has been doing yoga for a few years and when she’s especially sauced she likes to throw in some splits and stuff on the dance floor. Well, we got sauced and as she’s doing her 3rd split or so a guy comes up and “makes it rain” on her - literally like 4 dollars. Obviously he was making a joke that she was dancing like a stripper. Whatever. This happened and in the moment I just fucking started laughing. I thought it was legitimately funny in the moment. My girlfriend gets up and says “we’re fucking leaving” and basically storms out. Get outside and she’s basically telling me that I should’ve punched the dude out or something and that he made her feel like a whore and I’m an asshole for laughing. I’m fucking 31, I’m not punching anyone out at a bar unless they’re actually getting physical or threatening to get physical. While I agree that it might’ve been somewhat demeaning, I also think it was objectively funny.",
        "edited": "False",
        "id": "c8bq11",
        "is_asshole": 1,
        "num_comments": 3302.0,
        "score": 21268,
        "timestamp": 1562086865.0,
        "title": "AITA for laughing at a guy throwing dollars on my girlfriend at a club?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Pretty much the title. My son won a stuffed tiger at the fair last night and said he had named him \"Tig\". He asked me what its last name should be. I couldn't help myself and just instantly replied \"Bitties\". Then I turned to my wife to share a smirk, but she was pissed and quickly suggested a few different last names, but my son insisted that he liked \"Bitties\", so now his Tiger is Tig Bitties. My wife thinks it was completely inappropriate, I think it was a silly joke that went over his head and will have no negative ramifications.",
        "edited": "False",
        "id": "cnml52",
        "is_asshole": 0,
        "num_comments": 4292.0,
        "score": 52388,
        "timestamp": 1565274741.0,
        "title": "AITA for suggesting my 7yo name his new stuffed tiger \"Tig Bitties\"?",
        "verdict": "no assholes here"
    },
    {
        "body": "While sitting next to my girlfriend on a plane I was bored as fuck and looking at the maps are that are found in the back of the airline magazines. A conversation led to her revealing that she did not know where Florida was on the map. Keep in mind she had graduated a private high school and is currently going into her senior year of college. Conversation progressed further into me finding out she could not point out AUSTRALIA either. I was visibly astonished at this revelation and essentially said \"...are you kidding.\" She immediately got defensive calling me an asshole for making her feel stupid. I do feel bad for making her feel stupid, although I feel as if my reaction to her not being educated on such elementary shit was warranted and may even be a wake up call for her to learn some basic geography...",
        "edited": "False",
        "id": "clqcio",
        "is_asshole": 0,
        "num_comments": 4950.0,
        "score": 36446,
        "timestamp": 1564880444.0,
        "title": "AITA for being visibly shocked/dumbfounded that my GF (21, American) could not point out Florida on a map?",
        "verdict": "no assholes here"
    },
    {
        "body": "I got married on Saturday, and it was absolutely amazing except for one thing: my parents showed up late. They knew the ceremony time, and my husband and I made it very clear to everyone, both in the invites and in person, that we were going to start exactly at that time. The venue cost us a lot of money (we paid for the entire wedding ourselves) and we were only able to use it for a limited amount of time, so we wanted to make every minute count. \n\nSo the wedding day came, and half an hour before we were scheduled to start, my parents still hadn't showed up. My husband and I both called them multiple times but nobody answered. We waited and waited, and still heard nothing. Finally, the start time arrived and my parents still weren't there. I was really pissed off at this point. The wedding coordinator asked if I wanted to go ahead and start the wedding, and I said yes. All of our other guests were already there, and we wanted to be considerate of their time. \n\nMy parents showed up 15 minutes later and missed the entire ceremony. It turns out they did leave early but got rear-ended at a traffic light and had to deal with insurance, police, etc. They only have a landline, no cellphones, so they couldn't get in touch with me. Obviously there's no way I could have known this.\n\nI'm still frustrated with them for not making more of an effort to get to the venue early, and they're furious at me for not delaying the wedding 15 minutes so they could be there.",
        "edited": "False",
        "id": "dz2eyy",
        "is_asshole": 0,
        "num_comments": 4657.0,
        "score": 31473,
        "timestamp": 1574258414.0,
        "title": "AITA for starting my wedding on time and not waiting for my parents?",
        "verdict": "no assholes here"
    },
    {
        "body": "This has been an ongoing argument between my wife and I, but it resulted in a huge argument today and I’m starting to wonder if I’m in the wrong. I think it’s impossible for someone in my position to see my wife’s point of view fairly so tell me who’s the asshole here. I’m also not interested in any relationship advice, our marriage is fine, it’s solely this topic/argument that I’m interested in hearing your judgement on.\n\nSo my wife and I have two kids together. But before I met my wife I had a daughter with my now ex-wife. My daughter passed away when she was 7, and the emotional toll of this destroyed my marriage with my ex-wife. We haven’t said a word to each other in almost a decade and I have no desire to speak with her anyway.\n\nI still own the same house as then and I’ve pretty much left my daughters room as it was. At first it was just because there was no reason to, but now it’s kind of like a memorial in some weird sense? I can’t really explain the logic behind it because I don’t think there is any. It just doesn’t feel right to change her room.\n\nThis has been the cause of the only arguments my wife and I have really had. The house has four bedrooms, so each of our kids have a room, we have a shared room, and then there’s my daughters old room. My kids know not to go in there and it’s just left there. Occasionally I will go in there and read a book, or just lie down on her bed. It’s therapeutic in some weird way.\n\nMy wife has always wanted to change the room. At first it was because she wanted a study, but I refused and eventually she gave up. \n\nWe’re now talking about having a third child and naturally she wants our new kid to have my daughters old room. Again I put my foot down and said that wasn’t an option, and that our two older kids can share a room instead.\n\n She really blew up at me and told me she was sick of me holding on to the past. She was sick of me being unable to compromise on this. She was sick of feeling like my deceased daughter came first. She said a lot of things but I think that basically sums it up.\n\nWhen she said these things I was really hurt. But I’ve had a few hours to think it over, and I think I might be the unreasonable asshole here. It’s not fair to make my kids share a room because I won’t let go of the past. It’s not fair to have a memorial reminds my wife that she wasn’t my first love.",
        "edited": "False",
        "id": "bq2hbt",
        "is_asshole": 0,
        "num_comments": 3217.0,
        "score": 21284,
        "timestamp": 1558174397.0,
        "title": "AITA forbidding my wife from using my daughters old room",
        "verdict": "no assholes here"
    },
    {
        "body": "A bit of backstory. I met my wife in the summer of 2008. She was working as the ice cream girl at a local restaurant. I had gone to pick up some boxes because I was moving. Out walked my Sara...it was close to the end of her shift. And working in this particular restaurant was a...dirty job to say the least. (Seriously, I don't care what DDD says, that place is gross.) She was covered in sweat from cleaning the machines, caked in all the dirt from that nasty little kitchen, had a grease stain on her cheek...and she was fucking beautiful. Her smile, her easy laugh, her obvious intelligence...I'm pretty sure I fell in love right then and there that wonderful May night. (inb4 \"tHAts sO OlD faShIOned!!!\" Don't care. When you know, you know.) I wasted no time in asking her out and we hit it off immediately.\nIt started after our first date. She had mentioned she loves lilacs. Me, being a 23 year old guy at the time, didn't know Jack or shit about flowers. But the way she talked about how much she loved them I knew I didn't want to forget that tidbit of information. So I wrote it down in one of those mini spiral notebooks. (Think what cops use to take notes.) This was The Almanacs genesis. Over the years I've written down information about my wife. Her favorite color, her favorite restaurants, her favorite books, movies she wants to see, etc. Basically all the little things I knew I would forget. Anything that struck me as worthy of remembering when she told me. I would go through it every once in a while so I could do something sweet for her. Fast forward to yesterday morning.\nI get a call from her around 11am. \"What the fuck is The Almanac?\" (The Almanac is written on the cover. It's just a silly name that occurred to me a few years ago.) She obviously has it, and I don't lie to my wife, so I tell her. She gets really quiet for maybe half a minute and then says \"I always thought you remembered this stuff...\" tells me she has to run and hangs up. I get home from work last night and she's really dejected. I asked her what's wrong and she says the Almanac has cheapened every sweet thing I've ever done for her. She called it my \"playbook\" and said she felt betrayed. Mind you I've never showed it to a single soul nor have I even told anyone about it. Until yesterday I was the only person in the world to know of it's existence. (She also said she hasn't decided if I can have it back or not, and that she's thinking about destroying it.) I'm kind of heart broken. I feel like this should be an example of how much I love her. I'm terrified she's going to burn it. I WANT to remember all these details that make my wife who she is. That's why I write them down. I don't chronicle these things for brownie points or status. I do it because I love my wife. I hear so many wives bitch that their husbands don't remember shit, and I don't want to be that guy. So yeah, I took notes. And now I'm getting the silent treatment. Or at best single word answers.",
        "edited": "False",
        "id": "b5o8t6",
        "is_asshole": 0,
        "num_comments": 3032.0,
        "score": 19266,
        "timestamp": 1553597849.0,
        "title": "AITA for having an Almanac?",
        "verdict": "no assholes here"
    },
    {
        "body": "Let me preface this off by blaming all of you, the entirety of reddit for desensitizing me, and giving me major trust issues on April fools day.\n\nSo here it goes... Yesterday I got a group text from my wifes (sarah) side of the family stating there was an emergency family meeting happening that night over dinner at my mother in laws (Barb) house. \n\nI immediately had april fools spidey senses starting to tingle, but we haven't all got together since Christmas so I overlooked it and said we (my wife and I ) were in. \n\nWe were the last to arrive and it was pretty somber when we walked in. We all sat down at the table and my wifes brother (Tim) informed the family that his wife (Ashley)  has been having an affair and they are divorcing. The affair was with a long time close family friend (Chris) who lived a block away.\n\n\nChris' wife (jen) had caught them when she came home early one day last week and broke the news to my brother in law Tim. \n\nBoth families have been friends for years. They live less than a block from each other, they each have been married for 15+ years, have 4 kids right around the same age. Honestly, I have always thought both of them were picture perfect families. Hell, all four of them and their kids were at our house two weeks ago for a bbq. \n\nAnyways after airing a lot of dirty laundry, and their plans to divorce, how it could effect future family functions, and opening it up to the group of any questions... there was silence. \n\nI broke the silence with laughter and a slow clap. Saying this was the best april fools gag I've ever seen but I wasn't falling for it. I told Ashley and especially Tim they need to consider going into theater, their performances were top notch and tears seemed genuine. \n\nBeing the newest member of the family (my wife and I married 6 months ago) this was probably not the best thing to say in hindsight. I probably should not have said anything. \n\nEveryone in the room looked horrified. \n\nMy mother in law, who had been crying the entire time, lost all composure. She left the room in hysterics and did not return before we left. \n\nTim, just shook his head, and his cheating wife actually let out a brief chuckle before calling me out for being a dumbass for thinking this was a ruse. Then berating me for being so insensitive. \n\n\nThe rest of the family sat in silence shaking their heads as my wife berated me for trying to make a joke out of a serious situation...\n\n\nI am still dumbfounded. In hindsight, I probably should have sat in silence... but I honestly still feel like I was calling out an april fools gag. \n\n\nAm I the asshole?\n\n\n",
        "edited": "False",
        "id": "b8m3yb",
        "is_asshole": 0,
        "num_comments": 1823.0,
        "score": 19161,
        "timestamp": 1554225563.0,
        "title": "AITA for thinking a divorce announcement due to an affair was an April fools joke?",
        "verdict": "no assholes here"
    },
    {
        "body": "My wife and I have a 6 month old baby girl and a two year old boy. Wife hasn’t been too happy since returning to her job from her last maternity leave and I actually just got a new job. \n\nAt my old job I was working 45-50 hours a week. At my new job my hours fluctuate a lot — it can be anywhere from 60 to 80ish hours a week at the worst. I make a lot more though so there’s that. The pay raise makes it so my family can do really well on just one paycheck. My wife is ecstatic because this means she can be a SAHM which is what she’s wanted. \n\nThe issue is that my wife and I aren’t on the same page about what this change would mean. Before, when our work hours were almost equal, we divided housework pretty much equally. We also paid a housekeeping staff to come every other week to help us out. (Plus we have a nanny to care for our kids while we work). \n\nI told my wife that her staying home would mean no more housekeeping staff or nanny. These cuts will help us afford to have just the one income and I also think it’s practical.  She was mostly agreeable to that. But then she said that we should divide the chores 50-50 still. \n\nI told her there was no way I was going to be taking on as many work hours as I am and then come home to cook or clean too. That would defeat the entire purpose of her quitting her job. \n\nShe looked at me like I was some sort of Neanderthal but I think what I’m saying is completely fair. I’m not expecting her to do any heavy lifting. Just tending to the kids, cooking, and doing a reasonable job keeping up the house. I recognize that this would be an old fashioned way of living and if she ever wanted to return to the workforce I would support her 100%. But I think it’s fair that if I’m the sole paycheck and working crazy hours I don’t come home to more stress and chaos. \n\nObviously my wife and I will have to work this out between ourselves. I’m mainly posting here as a sanity check to see if my thoughts on this issue are completely off base. \n\n**",
        "edited": "1546529189.0",
        "id": "abv65u",
        "is_asshole": 0,
        "num_comments": 4635.0,
        "score": 18504,
        "timestamp": 1546448271.0,
        "title": "AITA for telling my wife that when/if she quits her job to be a SAHM I am not planing to do much in the way of household chores anymore?",
        "verdict": "no assholes here"
    },
    {
        "body": "My daughter passed away 6 years ago fighting a rare genetic condition. The condition was also responsible for my late wife's death when my daughter was only an infant. I don't want to discuss anything related to that now. Let me talk about the issue at hand. \n\nI'm now married to my amazing wife. I have a stepdaughter who will be starting high school shortly. I made a lot of investments for my late daughter. I thought I could give her a head start in life. But that never happened. So I decided to donate the money to a charity ( which helps kids with  genetic disorders ). The investments I made mature in an year and I plan on donating all of it. \n\nNow my wife wants me to use the money for my stepdaughter. She tells me that this will help her have a head start in life and that would partially fulfill the purpose of the investments. She thinks this will also help us finance her college education. She doesn't want her getting bogged down by loans, which is a sound argument. I love my stepdaughter, but I don't think I'm ready to do this. I want to donate the money.",
        "edited": "False",
        "id": "bwd091",
        "is_asshole": 0,
        "num_comments": 2896.0,
        "score": 17833,
        "timestamp": 1559581080.0,
        "title": "WIBTA if I tell my stepdaughter and my wife that I don't want to use the investments I made for my late daughter to finance her college education?",
        "verdict": "no assholes here"
    },
    {
        "body": "So my girlfriend and I recently got engaged, and I figured it would be nicer to have her pick out her own ring rather then me guessing what she likes. \nNow I already know my girlfriend loves shiny things, but now she is absolutely adamant that she wants a real diamond ring. Personally I don't like the idea of shelling out so much money for a piece of jewelry with an artificial high price. So instead I offered to buy her one that was lab-grown, as it's way cheaper but also doesn't involve shady business practices and labor. \n\nMoney isn't an issue, it's really about the ethics for me. I do not like the idea of buying her something that potentially harmed someone in the making of it for our wedding. But she thinks I'm being stingy for not buying her a \"real\" diamond. We've already gotten in a few arguments over this so now I wanted to ask you guys if I should just suck it up or not.",
        "edited": "False",
        "id": "bcpbxl",
        "is_asshole": 0,
        "num_comments": 3319.0,
        "score": 16717,
        "timestamp": 1555152747.0,
        "title": "AITA for not wanting to pay for a diamond ring?",
        "verdict": "no assholes here"
    },
    {
        "body": "My husband and I are having a baby. I'm mixed race, half black and half white. My husband is black. \n\nWe don't know the gender yet but my husband prefers names that most people would call black names for boys. Names like Trayvon, DeVonte, Marquis, etc. \n\nI grew up with a name that is tied to black culture and hated it for most of my life. I go by a shortened form of my name professionally (i.e Dee for Denaisha) because I have seen how people react to my government name. I am sure I have been passed up for jobs because of how people perceive my name. \n\nMy husband has a name more commonly used for white boys (i.e Jake). He wants a strong black name for our son because he never had that and believes that giving him a \"white\" name to avoid racism isn't helping anyone. I don't disagree but don't want to use our son as a test dummy to change that. \n\nThis has become a battle.",
        "edited": "False",
        "id": "ck2eaj",
        "is_asshole": 0,
        "num_comments": 1618.0,
        "score": 13225,
        "timestamp": 1564541667.0,
        "title": "AITA for shutting down \"black\" names because I think it'll make life harder on my kids?",
        "verdict": "no assholes here"
    }
]