[
    {
        "body": "Note. My step-daughter, Madeline, was about a year old when I married her mother, Jessica. Madeline’s father died before she was born. \n \nMadeline is currently 15, and she’s rebelling for almost everything. She did something bad, so while picking her up, I set a punishment up for her. Then she said “You’re not my dad. I don’t have to follow you”. Honestly, I got a bit hurt from that. But I understand that she didn’t mean it, and that she’d probably change. I just replied “I’m still your legal guardian for the next 3 years, and as long as your in my house, you have to follow my rules.” \n \nThat happened about 2 days ago. So our family was going grocery shopping, when Madeline said “I’m hungry. I need food.” I decide to be extremely cheeky and say “Hi Hungry, I’m not your dad.” My son just started to laugh uncontrollably. My daughter was just quiet with embarrassment. And my wife was berating me “Not to stoop down to her level.” \n \nI honestly thought it was a funny dad joke. And my son agrees. So AITA?\n \nEdit: I did adopt her. So legally I am her parent.\n\n \nMini ",
        "edited": "1571535756.0",
        "id": "dhfeg9",
        "is_asshole": 1,
        "num_comments": 2051.0,
        "score": 55775,
        "timestamp": 1570995686.0,
        "title": "AITA for making a dad joke?",
        "verdict": "everyone sucks"
    },
    {
        "body": "We had a family dinner this evening. My family has four kids in total: me, my elder sister (29F), younger sister (24F) and youngest brother (22M).\n\nExtended family attended our family dinner. So all of our significant others, our cousins, aunts and uncles etc. During the dinner my elder sister and youngest brother got into a mild disagreement. My sister seemed (at least to me) to be coming across as very aggressive out of frustration and losing said argument. The two of them were too absorbed in their argument to realise the rest of us were getting a bit fed up.\n\nEventually my sister got really fed up and said “Shut up, I’m not going to argue with a 22 year old virgin.” My brother hadn’t done any personal attacks up until that point, it was completely unprovoked. I think it might have been the alcohol as my sister is a mean drunk. \n\nAnyway, I immediately told my sister to grow up and that she was making an embarrassment of herself. She replied by saying everyone knows he’s a virgin and she didn’t say anything wrong. This annoyed me as my bro definitely has confidence issues and doesn’t need to be made fun of like this.\n\nSo I responded by saying how she slept with well over a hundred men while she was in college, and that since everyone in the family knows this it’s not a big deal right? Turns out her husband didn’t know this amazingly, I genuinely assumed he must have known. he left the party angrily saying my sister mislead him about her past.\n\nFamily is blaming me for their marital problems. I refuse to accept I did anything wrong. My sister bullied my brother in front of everyone, all I did was give her a taste of her own medicine.",
        "edited": "False",
        "id": "cihc3z",
        "is_asshole": 1,
        "num_comments": 5284.0,
        "score": 54137,
        "timestamp": 1564233111.0,
        "title": "AITA for telling my extended family how many men (roughly) my sister has slept with after she outed our youngest brother as a virgin?",
        "verdict": "everyone sucks"
    },
    {
        "body": "My (56M) wife died at the young age of 51 from a car accident. I was in deep mourning for about a year after her death. I met my new GF C (43F) around January. C was the one who made me laugh for the first time after my wife died. She’s smart as hell (3 Ivy League degrees), has a dark sense of humor that I love, a terrific cook, and overall an amazing woman who I can imagine spending the rest of my life with. She is also on the heavier side, a fact that becomes relevant later.\n\nI have 2 children, E (25M) and A (19F). They were well aware that I had gotten a new GF before I first introduced them to C this summer. She got along immediately with E, but A was very very standoffish. After that initial meeting I asked A if there was something wrong but she denied it. C made a few more attempts to get to know A but they were all rudely rejected.\n\nE and A both came home for Thanksgiving dinner. I asked A to please be polite during the meal since she’s always been rude in her interactions with C even though C has been nothing but gracious in return. The dinner was going as well as it could have for the first 10 minutes, although I noticed A glaring at C the entire time. When C went to grab her third helping of mashed potatoes, A said “Don’t you think you’ve eaten enough, you fat pig?” C started sobbing immediately and ran off into the bedroom. I felt my face turn red and told A to get out. \n\nAbout half an hour after A left I texted her stating that I would no longer pay her tuition unless 1. She apologized to C and 2. C accepts her apology. A must have assumed that I was bluffing because she instead doubled down on her behavior during Thanksgiving dinner. I then logged into her university’s tuition payment website, canceled next semester’s tuition, and sent A the screenshots. She called me crying and begging me to reconsider but I told her my mind was made up.",
        "edited": "False",
        "id": "e3f7tf",
        "is_asshole": 1,
        "num_comments": 8631.0,
        "score": 41713,
        "timestamp": 1575036708.0,
        "title": "AITA if I stop paying my daughter’s tuition over a disgusting comment she made towards my new girlfriend?",
        "verdict": "everyone sucks"
    },
    {
        "body": "My friends are dating, they’re also actors who have had small roles on a few tv shows (I’m talking two lines or less). I say this not to be a hater, I truly am rooting for them, but to give you a scope of their reach. Neither of them have a following in real life or on social media (they’ve got under 1500 followers combined). \n\nAnyway last week I posted a group picture on Instagram of people celebrating a friends birthday. Everyone in the photo has got their arms around each other’s shoulders. Very platonic. \n\nAnyway yesterday in a group chat between the three of us they asked me to take the photo down because they don’t want “the public” to know they are dating. I would consider it if they looked bad/too sloppy drunk/etc. but they don’t. Also everyone has their arms around each other, not just them. \n\nAnyway I asked what they meant, and they said they didn’t want to end up in gossip rags....\n\nI pointed out that they are not famous and that they don’t even have functioning IMDb pages. They were livid and called me a bunch of names. \n\nI think they’re delusional but they’ve been texting me demanding it and even sent me screenshots of them reporting it (nothing has happened). At this point, I don’t even want to be their friend. However, and probably because I’m an asshole, I don’t want to delete it based solely on principle.\n\nEdit: okay, so many of y’all are right. I suppose I should separate how I feel about their (ridiculous/delusional/stupid) reasoning with the fact that no one should have an image of themselves online that they don’t want made public. I’ll take it down.",
        "edited": "1566745536.0",
        "id": "cv96lf",
        "is_asshole": 1,
        "num_comments": 2572.0,
        "score": 36924,
        "timestamp": 1566743460.0,
        "title": "AITA for pointing out to my friends that they are not famous?",
        "verdict": "everyone sucks"
    },
    {
        "body": "This line at a Starbucks I went to was really long. I was in line for a good maybe 20 minutes. Until this lady in a Mercedes tries to cut in front of me and like 8 others behind me. I laid on the horn and tried to block her from cutting me but she succeeded anyway and flipped me off. \n\nOkay. I’m the type of person who will not let someone get away with shit like this. So I waited until she pulls up and as soon as she tries to order, I honk. She then looks at me with a dirty look and gives me the finger which I already had a middle finger of my own ready for her. Each time she makes an attempt to order something I honk and sometimes lay on the horn for 3 seconds. We stopped as soon as she drove off. We then ordered and went about our day. \n\nI just can’t people who are extremely rude like that lady and I couldn’t simply let this go. \n\nAITA for this?",
        "edited": "False",
        "id": "chvyp2",
        "is_asshole": 1,
        "num_comments": 2752.0,
        "score": 34797,
        "timestamp": 1564101578.0,
        "title": "AITA for honking at another driver who cut in front of me at a drive thru each time she tries to order",
        "verdict": "everyone sucks"
    },
    {
        "body": "Ever since we(27) had a baby, my wife had been talking like a baby herself.\n\n\nRather than teaching the baby to talk like a person, it's as if my wife's language has become baby-like. She would make noises in between conversations like \"Bo-dee-bo-dee-chooop\" and \"Awowo-fwatata\", even when talking with adults. This is especially embarrassing when I am with her in public places, when she talks like that to complete strangers. \n\n\nI have been telling nicely to her to not do that but she would just laugh it off, totally oblivious to how people around us stare whenever she talk like a baby. I have to point out that she is not in the spectrum, just a crazy new mum, in fact too crazy sometimes.\n\n\nIt was a day off for us when we have my parents babysitting the baby and we finally have some time by ourselves. We went out for dinner and she done it again, talking to the waiter, something like this:\n\n\n\"Yippy thanks ya-ha-ha-hah. Owoyoyaya by the way can you give us an extra plate for this?\"\n\n\nSeeing how the waiter staring at her as if she is some kind of mentality challenged. I rolled my eyes and told her:\n\n\n\"I am taking a break today and don't need another baby who cannot even talk properly to look after. Please excuse me.\" \n\n\nThen I left the restaurant without her. I don't know what occurred to me but I probably shouldn't have done that, but I guess it kinda just snapped. AITA?",
        "edited": "False",
        "id": "dk2rkt",
        "is_asshole": 1,
        "num_comments": 3832.0,
        "score": 33902,
        "timestamp": 1571486035.0,
        "title": "AITA for leaving my wife by herself when she talks in a cringy manner",
        "verdict": "everyone sucks"
    },
    {
        "body": "I am 31, and have an identical twin brother. For a while I’ve told my wife that none of her family members notice me or care about anything I do on Christmas Eve but they insist on me attending. She told me that’s not true, they genuinely like me and enjoy talking to me. But I know that the only times they’ve included me I had to basically insert myself into conversations and it feels awkward and unnatural. \n\nSo I had a wager with my wife. Bring my twin brother Steve instead of me, and see if anyone notices. I purposefully did not prep Steve on anything, he went in completely clueless (he knew why we were doing it and was game. I gave him $20.)  \n\nAs I suspected, Steve confirmed that he wasn’t approached all night, nobody could tell he wasn’t me, and he admitted he even felt excluded and he could only imagine how I felt. \n\nSo this morning on Christmas I invited Steve to join (normally he’s with my mom and dad every year as he’s not married or in a relationship.) they know about him obviously but didn’t know about the switcheroo. That was when I revealed that last night “I” was Steve and expressed disappointment that nobody noticed and said this is why I stopped trying, nobody talks to me. \n\nMy wife drew the line here, she was hoping we would keep this between the two of us as a funny prank. But how can I expect her family to see what jerks they’ve been if I don’t expose it? FWIW Steve was fine.",
        "edited": "False",
        "id": "efmpvl",
        "is_asshole": 1,
        "num_comments": 1997.0,
        "score": 32832,
        "timestamp": 1577312504.0,
        "title": "AITA for replacing myself with my twin brother at my in-laws’ Christmas Eve party to see if anyone noticed?",
        "verdict": "everyone sucks"
    },
    {
        "body": "For reference, my brother Connor is 19, I am 26, and my (now ex) fiancé Hunter is 28. Also for reference, already mentioned in the title, but my brother was kicked out when he was 16 because our parents snooped through his phone and found out he was in gay.\n\nConnor had a birthday last weekend, so he invited his friends over and they were all (18-22 year olds) drinking and playing games. Hunter and I were about to head out to let them have the place to themselves, when Connor asked if we wanted to join them. I initially refused (bit too old to be playing drinking games), but he insisted and Hunter thought it’d be fun to act like college students again.\n\nWe all got pretty drunk and Connor had the idea of playing Never Have I Ever. A few rounds in, the statement “Never Have I Ever cheated before” came up.\n\nNow’s a good time to mention that Hunter is **staunchly** against cheating. His ex-fiancé cheated on him and it emotionally wrecked him. And unfortunately, as a lot of dumb, immature 17 year olds do, I cheated on my “boyfriend” of 5 months. It was a stupid mistake, he found out, and (understandably) ended things. This was almost a decade ago, I obviously learned my lesson, and look back at that time with shame (and obviously never cheated since).\n\nWell my brother knows about this so when I didn’t drink, he went “hey sis, what the hell? You know you cheated on (*insert ex’s name*). You have to drink to that!”\n\nMy boyfriend paused, looked at me, looked at him, and just walked out of the room. I followed him and tried to talk to tell him that it was a stupid teenaged mistake, but he wasn’t haven’t any of it and ended things on the spot. I’m numb. I’m heartbroken. He was my everything and more and I still don’t know how I’m going to move on.\n\nConnor tried to apologize, but I feel nothing but sadness and emptiness. This morning I served him an eviction notice. He begged me to stay and said he didn’t mean to ruin my relationship and he just didn’t think when he said those words. I just can’t look at him right now. He ruined my life. After I raised him and cared for him like he was my own. I feel so hurt. Am I being unreasonable?",
        "edited": "False",
        "id": "chb37s",
        "is_asshole": 1,
        "num_comments": 7716.0,
        "score": 32371,
        "timestamp": 1563988805.0,
        "title": "AITA for kicking out my brother, who our parents have previously disowned, because he told my (now ex) fiancé that I cheated 9 years ago?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Me (28M) and fiancee (27F) have been together for 4 years, engaged for 6 months. I also have a 7 year-old lab mix who is the greatest dog in existence.\n\nOn Saturday, fiancee had a bachelorette party at home. I stayed with my parents but I left the dog with her because she likes having him there. However, *I made sure to tell her to put the dog in our bedroom once the party gets going*.\n\n5am on Sunday I get a frantic call that something's wrong with the dog. She was drunk, so I told her to get a taxi and go to the emergency vet clinic. When I got there, she looked like she hadn't stopped crying for hours and she couldn't even speak. Two of her friends were there so they told me my dog is alive but not well. I felt sorry for her for an entire 10 minutes while waiting for the doctor.\n\nBut then, the doctor told me my dog ingested large amounts of alcohol and chocolate edibles. The girls apparently thought it would be cool to leave everything out on short coffee tables, leave the dog to wander around instead of putting him in our bedroom, and then get wasted and not notice he was going to town with the booze and edibles.\n\nWhen we got home, I told my fiancee to pack and get out of my house and my life. I told her to tell her guests the wedding is off, and I'll tell mine. She was shocked, but she took her things and left.\n\n2 hours later, I get bombarded by messages on Messenger, Whatsapp, by her sisters, brother, brother's wife, her mom, her friends, telling me that I am insane to do this to her after 4 years. They started off defending her, but it quickly turned into insulting me.\n\nThe logical thing for me to do was look for comfort in my friends and family. Nope. They all fucking agree. My mom said: \"Well, it was a mistake, she didn't do it on purpose, besides - the dog didn't die!\" Lucky me, eh? My dog didn't fucking die!\n\nMy sister was appalled that I cancelled the wedding \"over *that*?!\" and even my best man said I might have overreacted. Yes, our relationship has had ups and downs, but it's mostly worked fine. But I am so disgusted at my fiancee that I can't even imagine looking her in the eye, let alone spending my whole life with her. She isn't fucking 17, she is 27!\n\nBy the way, this is not the first dumb thing she has done. She likes to text while driving, she always leaves stuff on the electric stove (like kitchen towels, the cutting board etc.) even though she has turned on the wrong burner and burnt whatever was on it several times in the past, and similar DANGEROUS things. It's not something I hold against her in the sense that I would ever mention in a fight, but I'd be lying if I said I wasn't worried that she might end up killing herself or someone else. For example, my dog.\n\nI'm 99% sure I will stand by my decision. But am I really an asshole? Literally nobody is on my side and I have no idea what to think.\n\n&#x200B;\n\n**",
        "edited": "1557423341.0",
        "id": "bmi2qj",
        "is_asshole": 1,
        "num_comments": 8018.0,
        "score": 29672,
        "timestamp": 1557397698.0,
        "title": "AITA for cancelling my wedding because fiancee almost got my dog killed?",
        "verdict": "everyone sucks"
    },
    {
        "body": "\nI was hanging out with a friend of mine and a group of her friends. We were all talking and having drinks, and the topic of dating comes up in conversation. \n\nFor some background information; I’ve only had one boyfriend (I’m 24) we dated for 4 years, and broke up about a year ago. I’m mostly a loner. I’m fine with being single right now and have no interest in dating at the moment. My friend knows this. \n\nShe starts lightly teasing me in front of her friends, pretty much calling me a spinster. She “dates” a lot. Every week she tells me about two or so guys that she’s slept with. This kind of started a pile on, where everyone was teasing me, and giving me unsolicited advice. I tried to placate it, but she kept bringing the conversation back to me and my (lack of) a sex life. \n\nEventually I got really heated, and just said “so is your crotch still burning or is that cleared up? What did they say about that? Was it guy 104 or 105 that gave it to you?”\n\nLike three weeks ago she called me crying to take her to the clinic because she had painful itchy blisters on her groin, turned out to be herpes. I did it without judging her at the time. \n\nShe quickly stood up and left the table. I tried to follow her to apologize and she went off about me outing her to her friends. She was telling me how I was the only person she trusted, and she couldn’t believe I would act that way. I tried to remind her how she and her friends were dog piling me, and she said it was just jokes, I didn’t have to react that way. \n\nWe are obviously not speaking right now. Was what I did justifiable self defense? I know I probably wouldn’t have done it without liquid courage.\n\nEdit:\n1. I did ask her to stop, i was trying to keep things friendly. \n2. I did not say that she had herpes. I said she had a burning crotch.",
        "edited": "1576783932.0",
        "id": "ecu3p4",
        "is_asshole": 1,
        "num_comments": 3917.0,
        "score": 29597,
        "timestamp": 1576766588.0,
        "title": "AITA for telling my friend she got an STD from sleeping around?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Me and Diomara (12F) have had a rough summer.  She's been more defiant than usual.  I've been dating her Mom Mara (30F) for 2 years now.  9 moths ago, they moved in with me, Maple (33M).  Both Dio and Mara have an on again/off again relationship with Dio's Dad (Dynasis).  He's pretty much never paid child support, comes and goes as he pleases into Dio's life.   Typical shitty-ass part time Dad.  I've tried to fill the Dad role in her life, while still understanding boundaries, taking things slow, etc.  \n\n&#x200B;\n\nThis summer Dynasis decides he wants to be a real Dad and takes Dio in for a month.  Good for him, not my business, and Mara agrees.  When Dio came back home because school started she was a lot different.  Really mean to me, very dismissive.  A few days ago she got caught shoplifting at the mall.  Security took her in then called Mara, who didn't answer, then called Dynasis, who didn't answer, and finally me.  I answered.  They told me I had to pick her up or she'll be handed over to juvenile.  \n\n&#x200B;\n\nI didn't say anything to her while I picked her up.  I apologized to security, apologized to the store.  I even tipped the security guards plus the store employees because its fucked up they had to deal with that.  I assured them Dio would be punished appropriately.  \n\n&#x200B;\n\nI'm speaking to her in a strong, affirmative, voice while we're in the car.  NOT yelling, but in a fatherly tone, I suppose.  I'm telling her how fucked up it is to steal, and how I dont fuck with thieves, and how I absolutely don't voluntarily fuck with any kind of police so I don't appreciate any of this nor will I accept it in my house.  She snaps back that I'm not her Dad so don't ever tell her what to do.  From now on, if I wanna tell her something I need to clear it with her real father first.  \n\n&#x200B;\n\nThat killed my soul.  For the past year or so, I've treated her as my own daughter.  I've paid for their housing, I've paid for her moms car, her schooling, her food, everything.  Her bio Dad dropped $100 check off one time in the past year.  The fuckin check bounced so I had to call him up and he brought cash over.  I told Mara about all of this.  She was appalled at what Dio said, but she never made Dio apologize because \"she's not wrong, you're not her Dad.\"\n\n&#x200B;\n\nA couple of days later Dio asks me for some money to pay for her uniform/accessories she needs for a sport she's involved in.  I say go ask your Dad.  She scoffs and says her Dad doesn't have the money for it, so I have to pay for it.  I tell her...I'm not her Dad so don't ever tell me what I have to pay for.  She cried to Mara, who tells me I'm not being an adult about the situation.  Mind you, I never received an apology or a thanks for our entire previous situation.  Mara says Dio is a kid and I need to stop acting like a kid too.",
        "edited": "False",
        "id": "d7ma4k",
        "is_asshole": 1,
        "num_comments": 1655.0,
        "score": 28742,
        "timestamp": 1569130153.0,
        "title": "AITA for telling my GF's daughter she's not my daughter so don't expect me to pay?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Unfortunately my girlfriend's social skills aren't excellent and as a result whenever she is annoyed at me she is totally incapable of expressing why she is annoyed, so she resorts to totally ignoring me.\n\nYesterday at 1:00 we were supposed to meet up for a birthday meal for a good friend. In the morning I sent her a few messages saying \"what time should I pick you up\" and such, all of which went ignored. I decided to just pretend that she was asleep and I went without her. When I arrived I just made a joke saying \"I think she's still asleep\", she hasn't replied to any of my messages. At about 12:45 I got a string of messages asking where I was and what's going on. I just played dumb and said \"Wait, you're ready? I thought you were still in bed or something??\"\n\nI knew fine well that she was ready to leave the house but I didn't want to play this stupid game and I don't like the disrespect of being totally ignored like this, so I just decided to not pick her up.\n\nObviously she was mad at me and had no idea how to express her emotions besides bursts of anger and then ghosting.",
        "edited": "False",
        "id": "dnrvcc",
        "is_asshole": 1,
        "num_comments": 3740.0,
        "score": 28682,
        "timestamp": 1572174354.0,
        "title": "AITA for not picking my girlfriend up for a birthday meal and telling everyone she is probably asleep because she ignored my text",
        "verdict": "everyone sucks"
    },
    {
        "body": "For the past month my 24 year old niece has been living with us. I'll call her Princess because that's what her parents call her most of the time. She is a medical researcher (Studied medicine but wasn't interested in the practical side of things more interested in the theoretical) and took up a position near where we live, and my sister convinced me to let her stay so she can save money. I was apprehensive because I know this girl has been coddled and babied since she was little. \n\nWe have a 4 bedroom house. Me and my husband, my son (16), my daughter (21) and our 4 year old rottweiler Freddie. I told sister that Princess would have to sleep on the sofa in the living room which she seemed OK with, but when she arrived both mother and daughter set about trying to convince me to clear out the dog's room and let her sleep in it. Princess even said it would be OK to make him sleep outside because ''it's just a dog''. It's getting a lot colder now and I'd never let Freddie sleep outside. \n\nI told Princess that this is where she'd sleep, take it or leave it, and she was and still is really sulky about it, sulking about how we think a dog is more important than her. \n\nIn all honesty I was right in thinking having Princess stay is more trouble than it's worth. She goes out clubbing and partying a lot and makes no effort to keep the noise down when she comes home in the early hours of the morning. Since she's arrived the living room smells of weed and that smell definitely wasn't there before she came. \n\nShe's also rude to my kids. My daughter got engaged and we were all delighted, but Princess was lovely enough to say that if her BF had gotten her a ''cheap'' ring like that she wouldn't even get out of bed for the wedding. Daughter was in tears because of this and both husband and I had a word with Princess, who then cried and phoned up her mother saying we were rude to her. \n\nHad another phone call with sister today, and she still tried to convince me to put her daughter in the dog's room. I made clear this wasn't happening and sister got upset with me saying how nasty it was to value pets over family. I also said that her daughter was skating thin ice and that I wouldn't tolerate her behaviour for much longer. Sister was very offended and said we should be happy to have her daughter there. Sorry but how can I be happy to have a spoiled overgrown child who keeps trying to steal a room from a dog in my home?\n\n\n\nAlso, the people who claim that I was being nasty to her because I didn't like her and things like that. I don't dislike her at all. I was apprehensive about having her because having known her since she was born, I've seen many of her tantrums and seen her parents give in to them over and over again even into her adulthood. I was worried about how things would turn out since we wouldn't give into her demands. She has tried to pick on both my children when she was a teenager and we went through a period a few years back when my daughter refused to visit their home because Princess constantly bullied her. \n\nRegarding the dog's room. There isn't any furniture in Freddie's room that a 24 year old woman could comfortably sleep on, and we weren't about to go and buy furniture since we didn't know how long she'd be staying. \n\nAnd for those who think I was trying my best to make her uncomfortable, not at all. We tried our best to make her feel welcome. Gave her as much space as she wanted and left the living room whenever she needed privacy. We gave her food and while she brought more than enough clothes for home, I went clothes shopping with her and was happy to pay out of my own pocket. Within her first week here, Princess couldn't stop laughing when my daughter told her what she did for a living (hairdresser), said that Freddie should sleep outside and shouted at my husband because he hadn't cooked dinner quick enough, so you can't blame all this on me. \n\nRegarding the weed and clubbing thing: I've nothing against weed use. I smoked it a few times as a teenager, as did my husband, and I'm 99% sure my kids have both done it at some point, but that fact is it's completely illegal in this country. If she was doing it away from the house I would not care at all. I wouldn't even have too much of a problem if she was smoking it outside, but it is obvious from the strong smell that she is smoking it in the house. I'm well aware that going out clubbing and making noise is what most people her age do. However, this particular 24 year old doesn't bother to take her high heels off when she comes in, and as we have a wooden floor we can hear her stomping around in them which wakes us all up. \n\nLast but not least, I didn't call her ''Princess'' on here offensively. I wasn't going to put her real name on here obviously, and the fact is her parents genuinely do nickname her Princess most of the time, and she doesn't mind it when they call her it.",
        "edited": "1569870601.0",
        "id": "db9dtn",
        "is_asshole": 1,
        "num_comments": 11906.0,
        "score": 26763,
        "timestamp": 1569838334.0,
        "title": "AITA for refusing to give my niece our dog's room?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I went on a dinner double date with my girlfriend, my girlfriend’s friend Amy, and Amy’s boyfriend. We’re all in our early 20s. My girlfriend hangs out with Amy quite often. I see her from time to time, but I’ve never cared for her cheeky attitude. The tipping point was tonight. \n\n\nDinner was going alright until Amy’s boyfriend innocently commented on how little my girlfriend ate. She usually gives me half her entrée. After that, Amy, who isn’t stick thin like my girlfriend, snidely remarked that my girlfriend wouldn’t need fake boobs if she ate like a real woman. \n\n\nI loudly told her to watch her fat goddamn mouth and that her comment was both rude and unnecessary. Amy isn’t overweight by most standards, but that adjective slipped out because of what she said prior. Many people turned their eyes toward us. \n\n\nMy girlfriend and Amy’s boyfriend tried to quell the ruckus, but Amy got up and told me to have fun with my Barbie doll before she motioned Amy’s boyfriend to get up and leave with her. Don’t worry, you pay before you get your food at this restaurant. \n\n\nMy girlfriend and I talked about Amy. She kept saying that Amy and some of her friends make those comments all the time and they don’t mean them to be derogatory. I tried to convince my girlfriend that no friend would make those types of comments and she’s better off without someone like Amy in her life. \n\n\nMy girlfriend still thinks that Amy didn’t mean to hurt her with the “real woman” and “Barbie doll” comments and I didn’t read the room correctly. She told me she feared Amy not wanting to be friends with her anymore after my creating a rift between them. I couldn’t get though to her no matter how much I tried.",
        "edited": "False",
        "id": "e5dc9j",
        "is_asshole": 1,
        "num_comments": 3363.0,
        "score": 23532,
        "timestamp": 1575356830.0,
        "title": "AITA for telling my girlfriend’s friend to watch her mouth when she insinuated that my girlfriend isn’t a real woman?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I'm 99% sure I'm a megga asshole but I came here to just be sure. \n\nmy sister 23f is a megga pro life advocate, here is the stupid part, I held her hand a year ago when she got her abortion. she never mentions it and I can guarantee that I'm the only one who knew. \n\nI always feel like she is being super hypocritical because she got an easy access to have an abortion and then wants to take that away from others. \n\nI was getting sick of seeing her abortion kills babys posts and how she hates pro choice people so I decided to comment on one of her posts. I commented, you where definitely pro life when I held your had last year at the abortion clinic. \n\nI've now been blocked and she was banned from most of her pro life fb groups. \n\nAITA?",
        "edited": "False",
        "id": "c2esxa",
        "is_asshole": 1,
        "num_comments": 4335.0,
        "score": 23320,
        "timestamp": 1560935644.0,
        "title": "AITA for telling people my sister had an abortion.",
        "verdict": "everyone sucks"
    },
    {
        "body": "When my wife \\[32F\\] and I \\[32M\\] got married eighht years ago, she made about 15K more per year than I did. Our agreement at that time was that we'd keep separate checking accounts plus a joint for household expenses, with the understanding that money left over after contributions to household expenses, savings, retirement, etc. would be put in the separate accounts and we could spend it how we wanted. My wife was the one who insisted on this, and although I was not a fan (wanted joint accounts for all funds), I agreed since she felt strongly about it.\n\n&#x200B;\n\nA few years after we married I decided to go to law school. Long story short, I ended up at a big law firm and now earn about four times what my wife does. Since I managed not to go into debt, I have a good bit of money left over after I make my contributions to our joint expenses.\n\n&#x200B;\n\nMy wife  asked me to reconsider this arrangement (she doesn't feel like its fair that I get to buy most of the things I want while she is on a much more limited budget), and I told her I would not reconsider it since this is what she wanted originally. I think fair is fair since this was her idea, but I do wonder if  I am wrong for refusing to reconsider our financial arrangement?\n\n&#x200B;\n\nAITA?",
        "edited": "False",
        "id": "d0ariq",
        "is_asshole": 1,
        "num_comments": 163.0,
        "score": 23219,
        "timestamp": 1567737846.0,
        "title": "AITA for refusing to share my extra income with my wife when she didn't share hers with me when she earned more?",
        "verdict": "everyone sucks"
    },
    {
        "body": "My friend is marrying my ex boyfriend of four years. It's been pretty awkward. I was kicked out of her wedding party because I was uncomfortable wearing a very revealing bridesmaid's gown. This wasn't that big of a deal as we're not exactly close since she got with my ex. However, she still expects me to take on all the duties of a bridesmaid. I told her that was ridiculous and that she needed to find a new bridesmaid. She then almost uninvited me from the wedding but instead decided I could go I follow a very specific set of rules (ranging from how to dress to who I could talk to). I was absolutely crushed as I was still looking forward to the wedding even if I wasn't going to be in it. I found out through a mutual friend who is still in the wedding party the bride continuously makes fun of me and talks shit about me constantly and so do several of the other bridesmaids. I was about to just not go when I ran into the bride's ex who is also invited to the wedding (He's the groom's cousin). He was also kicked out of the wedding party and was given a list of rules to follow. He and I have decided we're going to go together and have fun breaking as many rules that we can (such as wearing what we want to wear, drinking at the open bar, talking to whoever we want to, and dancing- WE'RE NOT ALLOWED TO DANCE). Nothing we would do would distract from the bride's big day other than breaking the ridiculously petty rules that we're supposed to follow. We're also both at the point where we're both ready to sever ties with the bride and groom. Would we be the assholes? Sorry if this was scattered, a lot happened in the past month and her wedding is in three weeks. Thanks in advance, I'm willing to accept my judgement!",
        "edited": "False",
        "id": "eg8hdn",
        "is_asshole": 1,
        "num_comments": 3518.0,
        "score": 22022,
        "timestamp": 1577434288.0,
        "title": "WIBTA for taking my friend's ex as my date to her wedding after I got kicked out of her wedding party?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Every year on our anniversary, my fiance and I wake up early to go to the beach and watch the sunrise together. It's a very special tradition, as we have both overcome a number of personal challenges during our time together, and the symbolism of watching a new day begin is deeply meaningful for us. \n\nWe decided we wanted to incorporate this into our wedding. Our plan is to have our ceremony on the beach the and have everyone walk over to a beachfront restaurant for breakfast, bloody Marys and mimosas (we've already talked to the restaurant owner about this, who loves the idea and said he'd be happy to open early for us). After that, everyone is free for the remainder of the day. Our friends and family are mostly local and should all be able to travel to the beach in under an hour, except for some extended family flying in from Canada, but that's unavoidable.\n\nBased on our geographic location and the date of the wedding next summer, we've scheduled the ceremony start time for 5:30 a.m., when there should be plenty of light but the sun itself won't be quite visible yet.\n\nWe've been getting a LOT of backlash from our families about this, who say this is way too early and we need to move the ceremony to a more \"normal\" time of day. But my fiance and I don't feel like we're asking for anything that unreasonable. AITA?",
        "edited": "False",
        "id": "dnh2km",
        "is_asshole": 1,
        "num_comments": 3352.0,
        "score": 21579,
        "timestamp": 1572111516.0,
        "title": "AITA for wanting a sunrise wedding?",
        "verdict": "everyone sucks"
    },
    {
        "body": "This will be on a throwaway so it’s not attached to my main account. \n\nI have a lot of tattoos. My most recent tattoo is a tattoo that I designed with my husband. We got matching ones for our anniversary. It is super personal. \n\nAs I was showing it off to my friends, I notice one girl in our group (who I’m not super close to) was really into it. She even took a picture of it which I thought was strange but I let it slide. \nLet’s call this girl Sarah. \n\nSarah does not  have any tattoos that I know of, if she does they are really small and in unnoticed places. So a week or so later I hear through the grape vine that Sarah is trying to get a copy of my tattoo. honestly I suspected this. She told a couple of friends of mine the design, and for some reason, didn’t think that they would tell me. But here comes the crazy part, she comes to me and asks me for a recommendation for an artist. She specifically wanted one that wasn’t too expensive.\n\nI asked her what she was going to get. She was really coy with me and told me that she had not finished thinking about it yet. So I recommend the worst tattoo “artist” I know, let’s call him Bubba. I’ve gotten two “joke” tattoos from Bubba, one is terrible and blown out ,but it’s okay because it’s that duck or rabbit optical illusion. The other one I have had covered up. He works at subway during the day and gives tattoos from his garage. \n\nI knew she wouldn’t do her proper research and check him out, and she didn’t. She went and got her cheap tattoo from Bubba, and it is *fucked. up* It’s already blown out, the lines aren’t straight,  and may be infected.  My husband and I are howling about this, but a few friends of mine think what I did was really messed up. She’ll be ok, she’ll just have a really really shitty version of my tattoo. I think it’s what she deserves. So let me know reddit, AITA?",
        "edited": "1576593117.0",
        "id": "ebo6w2",
        "is_asshole": 1,
        "num_comments": 1664.0,
        "score": 21535,
        "timestamp": 1576543819.0,
        "title": "AITA for recommending the worst tattoo artist I know to a girl that was trying to copy my tattoo?",
        "verdict": "everyone sucks"
    },
    {
        "body": "My GF and I were out at a club to see a DJ. We were dancing, drinking, having a good time. My GF has been doing yoga for a few years and when she’s especially sauced she likes to throw in some splits and stuff on the dance floor. Well, we got sauced and as she’s doing her 3rd split or so a guy comes up and “makes it rain” on her - literally like 4 dollars. Obviously he was making a joke that she was dancing like a stripper. Whatever. This happened and in the moment I just fucking started laughing. I thought it was legitimately funny in the moment. My girlfriend gets up and says “we’re fucking leaving” and basically storms out. Get outside and she’s basically telling me that I should’ve punched the dude out or something and that he made her feel like a whore and I’m an asshole for laughing. I’m fucking 31, I’m not punching anyone out at a bar unless they’re actually getting physical or threatening to get physical. While I agree that it might’ve been somewhat demeaning, I also think it was objectively funny. AITA?",
        "edited": "False",
        "id": "c8bq11",
        "is_asshole": 1,
        "num_comments": 3302.0,
        "score": 21268,
        "timestamp": 1562086865.0,
        "title": "AITA for laughing at a guy throwing dollars on my girlfriend at a club?",
        "verdict": "everyone sucks"
    },
    {
        "body": "So, i’m 24M. My little sister is 14 and has always been interested in art. I moved an hour and a half away when I was 18 and we \ndon’t see eachother often, but I make a point to call/text\n\n\nIt was her birthday yesterday and I thought I’d splurge since she’s been going through a rough time. She’s changed schools twice due to bullying and our mom always tells me that she won’t talk to anyone, is having intense mood swings, etc. I’ve made multiple attempts to help her, but she shuts me down and gets snippy.\n\n\n\nAnyway, I got her a set of 150$ artist grade markers called Copics. I’m no art connoisseur, but apparently every artist who’s anybody has them and our parents don’t wanna spend that kind of money for her hobby (they’re about 5$ PER MARKER) and tend to give practical gifts like clothes. Whenever we’ve texted recently it’s been her ranting about them not getting them for her.\n\neven on her birthday she was like a bomb about to go off. She barely acknowledged me and only said hello when she was asked. I was excited to give her the gift but the second I opened it she grabbed them and turned to our mom, saying “See! Even he knows you should’ve got them for me!” Which I awkwardly brushed off. Everytime she opened a gift from our parents it was very snotty like “Oh, yayyyy, cheap sneakers, my favorite.” “A plaid skirt. WOW. I’m blessed.” \n\n\nI was prepared for an angsty teen, but I soon reached my limit. Our dad showed her a journal they bought and she suddenly yelled “I told you both exactly what I wanted but you spent the same amount of money on shit I don’t need! Fuck this!” she threw it against the wall and ran up to her room.\n\n\n\nOur parents were a lot less well-off when I was her age, and they could barely afford a birthday for me. Everytime it was a dodgy cake and a handful of clothes without holes in them, I accepted them like I was the luckiest kid ever. I would’ve never swore and yelled but she’s been very spoiled.\n\n\nI talked with them for awhile and apparently shes done worse before which shocks me. They think even if they can afford it now, she should learn the value of a dollar. I agree helped shape me to not have my every whim be attended to. Besides, she got what she wanted in the end, why is she still mad in the first place?\n\n\nSister came back to get the markers, but I took them back. I said that she was ungrateful and I wouldn’t tolerate it. She started screaming at me but I just left the “party” prematurely with the gift in tow.\n\n\n\nMy whole family is blowing up my phone because I “ruined her birthday”. In my eyes, I spent 150$ to get no thank-you and yelled at. This will teach her a valuable lesson and maybe spark a change in her teen angst phase. But my family doesn’t want to hear from me until I give it back. Considering I’ve got my entire family shitting on me, I have to wonder if I did make the wrong choice. So, reddit, AITA?",
        "edited": "False",
        "id": "bsfwo8",
        "is_asshole": 1,
        "num_comments": 2868.0,
        "score": 20903,
        "timestamp": 1558698294.0,
        "title": "AITA for taking back the birthday gift I gave my sister?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Update 2: I told my ex to cancel her vacation as my son will not be going because it affects my custody time. Yes, I told her it was okay but after her husband's stunt of saying he couldn't do the sleepover which was on my day anyways, I had to crack the whip. Let those two eat each other alive. They deserve each other.\n\nUpdate 1: This HILARIOUS. My son's best friend mom emailed us an invite for a sleepover which is on my DAY. I was going to see if my son wanted to go, but my ex's husband said my son could not go as he was grounded. I can react in so many ways...\n\n\nHis mom and I are divorced and don't have much of a relationship. Cordial, but indifferent. Our son is now 11 and my ex remarried a few years ago but she was with the guy for some time.\n\nWe have 50/50. She requested that she have him for two weeks for vacation. I agreed even though this ate into my time with him. Apparently, he got into it with step dad and he got grounded for a week. Well, most of that week is my week with him before he leaves for vacation with them and she asked me to see to it that his grounding continues through my time. I won't see him for three weeks. I am not saying not to punish him. \n\nPunish him when he's on their time. \n\nI have no problems with him when he's with me.\n\nI refused.\n\nI already made plans to make most if the days that I have him and I'm sure as hell am not going to cancel those plans because he mouthed off to step-dad. I don't care much for step-dad anyways. What I do with my son on my time is my business and vice-versa. \n\nAlso, I don't want to set precedent where I am the parent who has to do both sides of discipline.\n\n\n",
        "edited": "1566649425.0",
        "id": "cugrhz",
        "is_asshole": 1,
        "num_comments": 2444.0,
        "score": 20769,
        "timestamp": 1566580104.0,
        "title": "AITA for not honoring my son's punishment?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I know the title already sounds like i'm a major asshole, but there is a few more variables that need to be discussed before you make your decision. \n\nAlso, this is a throwaway acct for obvious reasons\n\nSo I meet a girl on Tinder named \"Kim\" and we exchange a few messages before deciding to meet up for coffee.\n\nThe date is going OK, although it was a bit boring, we grabbed our cup of starbucks (i paid) we chatted for a bit and decided to drive to a cool little outdoor park to go for a walk. \n\nWe drive around 30 mins to this park, listened to a bit of music on the way, still getting to know each other a bit and everything was going fine. \n\nI parked, we got out of the car and walked a bit, still chatting, nothing deep, but the usual what you do for work, hobbies etc etc.\n\nI had to take a leak, so I go to the bathroom and when I walked out, I noticed she was talking to a guy and he was being very flirty and when I walked up to them, he asked who I was and she responded: \"oh he's just my friend hahaha\" and he said he wanted to grab her number to go out for a drink sometime. She was all too happy to give him the number and they hug with a kiss on the cheek before he leaves. \n\nAt this point I was just over it. I wasn't that interested in her and if she's the type of person to show interest in another guy and exchange info in front of me I have no future with her.\n\nI decided to make up some random excuse to get away from her and just got in my car and drove home. I didn't want to have to deal with her company for a 40 minute drive and was over it. \n\nOh well, I honestly feel like a bit of an asshole, but also feel it was just in a sense considering what happened....",
        "edited": "False",
        "id": "aujbdh",
        "is_asshole": 1,
        "num_comments": 682.0,
        "score": 19782,
        "timestamp": 1551086387.0,
        "title": "AITA: I ditched a girl 40 minutes from her house on our first date",
        "verdict": "everyone sucks"
    },
    {
        "body": "Hi AITA. I am going to try to make this as brief as possible so I don't ramble.\n\n&#x200B;\n\nI dated Em for a year and a half. During this time I confided in her some personal secrets, which I don't feel comfortable sharing even anonymously. Because of these she knows that there are certain things, related to sex mostly, that I am very sensitive towards.\n\n&#x200B;\n\nWe did not part on friendly terms after our breakup and we don't talk anymore. I broke up with her because I found out she cheated on me, and she flipped out. Recently I found out that she is seeing one of my coworkers, and that he is spreading rumors about me that she told him. She basically told him bits and pieces of the personal information I shared with her when we were together and now he's spreading some of that around the office.\n\n&#x200B;\n\nI sent her a message telling her to stop spreading my secrets around and to leave me alone. She replied sending me explicit videos of herself having sex with my coworker because she knew it would hurt me. That was the last straw for me, and I sent the video to all of her family and friends with the message that \"this is what Em sends me when I ask her to leave me alone and stop spreading rumors.\"\n\n&#x200B;\n\nHer familly is quite religious and they lost it. Apparently, they pulled their financial support for her college and arent speaking with her atm. AITA?\n\n&#x200B;\n\nTL:DR my ex sent me unsolicited sexual videos when i asked her to leave me alone. I sent them to her family. AITA?\n\n&#x200B;\n\nEdit: Well this blew up. I'll try and answer some of the things I have seen asked most often here:\n\n&#x200B;\n\n1: I feel somewhat obligated to clear the air that no, the information being spread was not that I have a small dick, or anything else that was trivial. To put things as general as possible, and to give an idea of how serious the rumors being spread were, I was a victim of CSA for a period of several years, and it had a pretty profound impact on my life. It led to me doing some pretty stupid things to cope with it, as well as having a bunch of issues that I struggle with to this day (I never hurt anyone in any way, but there's some shit that I've done that I'd like to not have spread around). She has been picking and choosing the parts from my history that she feels will most hurt me to have spread around, and adding a few stories of her own here and there.\n\n&#x200B;\n\n2: By all of her friends and family, I meant her parents, brother, and a couple of close friends. I worded that terribly. I have not been in the best headspace as of late. Sorry.\n\n&#x200B;\n\n3: We have not spoken since. I have no desire to speak to her ever again. My coworker has been on sick leave (apparently) for the past couple days and I have not heard anything from him. As petty and shitty as this sounds, she can die for all I care. I have gone to bed hating myself for ever involving myself with that person ever since she cheated on me. Maybe I am an asshole too for my reaction, but she can get bent. I feel no guilt whatsoever for any shit she has to go through because of this.\n\n&#x200B;\n\n4: I will be speaking to my lawyer tomorrow to see what he thinks. I have the money to fight a legal case if I have to, though obviously, I would rather not.\n\n&#x200B;\n\nyeah. that pretty much the main things I wanted to clear up. I'll go through the thread tomorrow if I feel up to it and see if there's anything else. It's a bit of a shitshow and I'm not really emotionally in the right place to read through 1k+ comments atm",
        "edited": "1556251365.0",
        "id": "bhdnls",
        "is_asshole": 1,
        "num_comments": 2148.0,
        "score": 19561,
        "timestamp": 1556225115.0,
        "title": "AITA for sending an explicit video my ex sent to me to hurt me to her family",
        "verdict": "everyone sucks"
    },
    {
        "body": "This happened a couple of days ago and I was really pissed. I'm here because I want to know if I'm in the wrong here. \n\nMy wife is going to give birth to our twin daughters. I've done everything to support her. I make breakfast everyday and I make it a point to make whatever she asks me to make. \n\nYesterday, my wife woke me up at 2am and told me that she wanted to eat icecream. We had no ice cream left because she ate it all at night. I really wanted to get her the ice cream. She told me that she wanted choco chip. I drove for an hour to find a place at that time. But they didn't have any choco chip at that time. I didn't want to disappoint her, so I got strawberry, her next favourite flavour. \n\nWhen I got back, I told her that I didn't find choco chip. Idk what happened but she started crying and yelling  at me. She threw away the ice cream, called me a fucking imbecile and told me I didn't love her. She also told me that she didn't want to sleep next to me. I slept in another room. \n\nNow today, she comes to me, cries, apologizes and tells me that she was really stressed out. But I did not sleep with her at night. I've decided that I don't want to do anything now. This is not the first time this has happened. I'm not a fantastic cook. She insists that I make something for her, but when I make it she always tells me that it's horrible. She later apologizes and tells me that it was wonderful ( all this started after the pregnancy ). WIBTA here??",
        "edited": "False",
        "id": "bgh3m9",
        "is_asshole": 1,
        "num_comments": 2383.0,
        "score": 18662,
        "timestamp": 1556030138.0,
        "title": "WIBTA if I tell my wife that I will no longer be helping with her pregnancy cravings or sleep next to her because she lashed out at me for not finding choco chip ice cream at 3am?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I am a college student who wears hearing aids, which help a lot but I do still have diminished hearing. I struggle hearing in loud background noise or while talking to a person with an accent. When choosing classes, I pick professors with English names over foreign ones. Last week, while registering for classes next semester, I mentioned this to my friend (who, FWIW, is a native English speaking white person) and he called me a racist asshole and hasn’t spoken to me since. AITA?",
        "edited": "False",
        "id": "cil848",
        "is_asshole": 1,
        "num_comments": 2199.0,
        "score": 18559,
        "timestamp": 1564252962.0,
        "title": "AITA for avoiding taking classes taught by professors with accents?",
        "verdict": "everyone sucks"
    },
    {
        "body": "So my brother passed away in August, we’re identical twins with the small exception that he had facial hair and I do not, other than that we’re pretty much carbon copies. My SIL did not take their kids (2 and 4) to the funeral as it would’ve been traumatic to them and I totally respect that, however, she has also let them Believe that he is me. I’ve been at the house often helping out with the kids and doing whatever I can with them and I feel as if I am also sort of helping her in a way by not really letting them process that I am, in fact, not my brother. She’s caught onto it too, but won’t tell them and I Think it’s cruel on her part to do that to them. She has to be apart of the telling process but she keeps putting it off and I refuse to let it snowball into something far worse on the children AND her. She’s never made any advances toward me but I also believe in her mind this is how she’s coping, by pretending he isn’t really gone because she “technically” does still see “his” face everyday. Would I be the asshole if I told them that their dad died and it’s really just uncle J helping around the house?\n\nI’m also concerned that at a certain point, I can’t “reintroduce” myself back into their lives because I look exactly like him.",
        "edited": "1571281300.0",
        "id": "dizqin",
        "is_asshole": 1,
        "num_comments": 1255.0,
        "score": 18410,
        "timestamp": 1571278345.0,
        "title": "WIBTA if I told my nieces their dad died and isn’t me?",
        "verdict": "everyone sucks"
    },
    {
        "body": "my mother in law is a horrible person who loves to create drama whenever she can. \n\nlast Christmas we got both of our kids different gifts as one was a 13 year old girl and one is a 10 year old boy. \nmy mil (mother in law) decided to tell my daughter that she didn't get as many gifts as my brother and that we spent less on her. \nbasically trying to get our daughter to believe that we loved her less. \nwe then had to deal with a crying 13 year old on Christmas. \n\nshe has also brought super expensive gifts for people specifically to upstage everyone, she will even make a point of mentioning how much it is in front of people. \n\nshe called up to ask what we will be doing for Christmas as it's our turn, I mentioned that me and my wife want to have a potluck at our place. \nshe then proceeded to explain to me how we shouldn't let some family members cook certain food because of some instances where they fucked up and ruined the dish (this is all completely false information that she is mentioning to try and start some more family drama)\n\nI then decided to put my foot down and told my wife that I do not want her at our house starting drama on Christmas and that her phone call was the last straw. \n\nwife is completely against it and thinks I'm being incredibly cruel to her mum, and doesn't want to exclude her.\n\nEDI.\n\nI have tried to talk to her and she doesn't care.",
        "edited": "1574333682.0",
        "id": "dzhl0z",
        "is_asshole": 1,
        "num_comments": 1919.0,
        "score": 17363,
        "timestamp": 1574333371.0,
        "title": "AITA for putting my foot down and not allowing my mother in law to come to Christmas.",
        "verdict": "everyone sucks"
    },
    {
        "body": "Amy (19) and I have never gotten along well but what she did recently took the cake.\n\nI have followed a strict vegan diet for 12 years now, it's something very important to me & Amy is not unaware of this. Her father and her have lived with me in my house now for 2 years and she has never had a right attitude. Always rude and snide, ordering her father around and trying to do the same to me, she even smokes weed in the room I let her sleep in despite me asking numerous times to do that outside of the house. Brings nonveg food over and hides it in her room (a strict rule I had for them moving in was no meat in the house), laughs in my face if I try to make her stop.\n\nRecently Amy and a group of her friends got high & thought it would be funny to replace all the stocks cubes in the house with beef ones. Cooked a stew and after eating it she pulls out an empty beef stock pack & laughs in my face asking if I liked the taste of cows and she guesses I'm just a regular murder now and can chill out.\n\nWaited for her to leave, removed her stuff & texted her that she was evicted from my house & could go stay at her friends instead. My boyfriend is very upset and his ex gf is hitting up my phone with insults over disrupting Amy's life and schedule. I think after 2 years of disrespect I was too generous to begin with for not making her leave earlier.\n\nAITA for this?",
        "edited": "False",
        "id": "e7yr9e",
        "is_asshole": 1,
        "num_comments": 5304.0,
        "score": 17154,
        "timestamp": 1575836045.0,
        "title": "AITA for evicting my boyfriend's daughter for disrespecting my vegan lifestyle?",
        "verdict": "everyone sucks"
    },
    {
        "body": "A couple of years ago, I was in a life threatening accident. I was really lucky and I made it alive. My wife and I planned a vacation just before that. And she decided to take her best friend on the vacation while I was in the hospital. That was a week long trip to Greece. \n\nShe came back after a week and did not stop talking about how amazing the vacation was. Apparently she did that to help me vicariously enjoy the vacation. I was really pissed. My sister and my family supported me. But my wife did not. She later told me that she was too  stressed and depressed to be around me and watch me suffer. \n\nNow, my wife is down with flu. And I've been helping her. But I think I should help her vicariously enjoy Europe because it's one of her favorite destinations. I just want her to know how I felt. Of course, I won't go, but I plan on acting like I did. When I told my sister this, she told me that I should not get back at her and forgive her and lead by example. I don't think so. I think I'm feeling the stress now. WIBTA here?\n\nEdit: So this blew up and I'm getting many responses. I only stayed for my daughter because she was a teen. She moved out now. My wife will move out after I divorce her. Just wanted her to get a feel of why I divorced her.",
        "edited": "1556333633.0",
        "id": "bhp4hy",
        "is_asshole": 1,
        "num_comments": 1867.0,
        "score": 17083,
        "timestamp": 1556300301.0,
        "title": "WIBTA if I tell my sick wife that I have decided to take a vacation because she did the same to me when I had an accident?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I have an aunt who married a VERY rich man. They've been together for over 20 years and have 3 teenaged children together. She looks down on everyone else in the family because no one else is as wealthy or \"high class\" as her. Every time I see her (which thankfully is not often) she makes snide remarks about my income, education level, weight, relationship status, apparel, tattoos... basically anything she has a problem with.\n\nI have a child with my ex from whom I recently split. We're on good terms though, and he doesn't have family where we live, so he's been coming to all my family's holiday events. At the latest dinner, my aunt was there and made a comment asking why he was there and saying \"I thought you broke up.\" Well 10 years ago, her husband left her for a younger woman and moved out for about a year. I am growing sick of her running commentary and judgement of my life so I replied \"Didn't your husband leave you for another woman? Why is he here?\"\n\nEveryone in my family is LIVID. Everyone thinks I owe her an apology. I've explained countless times that, while I probably could have used more tact, I'm sick of the judgement from her and sick of being looked down on. Everyone knows she's a judgemental witch, but everyone enables her behavior because she pays for trips and things for the family.",
        "edited": "False",
        "id": "egipt0",
        "is_asshole": 1,
        "num_comments": 1014.0,
        "score": 15402,
        "timestamp": 1577489264.0,
        "title": "AITA for bringing up my aunt's husband's infidelity in response to her inappropriate questioning about my relationship?",
        "verdict": "everyone sucks"
    },
    {
        "body": "The son of one of my husband's family friends showed up to my wedding in his marines formal wear, complete with all his medals. Now, I have nothing against anyone in the military but this was a black tie optional wedding and frankly it felt very out of place and it seemed like he was just trying to show off. My wedding had over 300 guests and nobody else felt the need to wear something to make them stand out.\n\nUp until the point that I asked him to leave, he of course was acting very well mannered and like a complete gentleman, as one might expect from a member of the armed forces, and there were even a few excited teenage girls at my wedding who wanted to take a picture with him, to which he graciously agreed. Many people were thanking him for his service, and frankly it just felt like the only reason he wore that was to be in the spotlight and make it about him, which I don't think you are supposed to do at someone else's wedding. If he wants to wear that to his own wedding then fine, but the whole point of having a dress code at a wedding is so that no one guest will stand out too much.  I felt that he should have known this, since the whole point of uniforms in the military is so that you don't stand out from everyone else!\n\nI felt kind of bad about asking him to leave, but it just didn't feel right for him to be there like that.\n\nAITA?",
        "edited": "False",
        "id": "b3v1yg",
        "is_asshole": 1,
        "num_comments": 2141.0,
        "score": 15163,
        "timestamp": 1553197538.0,
        "title": "AITA for asking my wedding guest to leave for wearing his military uniform at my wedding?",
        "verdict": "everyone sucks"
    },
    {
        "body": "A few nights ago I was hanging out with one of my friends, and we decided to order food through Door Dash. About 30 minutes later, I get a notification that the delivery guy is approaching with our order. Without a word she dashes out of the front room, I'm confused, but the doorbell rings, so I go answer it. \n\nOnce she hears the door close, she saunters back into the room, grabs the food from me and starts pulling out items. Still confused, I ask; \n\n\"What was that all about.\" \n\nShe then tells me that she doesn't like to be seen when delivery guys are at the door, because \"they always hit on her.\" She then shows me a group of saved messages from delivery drivers/service workers asking her out. Apparently it's a common occurrence for her. \n\nI was shocked, and we get into a conversation about how inappropriate it is for them to do that. At some point in the conversation she says; \n\n\"That's one of the drawbacks to being really pretty. I mean if I wasn't so obviously out of your league, then I'm sure you would hit on me all the time\" \n\nI laughed, because I thought she was joking. But she kept pushing this point, so I responded with; \n\n\"Honestly, you're not that attractive, a lot of guys are just desperate, and they probably think they have a chance with a girl who looks like you.\" \n\nShe tried to laugh it off as well, but the rest of the night was pretty awkward, and we haven't really spoken to each other since. \n\nTL;DR - My friend who is constantly being hit on told me I was out of her league. I told her she wasn't as attractive as she thought she was. We haven't spoken since.",
        "edited": "False",
        "id": "eo8ggg",
        "is_asshole": 1,
        "num_comments": 1583.0,
        "score": 15149,
        "timestamp": 1578941768.0,
        "title": "AITA for telling my friend that she isn't as attractive as she thinks?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I was born on a Res and lived there for most of my life until going to college in a nearby state. In my community, we have a number of talented women who are amazing at beading. They make some truly remarkable stuff. Caveat is that they will only sell or trade to other people from the community, and possibly another tribal group. It's just how they do it. \n\nI have 30 or so pairs of all kinds and wear them with pride. Almost every day I wear a brick stitch earring of some kind, it's just part of who I am, where I'm from, etc. Brings me a lot of joy.\n\nAnyway a woman at work has really fallen in love with them. She compliments them and examines them. No issue there. Lots of people do. One day recently though, she asked me where I got them and if the person has an \"Etsy\" shop or something where she can buy her own. This woman is white with not a drop of the heritage in her, by her own admission. \n\nNow... personally I have no issue with white people wearing the earrings! It's not about that. Wear whatever you want. But the women in my community do not sell them to outsiders (again, for the most part). It's just not done. \n\nI told her no, and she asked for the contact information so she could commission a pair. I told her no again, that the person who makes them is very particular about who she makes them for. She kept pressing me, telling me \"Well let her make that decision!\" and stuff like that. \n\nI got tired of this and told her, point blank, this person will not create or sell anything for you because you are white. She got extremely upset and threatened to make a statement to HR about me being racially discriminating.\n\nAITA? \n\nMy reasoning is that if she wants beaded earrings, she can learn to make them herself, she can buy them from anyone else (there are so many white women on etsy who make \"boho style\" earrings), etc. She is merely upset because this one person will not cater to her.",
        "edited": "False",
        "id": "dfgj02",
        "is_asshole": 1,
        "num_comments": 992.0,
        "score": 15073,
        "timestamp": 1570625198.0,
        "title": "AITA for not giving the source of my beaded earrings to a white woman?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I'm half Japanese and my family recently moved into my stepdad's house.  I speak English with my brothers but Japanese with my mom. At the dinner table, my stepdad will get angry if we speak Japanese because he feels left out.  He frequently stands up and declares that he is left out and leaves the room to watch TV.\n\nI have major problems with him as he frequently trash talks my dad and screams at us.\n\nI live in Australia and my mother is the only connection I have with my Japanese heritage and being able to speak Japanese is really important to me.\n\nI don't feel obligated to speak English around him just because he wants to hear what I'm talking to my mom about.\n\nEdit:  To clarify Japanese is the only language I have ever spoke with my mom and it feels incredibly weird speaking English with her. I speak Japanese with her even around other people e.g my dad or friends and family.\n\nEdit: I know it's been about 5 months and no one probably cares but I kinda want to thanks people for helping me out in a hard time. We've moved out of his house about 4 weeks ago and for the first time in a year, I've felt relaxed and at peace.",
        "edited": "1577507741.0",
        "id": "cie0ce",
        "is_asshole": 1,
        "num_comments": 2124.0,
        "score": 15009,
        "timestamp": 1564207875.0,
        "title": "AITA for refusing to speak english to around my stepdad",
        "verdict": "everyone sucks"
    },
    {
        "body": "I (17M) was horrendously bullied by this guy, we can call Jake (17M). Jake was quite popular and sociable but for some reason kept targeting me, calling me names, slurs, etc. I hated him so much, I'd hate going to school and him being in class. I dreaded it.\n\nWell we found out that Jake unexpectedly passed away in his sleep. When I saw this on Facebook, I saw lots of RIP posts from classmates, but my first reaction was relief. I felt a weight lift off my shoulders.\n\nWhen I came to class, people were crying and my teacher (50F) said we need to take a moment silence for him. After the silence was done, I just said out loud ''I don't care that Jake died. He was a bully''. People looked at me instantly and gave me death stares, I could hear some people muttering swear words.\n\nBut then some people came up to me and thanked me, they said they hated Jake too. Honestly I'm fucking glad he's dead. I feel so much better about my life now. Some classmates called me AH, his girlfriend (ex now lol) came up to me and called me every name under the sun, AH was one of them. I just said to her ''You need to calm down and relax'' and walked away. \n\nI honestly feel good and so do some other classmates. AITA?\n\n**Edit - The reason I say 'now ex lol' is because she chose to be in a relationship with an awful, awful person. That's bad character judgement on her part, and also complacency.**\n\n**Edit 2 - Way too many comments to read....Gonna sign off for a bit and read them later. I have had many helpful PM's. Thank you to those who reached out.**",
        "edited": "1563569349.0",
        "id": "cf81o7",
        "is_asshole": 1,
        "num_comments": 2997.0,
        "score": 14955,
        "timestamp": 1563545562.0,
        "title": "AITA for saying in class that I don't care that my bully classmate is dead?",
        "verdict": "everyone sucks"
    },
    {
        "body": "So I have finals this week and, tensions are running high everywhere. I was studying in the library with a group of friends for a political science class, and my friend complained that this class is incredibly hard and he's having a tough time. This girl who was studying with us heard him and was like \"you aren't a STEM major so why are you even complaining? you haven't had a hard class till you've taken calc 3.\" Now I'm not a STEM major either, and I just felt tired of always being told my major isn't hard or anything, especially since she has mentioned it several times before, so I told her to shut the fuck up for once. But this led to her crying and her friends started telling me I was being mean to her.\n\nWas I the asshole here?",
        "edited": "False",
        "id": "bmo5hl",
        "is_asshole": 1,
        "num_comments": 2103.0,
        "score": 14009,
        "timestamp": 1557430526.0,
        "title": "AITA for telling a STEM major to shut the fuck up?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Not my story, but my brother's, and I'm really unsure where I stand on it.\n\nMy little brother, is doing an internship with a large corporation. He organized an internal food drive, in which the floor that donates the most wins free pizza for lunch on a Friday. \n\nAt the conclusion of the food drive, my brother called the pizza place on a Monday and asked about the logistics of ordering 35 pizzas, on a Friday, during lunch hour. They said it wouldn't be a problem, and to place the order Wednesday morning. \n\nHe calls back Wednesday, and speaks with the same manager. The manager tells him they can no longer do the order, as it's too big of an order to do during their Friday lunch rush. He recommends my brother try the middle of the following week, and they agree on the following Tuesday.\n\nMonday rolls around and my brother places the order, and uses the corporate credit card to pay over the phone. The manager then tells him they cannot have 35 pizzas ready at 12:30, but can have 18 ready at noon, and another 17 ready at 12:45. My brother tells him that would work. When asked what to put on the line for a tip amount, my brother responds $0.\n\nNoon on Tuesday, my brother shows up at the pizza place, picks up the first 18 pizzas, and delivers them to the winning office floor lunch room. Then, he returns to the store to pick up the remaining 17 pizzas. \n\nWhile waiting for the second round of pizzas at the store, the following exchange occurs:\n\nManager: \"Are you going to leave a tip?\"\n\nBrother: \"No.\"\n\nManager: \"Usually with large orders like this you are required to leave a tip\"\n\nBrother: \"You aren't delivering or serving these pizzas. When we talked on the phone yesterday you did not mention a mandatory tip\".\n\nManager: \"It's corporate policy that orders this large require a 15% gratuity\". \n\nBrother: \"That isn't what we agreed to on the phone yesterday. I'm not leaving a tip\".\n\nManager: \"Well then you aren't getting the rest of your pizzas\". \n\nAt this point, my brother and the manager begin arguing, escalating to the point of my brother's coworker pulling him to the side and recommending a small tip (5%). My brother relents. He tells the manager he will leave a tip, but he wants to choose the amount. He hands the manager his card, who runs it and hands him back a new receipt for the order, with a 15% gratuity assessed ($125 instead of $40).\n\nMy brother then gets into a yelling match with the manager, and is escorted out of the restaurant by his coworker. \n\nIs my brother the asshole?",
        "edited": "False",
        "id": "dltcu8",
        "is_asshole": 1,
        "num_comments": 5370.0,
        "score": 13404,
        "timestamp": 1571800595.0,
        "title": "AITA for not tipping the pizza place on an order for 35 pizzas?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I have 2 kids, different dads. I have a savings account for both. The account of my oldest, Lucy, has had £10 per week added to it by both myself and her father, and has gone up by about a grand a year and is over £13,000. The second account is for my son, Luke, who is 6. I have regularly added to this account since I found out I was pregnant, and have about 3.5k in the account.\n\nHis father, my fiance, had a separate account for Luke and has told me he was doing the £10 a week since we started the accounts. I recently found out the account he has for Luke only has a couple hundred in it. My fiance earns less than me but more than my Ex. If my Ex can afford £10 a week routinely, when he has nearly identical spending habits to me and my fiance but lives alone and therefore pays for rent/bills in full, and my fiance earns more than my Ex, there is no reason my fiance should not have been able to make the £10 payments each week (I earn the most of all 3 of us, followed by my fiance, followed by Ex). My fiance said he \"forgot\" and asked me to redistribute the contents of Lucy's fund to make up for the money missing from Luke's. I said fuck no.\n\nLuke's account is around 3k less than it should be. We have a wedding fund that contains a little over 2k of mine and my fiance's combined money. We don't want a huge wedding but we do want a really nice honeymoon where we can just go away for a week and not worry about money while we're there or returning.\n\nMy fiance says that he doesn't have the money to replace the 3k Luke is missing all at once. I have said that I want to take the wedding fund as it currently stands and deposit the lot into the savings account I control that is meant for Luke. I would not be doing this if my fiance had not 1) lied for around 7 years about saving for our son, 2) claimed he did not have the money to replace it, 3) suggested I take money from my daughter, saved up with help from my Ex, to fix my fiance's mistake. I also said that I want him to set up a direct deposit of £10 to the account that only I control each week. I will not budge on any of this as we agreed years ago now that this was a good idea and that it was important to invest in our son's future, and he has lied to me for 7 years now about making that investment.\n\nAITA?\n\n&#x200B;\n\nFor people asking why this is so urgent to me: It's not the end of the world if the full amount isn't in Luke's account any time soon, as the plan was always to give each kid the total in the account when they were 18/moving out, but my fiance says he can't afford to repay the money in bulk or multiple installments and if he keeps on not paying, then when Lucy is 18 she'll have 19-20 grand, and when Luke is 18 he'll get closer to 10k from just me. While I don't doubt he'd be grateful for whatever he gets, he'd get half of what Lucy will if my fiance doesn't make up the difference.\n\n&#x200B;\n\nUpdate:\n\nI asked him again why he didn't have the money. He said he just didn't. I asked him to bring up his bank statement, or payslip, or anything that shows how much money he has (bearing in mind he was last paid on the 28th and today is the 30th). He refused. I told him that if we were combining finances in any way I should be able to see where his money is going. He responded that I wasn't showing him my financial information, so I pulled up my banking app so he could see my own balance and transaction history. He then showed me his last statement, which his bank emailed him today. We had a fight and he's staying in a hotel tonight, which it turns out he can more than afford. He has nearly 60k in his personal current account and savings accounts, presumably meant solely for himself.\n\nI cannot see us getting married after this. Not ever. It's not just the trust issue, but also that he, knowing he had nearly 60k in savings, decided that it was okay to try and guilt trip me into taking money meant for my daughter to fix it for him.",
        "edited": "1569873565.0",
        "id": "dbclh8",
        "is_asshole": 1,
        "num_comments": 952.0,
        "score": 13230,
        "timestamp": 1569854729.0,
        "title": "AITA for repurposing the wedding fund and refusing to compromise?",
        "verdict": "everyone sucks"
    },
    {
        "body": "My wife and I bought a house a couple of years ago. It's decent-sized yard and we even have a couple of chickens (this is Los Angeles). We have three boys - 6yo twins and a 9yo. They are kids. They are loud. Not screaming loud. They love playing in the yard and playing at the park literally across the street. My next door neighbors complain all the time about the noise level in the yard and at the park. They are this boomer retired couple with kids my age (mid-30's). Actually most of the neighborhood is like that because so few people especially with kids can afford a house in that area so it's a bunch of retired boomer snitches with Ring and security cameras at their front porch (no, NOTHING ever happens here) and they designated my neighbor as the block cop. The funny thing is that the kids are hardly home. They're in school most of the day and have sporting practices/games on the weekend.\n\nI tried to reason with them, but they feel that because they lived in their house for 40 years that we have to follow their rules as their next door neighbors and keep quiet. I have no sympathy for them. These are the people who bought their sizable home for $40,000 in the 80s and if adjusted for inflation, it's like buying the same house for $125K. But it's a house in LA so it's more like a million. My wife and I make good money, but our mortgage is astronomical. We are working much harder than our neighbors ever did.\n\nYesterday, our neighbor came to our door and asked complained, again, about our kids being loud. Not too loud. Just loud. At the park. Per the other neighbors who lived across the street from said park. Then he lectured me about my \"logic\" of moving to a quiet area with loud kids. If that wasn't bad enough, he suggested that my wife and I look at homes by the ocean because \"you don't have neighbors to the west of you.\" Houses by the ocean are like millions of dollars lol. I asked him how I would do that and he said that wasn't his problem. So I told him that he should move out of their house and move to the ocean where he won't have neighbors. I caught some flack for being rude to an older person, but I don't think I was.",
        "edited": "1579030448.0",
        "id": "eoq0fz",
        "is_asshole": 1,
        "num_comments": 3079.0,
        "score": 13179,
        "timestamp": 1579029966.0,
        "title": "AITA for telling a boomer couple to move out of their house?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I’ve asked my friends, and they are genuinely divided, so I thought to ask Reddit. I (31F) am childfree, and I work with Chloe (40?F). We’ve become good friends over the past year or so, and we hang out most weekends. We are both into knitting and wine, and we are both really chill.\n\nIdeal friendship, right? Well, she has a 15 y/o son (Braden), who is really unclean. He stinks like rotting meat and BO, and he also has this awful metallic odor that makes me gag. I know it’s not a neglect issue, because Chloe’s younger daughter (11F) has never stunk. Lately, I haven’t even wanted to go over to Chloe’s, and I don’t want to invite her to my house in case she brings her son. \n\nLady week was the last straw. We decided to go to the craft store together, and Braden wanted to come. I drove them there, and my upholstery stank for a good three days after. The next day at work, Chloe asked if I wanted to come over for dinner, and I had to tell her no. She really pushed me for a reason, and I told her her son smells like ass and I basically can’t be around him until he works on his cleanliness. She sent me a text later (pasted here): “Hi yall-need-weed, the things you said about Braden were really uncalled for and I don’t want you to talk about my kids in a bad way. I am a good mom. Don’t talk to me until you apologize.”\n\nAITA? Should I apologize?\n\nEdit for more info: yes, I did unfortunately phrase it that way. We both cuss a lot, but I definitely could’ve been gentler. \n\nNo, I won’t be calling the authorities on Chloe. Their house is clean, he has access to washer/ dryer/ shower, this kid just inexplicably reeks.\n\nYes, Braden comes with his mom to my house a lot. He doesn’t really have friends or out of school activities, and he likes some of the gaming systems I have.\n\nEdit 2: no, I’m not one of those childfree people who hates kids. I’m mainly childfree because I like the freedom, and I’ve never really had a maternal instinct. \n\nAlso, “Lady week” was a typo - I meant “last week”. Fat fingers ftw!",
        "edited": "1572054726.0",
        "id": "dn2p9i",
        "is_asshole": 1,
        "num_comments": 1387.0,
        "score": 13167,
        "timestamp": 1572032751.0,
        "title": "AITA for telling my friend the real reason I don’t like her kid is that he stinks?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I am very self conscious about my weight. I am very skinny because of my fast metabolism and im very bony. It tears me apart when i hear people calling me a twig. I was eating lunch with some of my friends and the biggest one in the group said \"Eat\" when i was throwing out half of my sandwich. I said \"Im not hungry\" and she said \"You have to eat, your a twig\" they already know i have a fast metabolism because i told them before about it when they asked why i was so bony. I snapped back and said \"I'd rather be a twig then a whole tree\" and suddenly im the asshole. Everyone in my group of friends hate me and i want to know if its my fault.\n\nEdit: wow ok i didnt expect this to blow up. Now i can say my alt account has more karma then my main. I saw people concerned about my weight. My highschool has lunch very early and i had a big breakfest thats why i wasn't that hungry. I just believed i was skinny because of a fast metabolism because thats what my mom told me but now im starting to believe it might be something else. I appreciate all the tips and concern",
        "edited": "1570148200.0",
        "id": "dcpyuj",
        "is_asshole": 1,
        "num_comments": 2610.0,
        "score": 12787,
        "timestamp": 1570104516.0,
        "title": "AITA for calling my fat friend fat after she called me a twig?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Last Thanksgiving, my husband and I went to his parents' house. We are vegan, and they told us that they'll have some vegan food for us. So far, so good.\n\nWe went to her house for dinner, and she had a number of vegetable dishes on the table to share. MIL told us that they were vegan, so that's what we had. However, at the end of the meal, MIL decided to reveal to us that those dishes were cooked in butter. \"See? A little bit of butter isn't that bad, is it? Maybe this will teach you to stop being so uptight about that whole vegan thing.\" she said. Of course we were not okay with her lying to us whatsoever, and she decided to tell us that we were being \"entitled\".\n\nThis year, we hosted a vegan Thanksgiving dinner at our house. My husband asked me what I thought about inviting MIL over, and whether it was okay with me given what happened last year. I thought about it and I had an idea. My MIL absolutely hates cucumbers and melons, and will not eat them under any circumstances. She will also refuse to eat zucchini, because they apparently look too similar to a cucumber. She also refuses to eat cilantro. So I suggested to my husband that we include these ingredients in every single thing we cook for the dinner if we are to invite her over. He thought about it, and agreed that she deserves it after the stunt she pulled last year.\n\nSo for Thanksgiving, we made a number of dishes: a tomato and zucchini casserole; a salad that included both cucumber, melon, and cilantro; some green beans and mashed potatoes, of course with tons of cilantro. We even added some cucumber and melon to our water jug as well. When she came over and saw the meal, she refused to eat any of it.\n\nAITA?",
        "edited": "False",
        "id": "e4vpju",
        "is_asshole": 1,
        "num_comments": 1774.0,
        "score": 12573,
        "timestamp": 1575272431.0,
        "title": "AITA for ruining my MIL's Thanksgiving?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Long story short, my mum was abusive growing up which led to me cutting contact the second I left home. The main form of abuse was saying I'd never amount to anything, was retarded, work at mcdonalds despite loads of evidence on the contrary. Even after I received an offer from Oxford med she kept telling me not to bother cause I'd drop out which was so wrong looking back on it.\n\n&#x200B;\n\nFast forward 7 years, I've recently become a qualified doctor and my mum wants to \"try having a better relationship with me\". We haven't met in person yet but have spoke over the phone where she seemed nicer than she used to be, but I insisted she called me \"dr \\[my name\\]\" or i wasn't speaking to her. At first she thought I was joking so I hung up and rejected her calls for a few weeks, and from then on she has used it.\n\nMy brother (mum was far nicer to him) has complained to me that I'm being a massive bell-end. To be honest I'm barely willing to speak to her, and not bothering at all unless she shows proper respect. AITA?\n\n&#x200B;\n\nI'm sure it's going to get asked and no, I don't insist on being called dr outside of work, ever. At work I don't care either and although many people do call me dr, I don't expect it or get offended by its absence.\n\nWell this blew up. Sorry won’t be able to reply to everyone and thanks for the feedback.\n\n&#x200B;\n\n/biz/ 19.10.2019",
        "edited": "1571513562.0",
        "id": "c08awt",
        "is_asshole": 1,
        "num_comments": 2910.0,
        "score": 12460,
        "timestamp": 1560444985.0,
        "title": "AITA for refusing to talk to my mother unless she uses my title?",
        "verdict": "everyone sucks"
    },
    {
        "body": "So last year my brother moved in with me and my roommate. When he moved in his girlfriend started spending a lot of time at our place. This isn't a problem as my roommates girl friend comes over too. Here's the thing though. My brothers gf pretty much eats all our food. No matter who's it it she will eat it. Me and roommate have told her multiple times to stop eating the food we buy and only eat the food brother buys but she ignores us and eats our food anyway.\n\n&#x200B;\n\nWe have confronted her and my brother multiple times and told them she needs to stop but she just says \"tee hee, sorry but it's so good\" and he refuses to say anything about it. We both have tried to talk him into going to her house insted of bringing her over but he doesn't want too. It's gotten to the point where both of us are considering getting a second fridge to put a lock on. \n\n&#x200B;\n\nWell, we're both sick of it. Brothers gf is a heavy girl and weight is a very touchy issue with her. Well, recently both of us have taken to calling her miss piggy when she eats our food. If we ever see her eating our food or after she has we confront her and call her it. She hates it and has freaks out each time she hears us refer to her as it. Honestly though, she still eats our food and so we kept doing it. \n\n&#x200B;\n\nWell, today when I got home from work his gf was there eating leftovers I had cooked last night. I told her \"Wow, I love to come home to see miss piggy eating my leftovers that I was looking forward too.\" before I started oinking at her. She broke down crying and ran out.  She's been calling my brother furiously since and is refusing to come here anymore because i'm an \"asshole\".\n\n&#x200B;\n\nAm i? Like, we asked her so much to stop and she didn't that i honestly just lost it. We all buy our own food and we have a rule never to touch each others stuff. She knows this and she still did it so I think she deserved it.",
        "edited": "False",
        "id": "apc2b5",
        "is_asshole": 1,
        "num_comments": 2599.0,
        "score": 12200,
        "timestamp": 1549856066.0,
        "title": "AITA for calling my brothers girlfriend \"miss piggy\" for eating our food after we told her not too?",
        "verdict": "everyone sucks"
    },
    {
        "body": "**EDIT 2: Since the post has been locked, it’s now escalated to several (yes, several) threats/people wishing me death via PM and the chat function. I am screenshooting and reporting to admins. Hopefully something is done about this behavior. I get that those sending these messages are likely teens themselves, but that doesn’t make it okay. Despite my daughter’s problems and poor judgment, I am grateful that I didn’t raise someone that hateful and disturbed. For those who care, she is going to live with her father and moving before the end of the month. He’s agreed to it, and I’m hoping it gives her a fresh start.**\n\nI won’t go into the sordid details.  She’s an older teen and has had lots of issues since she started high school, mostly stemming from rebellion, I think. Her father always played the “Disney dad” role (because she only stayed with him every other weekend + summers/holidays). So discipline was solely on me. She’s 18.5 but hasn’t graduated high school yet and has no real plans with respect to work or college. (She would have already graduated but that’s a whole other story). \n\nWhat I mentioned in the title was my final straw. I trusted her to leave her alone but ended up coming home early when my plans got ruined last minute. (Was hanging out with a group of friends, but the host’s kid got sick, so we all ended up leaving early). So I walk in on my daughter in my bed with some guy I don’t even know. \n\nI told her I have had it and she’s going to live with her dad. That means she’s either going to have a 45 min commute to school or transfer. I don’t really care which at this point because I am at my breaking point. If her dad won’t take her in full time, she can go live with friends, I guess, but I’m not planning on giving financial support. (My ex and I had a CS agreement that ended at 18, no caveats). \n\nAm I wrong for reaching my limit with this extreme boundary cross? My sister thinks I’m being harsh. I said, in that case, she can take her! But at this point, I feel like I’m done.\n\n**Edit: I came here for judgment, but some of the comments implying that I might have “abused” my daughter or that I somehow “deserved” for my space to be violated this way because I’m a “shit mom” are really shocking. I won’t be participating in this thread anymore. I’m fine being told I’m wrong and listening to different perspectives.  But being personally degraded just isn’t for me.  I’m out.**",
        "edited": "1579545842.0",
        "id": "er4rxt",
        "is_asshole": 1,
        "num_comments": 1248.0,
        "score": 11974,
        "timestamp": 1579478722.0,
        "title": "AITA for kicking my daughter out and sending her to live with her dad after she had sex on my bed?",
        "verdict": "everyone sucks"
    },
    {
        "body": "I’ve had a spider in my office space for a few months now. She’s a cool, small, little thing who chills near my desk and occasionally I bring her lil treats to eat. Sometimes she disappears and sometimes she comes back. I’ve named her. I like her. \n\nMy colleague Michelle is aware of the spider, and is always complaining that it’s a pest and needs to be killed. Recently she saw the web, not even the actual spider, and started an official whiteboard scoresheet if anyone is in favor of the spider being removed. Apparently she’s super scared and terrified and being even a little bit close to my office is enough to make her jittery. \n\nLuckily most people voted that the spider stays, but a few of her friends wrote some strongly worded notes that the spider is a sign of poor housekeeping etc. I must admit I was a little peeved at this, especially because we are a pet friendly workspace and Michelle’s own dog comes in to work sometimes and we have people who are genuinely frightened of dogs and Michelle doesn’t bother keeping her on a leash or anything. \n\nIt came to a head when we had a meeting and Michelle bought up that she refused to go into my office because of the spider and she was scared of it. My boss was a little irritated and told me to remove it or kill it, I straight up refused and told him he wouldn’t ask Michelle to remove her dog and the spider is a LOT less threatening than a poorly behaved dog. He ultimately agreed and since then all she’s done is go on about how I don’t care about her feelings and that I must enjoy watching her suffer.",
        "edited": "False",
        "id": "d8dpdq",
        "is_asshole": 1,
        "num_comments": 2058.0,
        "score": 11960,
        "timestamp": 1569276317.0,
        "title": "AITA for refusing to kill the office spider despite one of my colleagues being scared of it?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Yesterday, I (24M) attended a party. There were many of my old friends there. One of the girls, 25?, was someone who I was close to growing up but lost contact with after.\n\nThe two of us reconnected and talked. She was drinking a bit, although I didn’t. Later on, she was doing things like putting her arm around me, holding my hand, etc, which I stopped because I have a girlfriend and I told her so.\n\nThen, she asked, “If you weren’t taken, I bet we’d be together right now.” It was a bold thing for her to say and I guess it must have been the alcohol talking. I just responded, “Nah don’t think so.” She was offended and asked me why. I just said “you’re not my type”. She asked me WHY she wasn’t my type, and I was tired of her bugging me, so I said, “You’re just not what I’m attracted to.”\n\nShe got mad at me. She said, “Oh I get it, you’re attracted to coked up skeletons like your girlfriend.” Referring to the fact that my girlfriend is tall and skinny. I got defensive and said, “Well Im not attracted to fat basic bitches like you.” Granted, she’s not even fat, just thick/chunky. But she does overdo the spray tan and she looks like every basic girl ever. I guess a lot of guys are after that look but not me.\n\nShe called me a cunt and later her friends found her in the bathroom crying. People are villifying me but she practically pushed me to it, especially insulting my girlfriend like that. I stand by what I said though, and she should know that her words have consequences. AITA?",
        "edited": "False",
        "id": "bo3ajf",
        "is_asshole": 1,
        "num_comments": 2072.0,
        "score": 11001,
        "timestamp": 1557753123.0,
        "title": "AITA for telling a girl that I’m not attracted to her beacause of her appearance?",
        "verdict": "everyone sucks"
    },
    {
        "body": "On my birthday this year, I treated myself to 50 bucks in lottery tickets, and managed to hit one of the huge $50,000 payouts. After taxes, I had ~$34,000, so I’ve put $7,500 into my wife’s car, and put the rest into a high-interest bank account. I’m planning to switch jobs early 2020, but first, I plan to travel for the month of January and half of February across Asia and Europe. I’ve never had a proper vacation (unless you count weekend trips to Disney World for the kids) and have really wanted to take the chance to go out there and explore the world.\n\nWell yesterday my daughter Emily were talking about the job movement and the topic of the vacation came up. I told her about how I’m financing it with the lottery (she previously did not know about the winnings) and Emily went quiet before saying “instead of wasting 25 grand on a vacation, why not do something practical like maybe spend $5,000 on a vacation and help your daughter not graduate with mountain of debt”.\n\nI told her that I’d be happy to co-sign loans for her, but I was only willing to pay upwards of $10,000 of her education (the amount I promised both her and her brother when they were 13-15). She said even after paying that off, she’s looking to be at being $29,000 in debt by the time she finishes school. \n\nI told her that really sucks, but reminded her that I offered community college as an option years ago when she was applying to schools, but she insisted that she didn’t want to “miss out on the prestige” (she got into Dartmouth). I talked to her about how transferring was an option, but she ultimately picked that route.\n\nShe’s brought up how the 10k I gave Jason (my son) was enough to completely pay for college cost + some extra spending change, because he got a state scholarship that paid for 100% tuition. She argued how it’s not fair that I was essentially willing to pay all of his college but leave her with a mountain of debt.\n\nI told her that he’d be able to argue the same thing if she got more money than he did. Ultimately, the line I drew was that both children get equal amounts and I can choose how I want to spend my money, end of discussion.\n\nI thought it was over but it turns out that she went and talked to my wife Amy about it behind my back. Amy tried to “persuade” me to make it a 2-3 week vacation as opposed to the 1.5 months I had planned. I told her the same thing that I told our daughter, and then SHE then got mad and said that I’m being selfish and using all of the money that for myself (nevermind the amount I put into *her* car AND the fact that she used ALL of a $5,000 inheritance on cosmetic plastic surgery 4 years back). I told her this vacation was non-negotiable.\n\nNow I have two women in this household giving me passive aggressive looks and eyerolls. I feel like they’re both acting entitled to MY shit; am I really being unreasonable here?\n\nEDIT I'm not leaving my wife behind; she can go for 10 days. She can't take the full 1.5 months off, though.",
        "edited": "1563139729.0",
        "id": "cd7vyz",
        "is_asshole": 1,
        "num_comments": 3469.0,
        "score": 10959,
        "timestamp": 1563136510.0,
        "title": "AITA for using the money I won in a lottery to finance my own dream vacation across Europe/Asia besides on my kid’s student loan debt?",
        "verdict": "everyone sucks"
    },
    {
        "body": "Some context is definitely needed here. I'm 33(M), and my sister is 36. She has one child (14F). I have one son (13). It is also important to add that I am a single father - my wife passed when my son was 7. \n\nMy son is quite gifted (I do not say this lightly). He tops all of his classes and often wins mathematics competitions in our state. I do not tell my sister this on account of me not wanting to seem like I'm bragging or anything - my son's achievements are his and his alone - I just provide him with the love and affection he is entitled to.\n\nSo yesterday, my family had a gathering dinner. At previous gatherings, my sister likes to demonstrate how 'special' and praiseworthy her daughter was for quite ridiculous achievements - such as winning 'best dressed' at her school dance.\n\nThis gathering, she really made me mad. Not only did she tell everyone the usual so-called achievements of her daughter, but she also targeted my son in front of him. She said, with the entire family present, that I wish my son was as gifted as her daughter. Her daughter proceeded to join in and call my son, who is quite shy, a looser.\n\nI then told her that her daughter was not special at all and that her achievements were absolutely nothing and meant nothing to anyone except for her. She left the table crying.\n\nI was then called an asshole by those remaining on the table. AITA?",
        "edited": "False",
        "id": "elawpx",
        "is_asshole": 1,
        "num_comments": 1438.0,
        "score": 10068,
        "timestamp": 1578400038.0,
        "title": "AITA For telling my sister that her daughter was not special, but instead was ordinary?",
        "verdict": "everyone sucks"
    }
]