[
    {
        "body": "Pretty much the title. My son won a stuffed tiger at the fair last night and said he had named him \"Tig\". He asked me what its last name should be. I couldn't help myself and just instantly replied \"Bitties\". Then I turned to my wife to share a smirk, but she was pissed and quickly suggested a few different last names, but my son insisted that he liked \"Bitties\", so now his Tiger is Tig Bitties. My wife thinks it was completely inappropriate, I think it was a silly joke that went over his head and will have no negative ramifications.",
        "edited": "False",
        "id": "cnml52",
        "is_asshole": 0,
        "num_comments": 4292.0,
        "score": 52388,
        "timestamp": 1565274741.0,
        "title": "AITA for suggesting my 7yo name his new stuffed tiger \"Tig Bitties\"?",
        "verdict": "no assholes here"
    },
    {
        "body": "I'm going to try to keep this short and simple. I always tell my daughter and my stepdaughter if they're ever in a situation that they need to get out of, just call me and I'll drop whatever I'm doing and I will pick them up no questions asked no judgments made. I let them know that I used to be a teenager once before, I told them everyone is entitled to make bad decisions every now and then. We're only human and it's a part of life.\n\nLast weekend I got a call from my stepdaughter (17), she told me she snuck out of the house and went to a party and had too much to drink. She was scared of passing out at the party because there was people there she didn't know.\n\nI got there just in time, she was so drunk she couldn't even walk. I had to pick her up and carry her to the car. I told her I was disappointed that she snuck out, but I also told her I was glad she made the right choice, the safe choice to have me pick her up.\n\nI haven't told my wife about it, because I don't want to violate the deal I made with her. I want her to know that she can trust me. I just hope I'm making the right choice.",
        "edited": "1559657812.0",
        "id": "bwovur",
        "is_asshole": 0,
        "num_comments": 2527.0,
        "score": 36547,
        "timestamp": 1559655998.0,
        "title": "AITA for not telling my wife that I picked her daughter up drunk from a house party?",
        "verdict": "no assholes here"
    },
    {
        "body": "While sitting next to my girlfriend on a plane I was bored as fuck and looking at the maps are that are found in the back of the airline magazines. A conversation led to her revealing that she did not know where Florida was on the map. Keep in mind she had graduated a private high school and is currently going into her senior year of college. Conversation progressed further into me finding out she could not point out AUSTRALIA either. I was visibly astonished at this revelation and essentially said \"...are you kidding.\" She immediately got defensive calling me an asshole for making her feel stupid. I do feel bad for making her feel stupid, although I feel as if my reaction to her not being educated on such elementary shit was warranted and may even be a wake up call for her to learn some basic geography... AITA?",
        "edited": "False",
        "id": "clqcio",
        "is_asshole": 0,
        "num_comments": 4950.0,
        "score": 36446,
        "timestamp": 1564880444.0,
        "title": "AITA for being visibly shocked/dumbfounded that my GF (21, American) could not point out Florida on a map?",
        "verdict": "no assholes here"
    },
    {
        "body": "I got the idea a few weeks ago to prank my friends my pretending to be an \"Appletarian\", meaning somebody who only eats food products that are derived from apples and would only drink apple juice or apple cider. \n\nI told them them all that I had read on the internet that eating only apples was the healthiest thing for you. When I first told them they thought I was joking, but they underestimated how committed I would be to a joke. So, whenever in the presence of one of my friends (or friend-of-friends/coworkers/etc who knew them) I was very careful to only be seen eating apples or drinking apple juice/cider. \n\nApples whole, apples diced, apple sauce, the inside of an apple pie, baked apples, candy apples with the chocolate shaved off, etc. \n\nFinally after about a week they bought that I had become an Appletarian. They started giving me information about how unhealthy it was to only eat apples, and growing increasingly exasperated by it. Some of them even got angry.\n\nBut I wanted to stick with the joke. Finally, after the end of 3 weeks, I walked into what I was told was a movie night but was actually an intervention for me. \n\nThey were all super concerned about my well being and had all sorts of information or whatever. Finally I started laughing hysterically. They were confused as hell so I told them I had been faking it the whole time and had been eating real meals outside their knowledge. I even took out some beef jerky from my pant pocket to prove it and munched it. \n\nI thought they'd appreciate the joke but they were actually really annoyed. My girlfriend even broke up with me over this because a few days ago I had ruined our date night when I told the waiter I only wanted apples because I was an Appletarian and had \"embarrassed her for a dumb joke\". \n\nIn my opinion the joke was solid and they should appreciate my commitment to the prank. \n\nBut, did I go too far?\n\n",
        "edited": "False",
        "id": "b22cxm",
        "is_asshole": 0,
        "num_comments": 2911.0,
        "score": 34442,
        "timestamp": 1552803912.0,
        "title": "AITA for pretending to be an \"Appletarian\" (eating only apple derived foods/drinks) for 3 weeks as a prank, causing my friends to have an intervention for me?",
        "verdict": "no assholes here"
    },
    {
        "body": "I got married on Saturday, and it was absolutely amazing except for one thing: my parents showed up late. They knew the ceremony time, and my husband and I made it very clear to everyone, both in the invites and in person, that we were going to start exactly at that time. The venue cost us a lot of money (we paid for the entire wedding ourselves) and we were only able to use it for a limited amount of time, so we wanted to make every minute count. \n\nSo the wedding day came, and half an hour before we were scheduled to start, my parents still hadn't showed up. My husband and I both called them multiple times but nobody answered. We waited and waited, and still heard nothing. Finally, the start time arrived and my parents still weren't there. I was really pissed off at this point. The wedding coordinator asked if I wanted to go ahead and start the wedding, and I said yes. All of our other guests were already there, and we wanted to be considerate of their time. \n\nMy parents showed up 15 minutes later and missed the entire ceremony. It turns out they did leave early but got rear-ended at a traffic light and had to deal with insurance, police, etc. They only have a landline, no cellphones, so they couldn't get in touch with me. Obviously there's no way I could have known this.\n\nI'm still frustrated with them for not making more of an effort to get to the venue early, and they're furious at me for not delaying the wedding 15 minutes so they could be there. AITA?",
        "edited": "False",
        "id": "dz2eyy",
        "is_asshole": 0,
        "num_comments": 4657.0,
        "score": 31473,
        "timestamp": 1574258414.0,
        "title": "AITA for starting my wedding on time and not waiting for my parents?",
        "verdict": "no assholes here"
    },
    {
        "body": "My kids, 6&7, each had an iPad mini.  Over the summer they were having a rough time, constantly fighting with each other and just being brats in general. I lost it one day and took their iPads away, saying they were being sold, never to be seen again.  Tears were shed. The iPads were cleaned up, put back into their original boxes, accessories packed away, ready for sale...but I couldn’t do it. They went into a box in the closet. \nSummer passed, fall passed. The kids have been great and I feel they’ve earned them back. \n\nChristmas is coming. Money is super tight this year. AITA for wanting to clear the iPads with a factory reset, buy a couple new cases as a distraction and regift them their old iPads as new ones?",
        "edited": "False",
        "id": "e1go2v",
        "is_asshole": 0,
        "num_comments": 3661.0,
        "score": 31430,
        "timestamp": 1574691629.0,
        "title": "AITA for regifting my kids their own tablets for Christmas?",
        "verdict": "no assholes here"
    },
    {
        "body": "This is a hot topic in my family at the moment, \n\nI live on an obscure little island near the UK. we have a local quiz show that’s aired on the telly that I appeared on a few years ago. \n\nThe premise of the show is that you can win prizes for doing challenges. Some of the challenges were physical, some psychological, and some requiring problem solving skills. I sailed through a lot of the physical part because I wasn’t a fat bastard back then, and the problem solving skills required a lot of maths which is my career, so I was ok there.\n\nAs for the psychological part, you had to enter a clear box ‘room’ filled with something you’re terrified of, and search through to find clues to the next part. \n\nI thought of a believable lie before I entered the show (we had to list 5 things we were afraid of) and I put down all the things I’m *not* scared of. I listed spiders, cockroaches, snakes, scorpions, and wood lice. I literally couldn’t care less about any of these creatures. I grew up in rural landscape and I’ve had to pretty much deal with creepy crawlies my entire life so it’s not an issue. My actual fear is a bit more obscure and I really honestly knew I’d fail if I was put in a room with it. \n\nWhen I entered the room there were cockroaches *everywhere* I was in my boxers and barefoot (which was incredibly gross I can’t lie) and had to sift through and move the cockroaches to find clues for my next challenge.\n\nI did it in the time period ascribed to me and got through to the next part. The rest of the contestants failed.\n\nNow, I won a pretty average car which I didn’t particularly want, so as soon as I legally could I sold it and made a nice profit since it was pretty much brand new and bought myself a rather nicer car.\n\nI told my family this recently on a drunken night when we were all at a get together, and although everybody found it uproariously funny, my family are split into 2 camps- some people think I cheated and was ethically and morally wrong, and other people think the other contestants deserved to lose if they listed their *actual* fears.\n\nI’m obviously in the latter category, but genuinely wondering what others think.",
        "edited": "False",
        "id": "dmfsum",
        "is_asshole": 0,
        "num_comments": 2343.0,
        "score": 29294,
        "timestamp": 1571920695.0,
        "title": "AITA for lying about my biggest fear on a quiz show and subsequently winning a car and making other contestants lose?",
        "verdict": "no assholes here"
    },
    {
        "body": "I know from the title, it definitely sounds like I would be the asshole but please hear me out. I have an older cousin whose son, my nephew, is in his early 20s. My nephew is autistic and holds a part time job, but is significantly delayed in many developmental areas (I don’t know the specifics) and will never be independent according to his parents. \n\nRecently, my cousin and cousin-in-law have been thinking about relocating to our state because of recent job opportunities, and we’ve hosted them in the past when they’ve visited. The first time they stayed with us (before my son was born), my nephew seemed to develop a strong attachment to my wife and always wanted to be near her. He drew a picture of a heart and picked some flowers from our yard and gave them to her before they left, saying he loved her. My wife thought this was sweet and gently handled his crush by telling him she would always love him as his aunt, but she was sure he would find another girl to fill his heart soon. He told her no, she was his girlfriend. \n\nThis weekend, they were staying with us again and my nephew again wanted to be near my wife every chance he got. His mom and dad noticed and told him that because my wife now had to care for our son, she couldn’t pay attention to him as much as before. He got upset telling us that she was his girlfriend and had a meltdown, which caused my son to start crying. When my wife got up to take our son to another room to calm him down, my nephew got up to follow and his dad had to forcibly restrain him from following them. I stood up to block the hallway into the separate room just in case he got away from his dad. \n\nOnce they calmed him down, they apologized for his behavior and said they would keep better tabs on him. Here’s the part where I may be the asshole. I told my cousins I didn’t feel comfortable with my nephew being so possessive of my wife, and I know for sure she didn’t, especially since he seemed to be so jealous of our son. I told them I couldn’t allow their son in our home until he learned to control himself and understand that my wife was not his girlfriend. I apologized but asked them to get a hotel room for the rest of their stay and not to visit us again unless they left my nephew behind with people they could trust and knew would care for him, while they searched for jobs in our state. They didn’t say anything but looked saddened and went to the guest room with their son to pack up their bags. \n\nI guess they must have told my extended family what happened because my paternal grandmother called me this afternoon, telling me that I should’ve been more understanding and that I was wrong to ask them to leave. \n\nAm I the asshole?\n\nEDIT for added info: \n\nThank you to everyone who took the time to comment or private message me with their own experiences with family members who are/were autistic. There’s not nearly enough time for me to respond to each of the comments (which honestly surprised me when I saw how many had reached out to me), but I wanted to address some questions that had been asked. \n\n1. The first one is that technically, my cousin is my second cousin. My dad is an only child so the cousin I refer to in my post, is the son of my own dad’s first cousin (my paternal grandmother and his paternal grandfather were siblings). I’m not sure if this is correct but his autistic son would technically be my third cousin(?). The reason I refer to him as my nephew is because he’s the generation after mine in our family tree and it’s less of a mouthful to refer to him as cousin-x-removed. A lot of people have posted that it’s not correct to refer to him as my nephew but to be frank, I don’t care, and my family’s never followed this traditional genealogy nomenclature. I apologize if it was misleading in my post. Without being specific, in the western state I was born and grew up in, it’s not uncommon to refer to even close (unrelated) adults as uncles or aunts. I call him my nephew because my cousin and I were close and I still hope to have a close relationship with him if at all possible (though I don’t know how after this situation). \n\n2. Some have asked if I was jealous of my nephew calling my wife his gf. The first time, I thought it was amusing and was surprised that he had any romantic notions towards anyone, let alone my wife. Remember, in my mind he’s my nephew and I never thought of him as anything other than a large kid because of his developmental delays and normal (for him) childlike behavior. Regarding the situation that happened this weekend, I was only concerned for my wife and son’s safety. I didn’t know how he would react and followed my cousin’s lead, but wasn’t about to let him get near my wife and son once they left the room. \n\n3. I don’t know what was said to my paternal grandmother but I don’t want to react in anger and want to talk to my cousin once we’ve both had time to process what happened and calmed down.",
        "edited": "1566790701.0",
        "id": "cs6k42",
        "is_asshole": 0,
        "num_comments": 2784.0,
        "score": 28132,
        "timestamp": 1566159852.0,
        "title": "AITA for asking my cousin not to bring his autistic son (my nephew) to my home any more because of a romantic attachment to my wife?",
        "verdict": "no assholes here"
    },
    {
        "body": "For the last year I’ve had a rewards card to a local gas station chain that lets me get deals and store coupons. \n\n\nAbout a week ago I went into the store to get a beverage, and swiped my rewards card before swiping my debit, however after the card reader finished processing the rewards card the total due went to 0 and the cashier asked if I wanted a receipt. At this point I figured I had just used a deal I don’t know about, but the next time I went the same thing happened. So the next several times I’ve gone I’ve made around 10 dollar purchases with a variety of different items, and every single time it’s been free.\n\n\nI’m thinking something is wrong and I should tell someone, but I kinda wanna keep getting free stuff. AITA?\n\nUpdate: Hi guys\n\nI thought I had the golden ticket, I really did. \n\nI thought I had the coveted, all expenses paid, lifetime gas station experience moving forward. The rewards card that wouldn’t stop rewarding. Last night I dreamed about all the bags of mixed nuts, the hardest of the boiled eggs, the bottles of old orange juice, the not-so-hot dogs that have been rolling right next to the hispanic egg rolls for the last 6 hours, that were just sitting there waiting for me to get my grubby, stinky little paws on them.\n\n\nI wanted to ask you fine people if I was the asshole real quick before I went balls deep and pilfered my way through a Midwest convenience store chain. I’ll be honest I didn’t care what people said though. I was high on the fact that I had, more or less, the most power in the entire world.\n\n\nAfter I made the post I made my daily trip to indulge in my kingdom, not caring that like 15 people on my post had just been like, “I mean you kinda suck as a person overall like a 0/10 also your ugly and your posture is bad you need to fix that it’s good for your spinal health and overall makes you feel better and more confident, but yeah you shouldn’t steal”\n\n\nI made my way around the store picking up every possible box of hard boiled eggs, and also grabbed an energy drink cause I was sleepy. And then I went to perform the maneuver. I strode passionately, arms filled to the brim with eggness, to the front counter.\n\nIt was a gift card. \n\n\nI had completely forgotten my giver of birth had given it to me like 2 months ago, and it had stayed hidden in my wallet until last week in a frantic, anxiety filled search for the rewards card, I found it and my dumb little brain couldn’t read the text that said “gift card” on the bottom.\n\nI’m not going to lie a tear or two fell when the cashier was like “alright weirdo, there was $5.29 left on that, now you owe $43.82.” But I sucked it up and paid, and now all I have is sadness and a fair amount of protein and amino acids at only 77 calories per portion.\n\nTL;DR I thought I had it all but now I just have a lot of eggs.\n\nUpdate 2: to everyone saying this is a made up story, I can tell you unfortunately it is not. I wouldn’t be able to eggzagerate something like this.",
        "edited": "1564687683.0",
        "id": "ckndum",
        "is_asshole": 0,
        "num_comments": 692.0,
        "score": 27511,
        "timestamp": 1564660528.0,
        "title": "AITA for possibly stealing from a convenience store multiple times and not saying anything about it.",
        "verdict": "no assholes here"
    },
    {
        "body": "My wife and I (both mid 30s) have been happily married for nine years. We don't have any kids and don't want kids. We had the \"what if\" talk before getting married; she told me she would want to have an abortion if she ever got pregnant.\n\nYesterday my wife told me she's nine weeks pregnant. She's on the pill, but accidents happen. She said she wants to carry to term and give the baby up for adoption. Naturally, I was surprised by the news and her change of mind. I asked her if she considered getting an abortion. She said she had, but she doesn't want to because she feels a bond to the fetus. She told me she has been researching adoption and learned that the local adoption agencies only accept birth mothers who are okay with having an open adoption. I told her I wasn't really comfortable with this and asked her if she would have an abortion. She started crying and spent the night at her sister's place. She wont answer my phone calls.\n\nI'm uncomfortable with this for a few reasons. I was adopted a birth and my adoptive parents weren't the best. I know this isn't the case for everyone who was adopted, but I can't help but have a negative view about it. A few years ago I tried to find my biological parents to learn my medical history, but I couldn't. I was sore about it for a little while, but it doesn't bother me anymore. My wife is aware of these points.\n\nI just don't want to pass on my genes because they're essentially a mystery to me. I also don't like kids. My wife said she actually would prefer to keep the baby, but she knows I wouldn't want to; so she said having an open adoption sounded like a reasonable compromise. I understand why she thinks that, but I still don't want to have any biological children, regardless of how much/little I would be involved in raising him or her.\n\nAITA for asking my wife to have an abortion?\n\nEdit: my wife takes birth control for reasons other than contraception. If she ever wanted to stop taking it, I would support her 100%. I realize that I’m an idiot for not getting a vasectomy a long time ago though. It honestly never occurred to me until now (I think because my wife has always been on birth control and said she would have an abortion). I see now that it was irresponsible of me to not get one regardless. I’m going to get snipped ASAP.\n\nEdit #2: She and I talked; it was emotional for both of us, but no voices were raised. Here are the main takeaways:\n\n* I apologized for putting her in this position by being an idiot and not getting a vasectomy earlier. I also apologized if she felt like I was pressuring her when I asked her to have an abortion. I didn't mean to pressure her, but I know words aren't always received as we intended. She said she felt pressured a little, but forgave me because she knows I was totally caught off guard.\n* She apologized for having a change of heart regarding abortion. She said she was really surprised by her own feelings and hopes I don't feel like she tricked me (I don't).\n* We mutually agreed that it would be good to spend one more night apart to really think. We've always have a strong marriage, and we're both committed to working through this - whatever that may look like.",
        "edited": "1567870736.0",
        "id": "d0v6ir",
        "is_asshole": 0,
        "num_comments": 2728.0,
        "score": 24253,
        "timestamp": 1567857961.0,
        "title": "AITA for asking my wife to have an abortion",
        "verdict": "no assholes here"
    },
    {
        "body": "I have three fingers missing on my dominant hand. It's fine. I can type and everything and even manage to tie my shoelaces most days (and on the days I can't, that's the dyspraxia). However, I won't deny that it looks a bit odd to most people. I only have my fourth and fifth fingers so my hand looks a bit like a child's drawing of a rabbit, and not a good one.\n\nI'm used to people asking about it, usually after staring for a good minute or two, but I still find it annoying. I really don't get why you'd think it would be an OK thing to ask someone about, but hey. I wasn't raised in a barn. Usually I nip the questioning in the bud by just explaining the truth from the get go and assuming that enough people will gossip about it that the message will spread by the end of the day (it always, always does).\n\nAnyway, I started a new job about a month ago, and I honestly could not face going through that same cycle again. I felt like the time had come to not play into it any more and to make something out of it - and I decided to make myself laugh. When the first new coworker asked about it, I completely lied and told her that I chewed them off as a baby. I then decided to tell the next person who asked that I cut them off with a plastic knife at a picnic, and the next person that I was born with six fingers and they removed too many, and so on. All genuinely ridiculous reasons but I'm a good actor and they actually believed my stupid lies. I didn't expect them to (a plastic knife... through bone?!) but there you go. Maybe they just thought there's no way I'd lie about how I lost my fingers.\n\nWithin about 3 days, I learned that my coworkers had been arguing about the actual reason and it seems like a lot of them now actively dislike me for lying to them. I'm probably going to have to make some cupcakes over the weekend with my super cool 3D printed adaptive whisk to get back into their good books. \n\nAnyway, I told this story to my brother today and he told me that I was an asshole because I caused tension within the office on my first day and made people feel stupid for being gullible and believing my lies. My argument is that I'm not the asshole because they were asking a rude, albeit common, question and because I didn't do it with the intention of deceiving them, I was just honestly fed up of the question and didn't think they'd think I actually severed three fingers with dental floss when I was 3. I'll accept my judgement, though.\n\n",
        "edited": "1566999390.0",
        "id": "cw9hdj",
        "is_asshole": 0,
        "num_comments": 3363.0,
        "score": 24012,
        "timestamp": 1566935140.0,
        "title": "Aita for giving all of my coworkers a different reason for why I have missing fingers?",
        "verdict": "no assholes here"
    },
    {
        "body": "I’ve known James since we were 11. He’s been my best friend for a long time and we’re so close people ask us all the time if we are siblings because we look alike AND even share a last name. He lives close by and is very much integrated into all parts of my life. \n\nI had a crush on him growing up and I asked him out a couple times when we got a little older. He always declined and said we were just best friends. He’s really goofy with me, and treats me like I’m his little sister and over time I came to agree with him. we are 27 now and still the best of friends. My parents treat him like a son and honestly, he’s family. \n\nA couple months ago I had a ONS and found out I was pregnant. Being as I have PCOS I am OVER THE MOON because I was always told that the chance of me conceiving were very low. I am keeping this gorgeous miracle baby and I cant explain how many tears of relief I shed. I’ve always wanted to be a mom and finally I have a chance at this. I have my own home, have savings, I’m in the right place in life and I’m so happy. \n\nWhen James found out he was also over the moon. He thought it was the coolest thing ever but then gradually dropped off the face of the planet and he never wanted to hang out anymore. Won’t go to the gym with me, is too busy for the cinema, doesn’t feel like going to the mall, can’t come with me to visit mutual friends, nada. \n\nMy mom and dad invite him over every so often for dinner and so at the most recent one I cornered him and asked why he was avoiding me so much and if he had an issue. He confessed that he finds my growing baby bump disturbing and a little gross. He said ‘I know it’s really weird of me but it just creeps me out’ \n\nI found that so demeaning and hurtful, and I burst out crying and called him an immature asshole and told him to GTFO. He apologized and left and I haven’t heard from him since. I’m so upset that he’s ruining a lifelong friendship over my goddamn baby bump! I want to reach out but I just feel so .... alienated from my own body and made to feel gross and I’m not sure if I’m the one that’s being difficult or if it’s him.",
        "edited": "False",
        "id": "d523jg",
        "is_asshole": 0,
        "num_comments": 3713.0,
        "score": 22365,
        "timestamp": 1568647119.0,
        "title": "AITA for kicking my best friend out and telling him to grow up after he called my baby belly gross and weird?",
        "verdict": "no assholes here"
    },
    {
        "body": "This has been an ongoing argument between my wife and I, but it resulted in a huge argument today and I’m starting to wonder if I’m in the wrong. I think it’s impossible for someone in my position to see my wife’s point of view fairly so tell me who’s the asshole here. I’m also not interested in any relationship advice, our marriage is fine, it’s solely this topic/argument that I’m interested in hearing your judgement on.\n\nSo my wife and I have two kids together. But before I met my wife I had a daughter with my now ex-wife. My daughter passed away when she was 7, and the emotional toll of this destroyed my marriage with my ex-wife. We haven’t said a word to each other in almost a decade and I have no desire to speak with her anyway.\n\nI still own the same house as then and I’ve pretty much left my daughters room as it was. At first it was just because there was no reason to, but now it’s kind of like a memorial in some weird sense? I can’t really explain the logic behind it because I don’t think there is any. It just doesn’t feel right to change her room.\n\nThis has been the cause of the only arguments my wife and I have really had. The house has four bedrooms, so each of our kids have a room, we have a shared room, and then there’s my daughters old room. My kids know not to go in there and it’s just left there. Occasionally I will go in there and read a book, or just lie down on her bed. It’s therapeutic in some weird way.\n\nMy wife has always wanted to change the room. At first it was because she wanted a study, but I refused and eventually she gave up. \n\nWe’re now talking about having a third child and naturally she wants our new kid to have my daughters old room. Again I put my foot down and said that wasn’t an option, and that our two older kids can share a room instead.\n\n She really blew up at me and told me she was sick of me holding on to the past. She was sick of me being unable to compromise on this. She was sick of feeling like my deceased daughter came first. She said a lot of things but I think that basically sums it up.\n\nWhen she said these things I was really hurt. But I’ve had a few hours to think it over, and I think I might be the unreasonable asshole here. It’s not fair to make my kids share a room because I won’t let go of the past. It’s not fair to have a memorial reminds my wife that she wasn’t my first love. \n\nAITA?",
        "edited": "False",
        "id": "bq2hbt",
        "is_asshole": 0,
        "num_comments": 3217.0,
        "score": 21284,
        "timestamp": 1558174397.0,
        "title": "AITA forbidding my wife from using my daughters old room",
        "verdict": "no assholes here"
    },
    {
        "body": "He makes close to 200K a year while I make 50K a year. My family is dead broke, his family is loaded. I've never asked him for money or to pay my bills. He's the one who wants to do pay for everything and gets mad at me if I pay a bill using MY money. We even argued about when we have kids, he wants me to stay home while I want to work. I love my job. I'm frugal. I haven't been to a mall in 15 years and shop at Big Lots or Dollar Tree. I've never got attached to his wealth.\n\n&#x200B;\n\nHe tells me that it's common and not personal but it's insulting. It makes me feel like he's using me in someway. I understand someone wanting to protect themselves, but he wants me to give up my career to be a housewife and leave me in a situation where he can divorce me and leave me out to dry.",
        "edited": "False",
        "id": "d7b5e1",
        "is_asshole": 0,
        "num_comments": 1931.0,
        "score": 20086,
        "timestamp": 1569075992.0,
        "title": "AITA for calling off my wedding because my STBH asked for a prenup?",
        "verdict": "no assholes here"
    },
    {
        "body": "I (26F) was married to “Sam” (30M) for three years. He was bisexual, which I knew and accepted. We divorced a year ago, after some infidelity on his part. We have no children, and we do not speak.\n\nI work in an admissions office, and my coworker “Andy” recently got a new boyfriend. We are not close, but I congratulated him and moved on with my day. During lunch break, I was part of a larger group conversation, and one of my other coworkers asked Andy for details.\n\nI was shocked when he pulled up a picture of my ex-husband. I blurted something out, and everyone else basically went silent. I explained to Andy that I had been married to Sam, and that he was a serial cheater and had abused painkillers in the past (also true). I ended with saying, “...but if you want to fuck up your life, go ahead and date Sam.”\n\nFast forward to Thursday. Andy apparently complained about my “homophobia” to HR, and I explained the situation to our rep via email. I think the situation has resolved, but I’m not sure if I did anything wrong by warning Andy. I suppose I was trying to wreck my ex’s new relationship more than I was trying to help my coworker. Does that make me the asshole? AITA?\n\nEdit: since people are asking, here’s a transcript of the conversation. I tried to make it as close to verbatim as possible. Sorry I wasn’t more detailed in the post.\n\nMe, seeing the picture: “Wait, what?”\n\nAndy: “...This is the guy I was telling you about.”\n\nMe: “That’s my ex-husband!”\n\nAndy: “Really? He knows where I work, and he never mentioned you.”\n\nMe: “It’s absolutely him. And I should warn you, he’s a compulsive cheater and he pops pills. He even stole a bottle of painkillers from my mom, and I found them hidden in his truck. When we were married, he was literally doped up all the time. He’s a train wreck, but if you want to fuck up your life, go ahead and date him.”",
        "edited": "1574636044.0",
        "id": "e0utnu",
        "is_asshole": 0,
        "num_comments": 2042.0,
        "score": 19833,
        "timestamp": 1574576130.0,
        "title": "AITA for not reacting well when I found out my coworker is dating my ex-husband?",
        "verdict": "no assholes here"
    },
    {
        "body": "My sister is getting married in August 2020. My boyfriend (who is also vegan) and I are both invited. My sister reached out to me the day of the proposal and asked me to be a bridesmaid, which I was ecstatic about. My sister and I are very close, so she said it would be really meaningful to her if I was in the wedding party. I’m really excited for her, and I feel great that she values me enough to give me a spot. \n\nHer and her fiance have been on top of planning everything to avoid stress and pushing things off to the last minute. One of the things they already have picked are the venue and catering. I asked my sister about food options knowing there will likely only be a couple of dishes we can eat, but she told me there won’t be any options for us. Now I’m used to picking from a few side dishes, so I wasn’t expecting a lot, but my sister knows I’m vegan and knew it well before she got engaged. Apparently even the vegetables are going to be very buttery, so we can’t even eat those. I don’t expect a whole vegan friendly wedding, but I’m sure at least one option couldn’t have hurt. \n\nI asked my sister about including at least one thing for me, and she just told me I was probably going to have to find something else to bring in to eat or that I should eat before the wedding so I won’t be hungry when everyone else sits down to eat. Like what? \n\nThis honestly would not be a huge deal if I was going to someone else’s wedding who I wasn’t very close to, but my sister stressed and emphasized so much about how important it was to her that my boyfriend and I be there, then she won’t bother to make sure we can actually eat anything then tells me to just bring something else in while everyone else is catered to. \n\nI understand it’s her wedding. She has enough on her plate already, and I won’t try to make her change the menu for us, but we both feel hurt that we’re just being tossed to the side and told to fend for our own food.\n\nEdit: A piece of info that I did not include is that my parents keep kosher, and they are being provided with options.",
        "edited": "1574869046.0",
        "id": "e2gmib",
        "is_asshole": 0,
        "num_comments": 6635.0,
        "score": 19695,
        "timestamp": 1574864352.0,
        "title": "AITA for wanting my sister to give me vegan options at her wedding?",
        "verdict": "no assholes here"
    },
    {
        "body": "Alright everyone, I need some judgement on this one...\n\nMy wife and I have a happy, healthy (no chonkers) cat that we love except for on weekends when he will sit outside our bedroom door and meow non stop until one of us gets up to feed him. This only happens on weekends.\n\nMonday-Friday my wife wakes up for work first at around 6:00 am and feeds the cat. However on weekends we both try to sleep in, so come 6:01 am our kitty alarm clock goes off and won't shut up until one of us gets up to feed him. He will literally cry for 2 hours straight if we try to ignore him.\n\nHere's where the story takes a twist. Awhile back we bought a timed self feeder to use when we are away for vacations. When we tested out the self feeder we discovered the amazing benefit of the cat no longer crying to us for food because he gets fed at his usual time each morning. I thought this was fabulous and we should use the self feeder all the time to save our sleep sanity.\n\nMy wife disagreed. Her reasons range from:\n\nConcerned that the self feeder might not drop the correct amount of food each time.\n\nConcerned the cat might be able to reach his little murder mitten up the food chute and steal extra food between meals.\n\nConcerned the cat won't \"love\" us anymore since we aren't the ones directly pouring his food into his dish.\n\nConcerned it's a waste of batteries.\n\nI've told my wife I understand all of her concerns but I still think the benefit of being able to sleep in without being woken up by a cat banshee outweighs the risks she has laid out. She still disagrees.\n\nSo I did the only thing that reddit hates more in relationships than cheating and gave my wife an ULTIMATUM! \n\nI told her that we either use the self-feeder or come 6:01 am Saturday morning when the cat wakes us both up, I'm kicking her (not litterally) out of bed to go feed the damn cat.\n\nSo reddit, AITA?\n\nEDIT: I'm seeing a lot of people proposing the compromise of using the self feeder just on weekends. Unfortunately my wife has shot that idea down in the past too.\n\nEDIT 2: Many people have been demanding I pay the \"cat tax\" and post a picture of the real AH in question. Sadly I am a Reddit failure and can't figure out how to attach a picture to the post. If anyone knows how to do this and can direct message me, I will gladly comply and pay the cat tax.\n\nEDIT 3: Hopefully this works...\n\nMy little AH https://imgur.com/gallery/na99l3J",
        "edited": "1570915133.0",
        "id": "dgves7",
        "is_asshole": 0,
        "num_comments": 2522.0,
        "score": 19341,
        "timestamp": 1570888319.0,
        "title": "AITA for Telling My Wife to Get Out of Bed and Feed the Damn Cat.",
        "verdict": "no assholes here"
    },
    {
        "body": "A bit of backstory. I met my wife in the summer of 2008. She was working as the ice cream girl at a local restaurant. I had gone to pick up some boxes because I was moving. Out walked my Sara...it was close to the end of her shift. And working in this particular restaurant was a...dirty job to say the least. (Seriously, I don't care what DDD says, that place is gross.) She was covered in sweat from cleaning the machines, caked in all the dirt from that nasty little kitchen, had a grease stain on her cheek...and she was fucking beautiful. Her smile, her easy laugh, her obvious intelligence...I'm pretty sure I fell in love right then and there that wonderful May night. (inb4 \"tHAts sO OlD faShIOned!!!\" Don't care. When you know, you know.) I wasted no time in asking her out and we hit it off immediately.\nIt started after our first date. She had mentioned she loves lilacs. Me, being a 23 year old guy at the time, didn't know Jack or shit about flowers. But the way she talked about how much she loved them I knew I didn't want to forget that tidbit of information. So I wrote it down in one of those mini spiral notebooks. (Think what cops use to take notes.) This was The Almanacs genesis. Over the years I've written down information about my wife. Her favorite color, her favorite restaurants, her favorite books, movies she wants to see, etc. Basically all the little things I knew I would forget. Anything that struck me as worthy of remembering when she told me. I would go through it every once in a while so I could do something sweet for her. Fast forward to yesterday morning.\nI get a call from her around 11am. \"What the fuck is The Almanac?\" (The Almanac is written on the cover. It's just a silly name that occurred to me a few years ago.) She obviously has it, and I don't lie to my wife, so I tell her. She gets really quiet for maybe half a minute and then says \"I always thought you remembered this stuff...\" tells me she has to run and hangs up. I get home from work last night and she's really dejected. I asked her what's wrong and she says the Almanac has cheapened every sweet thing I've ever done for her. She called it my \"playbook\" and said she felt betrayed. Mind you I've never showed it to a single soul nor have I even told anyone about it. Until yesterday I was the only person in the world to know of it's existence. (She also said she hasn't decided if I can have it back or not, and that she's thinking about destroying it.) I'm kind of heart broken. I feel like this should be an example of how much I love her. I'm terrified she's going to burn it. I WANT to remember all these details that make my wife who she is. That's why I write them down. I don't chronicle these things for brownie points or status. I do it because I love my wife. I hear so many wives bitch that their husbands don't remember shit, and I don't want to be that guy. So yeah, I took notes. And now I'm getting the silent treatment. Or at best single word answers.\nAITA here?",
        "edited": "False",
        "id": "b5o8t6",
        "is_asshole": 0,
        "num_comments": 3032.0,
        "score": 19266,
        "timestamp": 1553597849.0,
        "title": "AITA for having an Almanac?",
        "verdict": "no assholes here"
    },
    {
        "body": "Let me preface this off by blaming all of you, the entirety of reddit for desensitizing me, and giving me major trust issues on April fools day.\n\nSo here it goes... Yesterday I got a group text from my wifes (sarah) side of the family stating there was an emergency family meeting happening that night over dinner at my mother in laws (Barb) house. \n\nI immediately had april fools spidey senses starting to tingle, but we haven't all got together since Christmas so I overlooked it and said we (my wife and I ) were in. \n\nWe were the last to arrive and it was pretty somber when we walked in. We all sat down at the table and my wifes brother (Tim) informed the family that his wife (Ashley)  has been having an affair and they are divorcing. The affair was with a long time close family friend (Chris) who lived a block away.\n\n\nChris' wife (jen) had caught them when she came home early one day last week and broke the news to my brother in law Tim. \n\nBoth families have been friends for years. They live less than a block from each other, they each have been married for 15+ years, have 4 kids right around the same age. Honestly, I have always thought both of them were picture perfect families. Hell, all four of them and their kids were at our house two weeks ago for a bbq. \n\nAnyways after airing a lot of dirty laundry, and their plans to divorce, how it could effect future family functions, and opening it up to the group of any questions... there was silence. \n\nI broke the silence with laughter and a slow clap. Saying this was the best april fools gag I've ever seen but I wasn't falling for it. I told Ashley and especially Tim they need to consider going into theater, their performances were top notch and tears seemed genuine. \n\nBeing the newest member of the family (my wife and I married 6 months ago) this was probably not the best thing to say in hindsight. I probably should not have said anything. \n\nEveryone in the room looked horrified. \n\nMy mother in law, who had been crying the entire time, lost all composure. She left the room in hysterics and did not return before we left. \n\nTim, just shook his head, and his cheating wife actually let out a brief chuckle before calling me out for being a dumbass for thinking this was a ruse. Then berating me for being so insensitive. \n\n\nThe rest of the family sat in silence shaking their heads as my wife berated me for trying to make a joke out of a serious situation...\n\n\nI am still dumbfounded. In hindsight, I probably should have sat in silence... but I honestly still feel like I was calling out an april fools gag. \n\n\nAm I the asshole?\n\n\n",
        "edited": "False",
        "id": "b8m3yb",
        "is_asshole": 0,
        "num_comments": 1823.0,
        "score": 19161,
        "timestamp": 1554225563.0,
        "title": "AITA for thinking a divorce announcement due to an affair was an April fools joke?",
        "verdict": "no assholes here"
    },
    {
        "body": "I had to make the hardest decision of my life a week ago and i want some AITA judgment to see if i made the right decision so please don't remove and say it needs to go tinto another subreddit cuz i'll post there too\n\n&#x200B;\n\nMy wife went into labor a few weeks earlier then expected and she ended up giving birth at the hospital. The day it happened she told me that she was in the hospital and needed me however i had just left the house an half hour prior to go see my father who was likely about to die (he did a few hours after i arrived). I decided to see my father one last time and i felt like it was more important than seeing my child's birth because i will raise him and see him everyday for the next 18+ years and i really need to say some things to my father before he dies. My wife and the rest of her family are fucking pissed at me and said that birth is one of the most important parts of our lives and i needed to be there to support my wife and see the child. Obviously i didn't want this shit to happen but i felt seeing my father for the last time was important especially since i hadn't seen him in weeks and we weren't on good terms then which we eventually resolved thankfully. If you'd like to provide any advice you're welcome to as i could use some but I'm mainly here for judgment\n\n&#x200B;\n\nEDIT: I am so surprised this post went so viral. I last saw it with like 50 comments and i then saw this on trending and I'm absolutely astonished by how viral this went. Thank you reddit for all of your support and i really appreciate you guys. Im amazed from the awards i got and up votes. Once again thank you so much for your support and this hard time. My wife and i are on good terms but I'm still getting shit from some of her family. She understands my predicament and doesn't hold it against me.",
        "edited": "1556444173.0",
        "id": "bi0ljh",
        "is_asshole": 0,
        "num_comments": 3616.0,
        "score": 19051,
        "timestamp": 1556381426.0,
        "title": "AITA for skipping my child's birth to see my dying father?",
        "verdict": "no assholes here"
    },
    {
        "body": "My wife and I have a 6 month old baby girl and a two year old boy. Wife hasn’t been too happy since returning to her job from her last maternity leave and I actually just got a new job. \n\nAt my old job I was working 45-50 hours a week. At my new job my hours fluctuate a lot — it can be anywhere from 60 to 80ish hours a week at the worst. I make a lot more though so there’s that. The pay raise makes it so my family can do really well on just one paycheck. My wife is ecstatic because this means she can be a SAHM which is what she’s wanted. \n\nThe issue is that my wife and I aren’t on the same page about what this change would mean. Before, when our work hours were almost equal, we divided housework pretty much equally. We also paid a housekeeping staff to come every other week to help us out. (Plus we have a nanny to care for our kids while we work). \n\nI told my wife that her staying home would mean no more housekeeping staff or nanny. These cuts will help us afford to have just the one income and I also think it’s practical.  She was mostly agreeable to that. But then she said that we should divide the chores 50-50 still. \n\nI told her there was no way I was going to be taking on as many work hours as I am and then come home to cook or clean too. That would defeat the entire purpose of her quitting her job. \n\nShe looked at me like I was some sort of Neanderthal but I think what I’m saying is completely fair. I’m not expecting her to do any heavy lifting. Just tending to the kids, cooking, and doing a reasonable job keeping up the house. I recognize that this would be an old fashioned way of living and if she ever wanted to return to the workforce I would support her 100%. But I think it’s fair that if I’m the sole paycheck and working crazy hours I don’t come home to more stress and chaos. \n\nObviously my wife and I will have to work this out between ourselves. I’m mainly posting here as a sanity check to see if my thoughts on this issue are completely off base. \n\n**",
        "edited": "1546529189.0",
        "id": "abv65u",
        "is_asshole": 0,
        "num_comments": 4635.0,
        "score": 18504,
        "timestamp": 1546448271.0,
        "title": "AITA for telling my wife that when/if she quits her job to be a SAHM I am not planing to do much in the way of household chores anymore?",
        "verdict": "no assholes here"
    },
    {
        "body": "So my boyfriend(now fiancé) and I have been together for 5 years. He’s great, and I love him. We had discussed getting married before a little bit and both said we wanted to, but didn’t really say when. \n\nBoth our families were away for thanksgiving so we decided to take a little vacation, we went to sequoia national park and I thought that it would be the perfect place to propose. I already bought him a really nice watch (he wears one but it’s sort of cheap), and when we were in this beautiful little clearing with the huge trees and no one was around I popped the question, got down on one knee and all.\n\nHe was really surprised and didn’t exactly react the way I expected, he seemed sort of annoyed and upset but eventually said yes. On the drive home he said that it made him upset that I would just propose and that it was “a mans part of a marriage” and “something he was looking forward to his whole life”. So now I feel really awful because I thought it would be really sweet if we reversed the roles because he’s always doing romantic things for me.\n\nAnyway he was sort of cold when we got home, not outwardly aggressive but now I’m just sitting here worried if I did something horribly wrong.\n\nAITA?\n\nEdit: Jesus I didn’t expect this many comments. I see a bunch of people talking about how he lost his chance when he waited 5 years, but I’m only 27 and he’s 28, so we were in college and grad school for much of the relationship. He was getting his PhD and was busy and I got my masters and started my job and he was still in school. We had this conversation maybe 4 months ago? So it’s not like he’s had years.\n\nI’m planning on talking to him about it when he wakes up. But I don’t really appreciate the “your marriage is doomed” comments\n\nUpdate: I figured I’d update since some of the comments were actually very helpful, despite a few suspect pms. I talked to him earlier, and he apologized for getting upset, I apologized for making him upset and we made up, and then he pulled out an engagement ring for me and proposed back. So all is well, and I still feel a little bad for stealing his  thunder, but these things happen I suppose. But I’m getting married!",
        "edited": "1575228031.0",
        "id": "e4c83s",
        "is_asshole": 0,
        "num_comments": 3160.0,
        "score": 18409,
        "timestamp": 1575181413.0,
        "title": "AITA for proposing to my boyfriend as a woman?",
        "verdict": "no assholes here"
    },
    {
        "body": "Edit/Update:\n\nThe moderators have been kind enough to let me update my post.\n\nI know many, many people have asked about the skillset I mentioned. I just can't be specific because it'll make my younger kids' company identifiable with a quick search. I will say it's nothing mysterious and is a combination of woodworking, metalworking and some masonry sometimes. It's just a niche product and not many people do it. The tools and techniques are unorthodox.\n\nI spent a lot of time reflecting yesterday after reading everyone's comments.\n\nI have talked to my younger kids and I explained to them that even if they aren't happy with how their brother approached it, it's clear he feels left out from our family and it's all our responsibilities to help fix this.\n\nThey agreed to extend the offer of apprenticeship again to their brother where he works and learns as a salaried employee. But they've made it clear that no ownership can be transferred after he's put in at least three years of work like they have. I actually think this is generous because they are paying a salary that they don't need to.\n\nHowever, I'm not sure if my oldest will go for this. He is feeling some sort of way about working for his brothers, not with them.\n\nI reached out to a teacher in Alaska who I know casually. He might do me a favor and take on an apprentice. \n\nI need to scrounge up some money and see if I can send my son there. But again, it's Alaska and I'm not sure if my son will be receptive.\n\nI don't know what else I can offer at this point. My wife is disgusted that we've become that family that is fighting about money. She wants to force the twins to give a stake in the company to their brother but I really think it's a bad idea. They need to fix their conflict first or it'll just be a disaster. I don't believe we should be telling our younger kids on how to run their company.\n\nI'll be meeting my son this Friday for dinner. I hope he'll be ok with at least one of the options.\n\nI also need to talk to my parents to stop creating more issues. They've always enjoyed chaos and like pitting people against each other. It's not helping.\n\nThanks everyone.\n\n\nThis is the original story:\n\nThis has quite literally fractured my family.\n\nI have an older son from my first marriage who's now 24. I have two younger kids from my current marriage who are 21 year old twins.\n\nMy divorce occurred right after my son was born. \n\nOver the years, my visitation has been primarily summers and holidays since my ex-wife moved to a different state.\n\nI have a particular skillset I'm was very good at. And all three of my kids have expressed interest in it. Unfortunately, I have only been able to meaningfuly teach it to my younger kids.\n\nThis was because to make my visitation with my older son more memorable, I would do camping/vacations etc. I didn't have time to teach him properly.\n\nAlso, anything I did try to teach him was forgotten and not practised because he lived in an apartment with his mother.\n\nThe major issue now is that my younger kids have started a company after highschool using this skill. I provided the initial funds and as such have a 33% stake in it. This company has really soared this past year and it's making a lot of money.\n\nMy older son graduated from college and is doing a job he hates and is not exactly making a lot of money. Especially compared to his siblings.\n\nPart of this is my fault because he did ask to take a few years off after highschool and maybe have me teach him what I knew but my wife was battling cancer at the time and I told him I couldn't.\n\nAnd now, I'm not well enough to teach anymore.\n\nHe is now telling me to include him in this company as a equal partner. That he'll do the finances.\n\nThis was not received well by his siblings who say they do basically 95% of the work. And that he didn't struggle in the earlier years to get it running.\n\nI'm really at a loss here. I thought of just giving my share of the company to my oldest son but it does seem unfair to his siblings who started this company in the first place.\n\nMy oldest has become very bitter about this and has involved my parents. They are taking his side and now my younger kids are resentful that their grandparents have been turned against them.\n\nOur Sunday family lunches are no longer happening and I'm having to see my oldest for dinner on other days. And everytime I see him I'm getting accused of not treating him fairly. It kills me because I made so many compromises to have him in my life in a meaningful way.\n\nHe accused me on Saturday of pushing him out my new family and loving his siblings more. I haven't been able to sleep since.\n\nShould I have done all this differently?",
        "edited": "1568123476.0",
        "id": "d1r1vr",
        "is_asshole": 0,
        "num_comments": 5431.0,
        "score": 18329,
        "timestamp": 1568036452.0,
        "title": "AITA for not teaching a skill to my oldest son that I taught his siblings because of the custody arrangement?",
        "verdict": "no assholes here"
    },
    {
        "body": "My daughter passed away 6 years ago fighting a rare genetic condition. The condition was also responsible for my late wife's death when my daughter was only an infant. I don't want to discuss anything related to that now. Let me talk about the issue at hand. \n\nI'm now married to my amazing wife. I have a stepdaughter who will be starting high school shortly. I made a lot of investments for my late daughter. I thought I could give her a head start in life. But that never happened. So I decided to donate the money to a charity ( which helps kids with  genetic disorders ). The investments I made mature in an year and I plan on donating all of it. \n\nNow my wife wants me to use the money for my stepdaughter. She tells me that this will help her have a head start in life and that would partially fulfill the purpose of the investments. She thinks this will also help us finance her college education. She doesn't want her getting bogged down by loans, which is a sound argument. I love my stepdaughter, but I don't think I'm ready to do this. I want to donate the money. WIBTA here?",
        "edited": "False",
        "id": "bwd091",
        "is_asshole": 0,
        "num_comments": 2896.0,
        "score": 17833,
        "timestamp": 1559581080.0,
        "title": "WIBTA if I tell my stepdaughter and my wife that I don't want to use the investments I made for my late daughter to finance her college education?",
        "verdict": "no assholes here"
    },
    {
        "body": "So my girlfriend and I recently got engaged, and I figured it would be nicer to have her pick out her own ring rather then me guessing what she likes. \nNow I already know my girlfriend loves shiny things, but now she is absolutely adamant that she wants a real diamond ring. Personally I don't like the idea of shelling out so much money for a piece of jewelry with an artificial high price. So instead I offered to buy her one that was lab-grown, as it's way cheaper but also doesn't involve shady business practices and labor. \n\nMoney isn't an issue, it's really about the ethics for me. I do not like the idea of buying her something that potentially harmed someone in the making of it for our wedding. But she thinks I'm being stingy for not buying her a \"real\" diamond. We've already gotten in a few arguments over this so now I wanted to ask you guys if I should just suck it up or not.",
        "edited": "False",
        "id": "bcpbxl",
        "is_asshole": 0,
        "num_comments": 3319.0,
        "score": 16717,
        "timestamp": 1555152747.0,
        "title": "AITA for not wanting to pay for a diamond ring?",
        "verdict": "no assholes here"
    },
    {
        "body": "So theres not too much to say, I guess I'm more curious in others opinions on this.  I am an approx 22.5 year old man, I recently snagged a really really good job.  I work as a corporate level administrator in the trucking industry.  It's been a pretty sweet gig so far and have no complaints as of yet (2 months in). I would also like to preface the following with saying that I work with a very diverse staff of coworkers who are all as professional as they can be, rarely is it that someone cant pull their own weight. \n\nAbout a week ago I was walking through the parking lot to my car after the end of the day, and I was looking at the sunset through the chain link fence.  As my eyes darted around i happened to notice a pink metal plate bolted onto the fence, I thought to myself \"woah, what's that and how did i not notice it before?\" So i started reading it and I was immediately greeted with slight disappointment.  Basically, it read as follows \"FEMALE EMPLOYEE PARKING SPACE ONLY!\" with a large symbol in the middle of the sign which is also seen on women's public bathrooms.  \n\nNow, let me clarify I am not \"Irate\" or \"fuming\" about it, but I dont really buy into the whole chivalry, white knighting culture that the men of previous generations upheld *fedora intensifies*.  I even asked my fiance when I got home, just to get a female insight on it.  She said she thought it was stupid.  I guess I'm just coming from the territory of you can show that your a diverse company dedicated to equality, without making tedious or unimportant decisions like special parking.  Just my two cents on it though. ",
        "edited": "False",
        "id": "asawpv",
        "is_asshole": 0,
        "num_comments": 3536.0,
        "score": 16702,
        "timestamp": 1550586164.0,
        "title": "AITA for Objecting to \"Female Employee Only\" Parking Spaces at My Workplace?",
        "verdict": "no assholes here"
    },
    {
        "body": "Wife and I got married as widowers. My late wife and daughter passed away in an accident. My daughter was only 1 when she passed away. My current wife had 3 yo twins when we got married. The girls are 15 now.\n\nSo, yesterday when wife and I were watching a movie, she told me that the girls were planning a surprise for me on their birthday. And when I asked her what it was, she told me that they wanted me to adopt them. I was really happy, because it meant that I had done a good job, but unfortunately I cannot adopt them. I'm actually glad that my wife told me that. A surprise would have caught me off guard. \n\nThe thing is, my wife and I had discussed about this when they were young. I made it clear that I didn't want to adopt anyone or have more children. Call it coping up with my daughter's death or whatever, but I've never felt comfortable thinking about it. My wife is now asking me to say yes. \n\nI've been there for them and I'll always be there for them. I love them but I don't think I'll be comfortable adopting them. WIBTA here?",
        "edited": "False",
        "id": "bxumsi",
        "is_asshole": 0,
        "num_comments": 3507.0,
        "score": 16390,
        "timestamp": 1559914189.0,
        "title": "WIBTA if I decline my twin stepdaughter's request to adopt her?",
        "verdict": "no assholes here"
    },
    {
        "body": "My 17 yo daughter (youngest and we had her late) is 7 weeks pregnant (she will be 18 by the time she gives birth) She is not in a relationship with the father. He reeaallyyy, I can't stress this enough, does not want a baby. I honestly don't even think he'll show up for the birth or anything.\n\nShe has decided to continue with the pregnancy against all advice from practically every adult in her life. After she insisted on not only continuing with the pregnancy but raising the baby I asked her how she is going to manage that? This was the jist of the convo:\n\nHer: I'll get a job. \nMe: who's going to watch baby while you're at work? \nHer: I thought you and dad could.\nMe: absolutely not, I'm not raising another baby.\n\nPretty much a back and forth for a bit that lead me to believe that if she has this baby in this house, I'm practically going to be its mother. I'm very recently retired  and my husband is retiring in exactly 11 months (there's a countdown) and this is not how I want to spend my retirement years. It's not fair to us. So I told her that she has until baby is born to find a place to live. Husband has always been wrapped around her finger (which normally is endearing, I love how much he loves our children) so he is not fully on board with that but I feel like we need to be united on this. I just want to know if  I'm in the wrong here.\n\nAITA?\n\n",
        "edited": "1565233386.0",
        "id": "cnfixf",
        "is_asshole": 0,
        "num_comments": 4529.0,
        "score": 15949,
        "timestamp": 1565232126.0,
        "title": "AITA for making my pregnant daughter move out before the baby is born?",
        "verdict": "no assholes here"
    },
    {
        "body": "Last week one of my coworkers started to feel unwell and another coworker took her to the ER. She was having an allergic reaction. She has an allergy towards peanuts and thinking back on it I probably caused the reaction since we both had had to use the same computer to check order and I had peanut butter on my waffles that morning. I definitely don't think I washed my hands after either. Once somebody got the call she was ok they asked us all in a group who had had peanut butter that day and I stayed completely silent.\n\nWell, yesterday she came back into work. She was fine and everything, but apparently the trip to the ER still cost her $300 after insurance plus the money she lost not going to work for a two days. Our coworkers all sympathized and a few started saying whoever had the peanut butter should have to pay. Since I wasn't part of that conversation. I just heard them from across the room, I just focused on my work an tried to avoid the subject for the rest of the day.\n\nEdit. A ton of people have brought this up so just so you guys know I will bring up worker’s compensation and she did have an epipen.",
        "edited": "1569985862.0",
        "id": "dby7xn",
        "is_asshole": 0,
        "num_comments": 2078.0,
        "score": 14619,
        "timestamp": 1569957341.0,
        "title": "AITA for not fessing up to causing a coworkers allergic reaction?",
        "verdict": "no assholes here"
    },
    {
        "body": "The MCAT is basically the entrance exam for medical schools in the US. Applicants are graded from 472 to 528 based on a percentile. A 478 is literally the bottom 2% of test takers. The median/average score that can maybe get you into a med school is a 500. You must score at least a 508 to be in the top 20% of applicants, in a field where only about 20% of applicants each year accepted into all the med schools in the country.\n\nResults for the June 15 exam came out yesterday. This coworker was happily telling people how she passed and got a 478. I myself aspire to be a doctor but postponed taking the MCAT because I have been unable to hit a 505 consistently in full length practice tests. I have an trying to coach her, telling her that she must hit at least a 500 to be even considered as a serious applicant. Throughout this process, I have noticed that she didn’t have a solid prep plan, or a good idea of how to be a pre-med student (she is non traditional like me).\n\nSo when she was happily telling our other coworkers (and the doctors we work for!) that she got a 478, I took her aside and tried to explain to her the reality of the situation as nicely as possible. Threw in some encouraging words about the virtues of retaking, implored her to hit the Kaplan books and really research the kinds of students the schools she wants to apply to (she just wants to get in anywhere).  I asked her to reconsider postponing her applications until next year. She had already sent out some primaries but haven’t gotten any secondary applications back.\n\nShe was in near tears. It feels like I just crushed someone’s dreams. She couldn’t look me in the eye the rest of the day. \n\nAITA???????",
        "edited": "False",
        "id": "cearrk",
        "is_asshole": 0,
        "num_comments": 1589.0,
        "score": 14096,
        "timestamp": 1563357466.0,
        "title": "AITA for telling my coworker about the reality of a 478 MCAT score",
        "verdict": "no assholes here"
    },
    {
        "body": "My husband died a week ago and I'm 13 weeks pregnant. My in-laws know and they want me to keep the baby so there's a piece of him alive. When I mentioned I might get an abortion they flipped out on me, called me every name in the book and selfish, at which point I broke down in tears and left.\n\nI don't know what to do. On one hand I can understand what they mean, if I abort there's nothing of my husband left. But I just... Don't know. I can end this chapter of my life and move on. I don't know what to do. I know a lot of you are thinking it's amazing I'm pregnant and I can always have a piece of him through my baby but that's the thing, I can't decide if I want that or not. I've never been more conflicted in my life and I have to stop thinking about it so I don't miscarry from the stress.\n\nEdit: I don't know how many people will see this but I want to thank everyone who offered support and shared their stories with me via PM, I'm truly moved. I'm still undecided on what to do moving forward but I I'll try and find someone to talk to. Some more context if anyone's wondering:\n\n*  My husband died by suicide because he was too stressed out about his career. No one really saw it coming.\n*  I don't have any children, or family. My sister is the only one I know and she's on the other coast. I'm 25.\n*  I don't know if I'm going to abort, however *if* I do carry the baby full term, I'd rather take care of it myself and not give it up for adoption.\n*  I'm in New York which has some of the toughest grandparent rights laws which further complicates things. I'm afraid of giving birth then having custody taking away from me.\n*  My financial situation is... okay. I can support my baby and I if I budget down.\n*  My relationship with my in-laws was never friendly. They didn't approve of me and despite trying to warm relations with them they never reciprocated.\n*  Some people are questioning why I'm trying to move on so fast and saying I'm awful for it: The baby is growing and I can't hit pause. I need to make up my mind sooner than later.\n\n  My mind still isn't made up and likely won't be soon. I'll take some time off to think and talk to someone about this situation. Also to the very colorful PM's telling me to kill myself, go fuck yourself. Thank you.\n\n&#x200B;",
        "edited": "1553146682.0",
        "id": "b3blri",
        "is_asshole": 0,
        "num_comments": 1122.0,
        "score": 13924,
        "timestamp": 1553086142.0,
        "title": "AITA for wanting to abort my late husband's baby?",
        "verdict": "no assholes here"
    },
    {
        "body": "My husband and I are having a baby. I'm mixed race, half black and half white. My husband is black. \n\nWe don't know the gender yet but my husband prefers names that most people would call black names for boys. Names like Trayvon, DeVonte, Marquis, etc. \n\nI grew up with a name that is tied to black culture and hated it for most of my life. I go by a shortened form of my name professionally (i.e Dee for Denaisha) because I have seen how people react to my government name. I am sure I have been passed up for jobs because of how people perceive my name. \n\nMy husband has a name more commonly used for white boys (i.e Jake). He wants a strong black name for our son because he never had that and believes that giving him a \"white\" name to avoid racism isn't helping anyone. I don't disagree but don't want to use our son as a test dummy to change that. \n\nThis has become a battle. I know that we both need to agree on a baby name but AITA for writing off all black names?",
        "edited": "False",
        "id": "ck2eaj",
        "is_asshole": 0,
        "num_comments": 1618.0,
        "score": 13225,
        "timestamp": 1564541667.0,
        "title": "AITA for shutting down \"black\" names because I think it'll make life harder on my kids?",
        "verdict": "no assholes here"
    },
    {
        "body": "My wife and I are both Chinese and have 3 kids together.\n\nMy kids have always looked mixed (white + Asian) and it’s only become more apparent as they’ve grown up. Their skin is much fairer, they have freckles (no one in our families does), there is a brown tinge to their hair. Two of my kids have brown eyes, but the youngest clearly has a mix of brown and green (I know mix isn’t the right word, but it’s not solid brown like 99% of Asian). They also have white looking facial features... Especially their eyes and nose.\n\nHonestly once you see it you can’t unsee it and it’s driving me crazy. I want to get a paternity test done behind my wife’s back on the youngest (that looks the most mixed) just for piece of mind.\n\nWIBTA? My wife has done nothing to make me suspect her of being unfaithful. It’s just such a strong resemblance to “mixed” kids that I’ve seen.",
        "edited": "False",
        "id": "buq5b3",
        "is_asshole": 0,
        "num_comments": 2928.0,
        "score": 13214,
        "timestamp": 1559200293.0,
        "title": "WIBTA If I got paternity tests done behind my wife’s back?",
        "verdict": "no assholes here"
    },
    {
        "body": "I’m a woodworker on the side, I made my best friend a wooden American flag because he said he would love one. Only charged him cost of materials and shipping cost around $20. He then asked me to make another flag for a gift for his mom. I still gave it to him for cheap because growing up I was close with his family, but now he asked me to make the same flags for 5 other people in his family and one coworker. Keep in mind I sell these size flags for $150 and he assumed this time it would still be $20 each flag. I promptly told him I can’t do that cost anymore, it was only really a deal for him because he is my best friend and I agreed to it the second time bc it was for his mom but now these are for people I don’t even no. Told him I’m sorry but it’s not gonna happen. He responded “oh, ok...” and it’s been weird ever since, really short. Should I have just done it and not risk ruining our friendship?\n\nUpdate: followed some advice on here and let him know I’m not upset but broke down what all goes into it. Said there aren’t any hard feelings but just wanted him to know why I said what I said. I’ll update with his response.\n\nUpdate #2: He did give an apology of sorts. Said he thought that getting my flags out to different people would help more people see my products which could lead to more revenue. I told him I appreciate that but I currently stay busy enough without it and that I wouldn’t mind giving him 50% off only bc we’re boys but this would be the last time. He said he didn’t mean for it to come across the way it did. Idk I still feel like it isn’t resolved, we’re going out for beers this weekend. Going to get him to understand my side of things.\n\nFinal update: He sent me a random message last night profusely apologizing. Apparently he was talking to his wife and she tore into him and was upset he would do that haha he just sent a PayPal payment for 5 flags at full price. Glad it all worked out, I’m going to make him something customized as a thank you for the business. Thank you all for the advice. ✌🏻",
        "edited": "1555403370.0",
        "id": "bdf4x9",
        "is_asshole": 0,
        "num_comments": 623.0,
        "score": 13182,
        "timestamp": 1555329710.0,
        "title": "AITAH for telling my best friend I wouldn’t make the same gift I made for him for all his family members?",
        "verdict": "no assholes here"
    },
    {
        "body": "We are at a Beef o' Brady's and the family next to us has 2 aged 5 to 7 children. I have 2 children myself 8 and 11. They are on games and YouTube but they are blasting it. My BF says I should just \"stay in my lane\" eat our food and go. I have no intention of being rude to them just asking if they would kind turning the phones down a bit.\n\nUpdate: So I turned to them politely and related having small kiddos needing to be occupied and asked if the volume could just be a bit lower and Dad actually made them get off them and have dinner together. Now they're talking about their pee-wee football and it's adorable. Thanks Reddit! BF was irked with me initially but that's died down now also.",
        "edited": "1554655165.0",
        "id": "bai0gq",
        "is_asshole": 0,
        "num_comments": 441.0,
        "score": 12990,
        "timestamp": 1554654399.0,
        "title": "WIBTA if I asked the family next to us at a restaurant to turn their children's phones down?",
        "verdict": "no assholes here"
    },
    {
        "body": "I'm getting a major surgery done in about three weeks and I was told there's a 60-80% chance it will kill me. It's 60% if I do all the things the surgeon told me to do to prepare for the surgery (take supplements, gain weight fast, lots of protein) and I'm following all the rules. So let's say my chances of dying are 60%. That's not great but not too horrible.\n\nThe thing is that I've had this exact surgery before and I came out just fine so my family has no reason to think this time will be any different (aside from the risk involved with any surgery). However for reasons involving My Medical Condition (TM), this time the surgery is riskier.\n\nMy family consists of my older brother (28M) who I (27M) live with and my mom (54F) who lives on the other side of the country. My brother is very protective of me and my mom still acts like I'm her little boy. The only reasons I could think of to tell them would be:\n\n1. Give them time to prepare for the possibility of my death. BUT I don't think this is something they can prepare for. I'm sure they'd just be miserable for the time leading up to the surgery. I don't want that.\n2. Give us all a chance to make happy memories before the surgery. Again I don't think that can happen when we'd only be doing it because I might die soon. It would feel forced and desperate and they would only be pretending to not be miserable and I'd be unhappy because I would know they're miserable.\n\nI'm leaning towards \"ignorance is bliss\" for everyone involved. If I survive, no harm done and all that potential misery would be for nothing. If I die, well that's a risk of any surgery and their final moments with me wouldn't have had that misery. And with My Medical Condition (TM) it's unlikely I'd make it to retirement age anyway.\n\nBut is it right for me to hide something this big, even if it's to spare them pain? What are your thoughts?\n\nEDIT: The surgery is 100% necessary. I WILL die without it, but it would take maybe a year or so and be very unpleasant.\n\nEdit2: I've already gone over how I'd want my body dealt with the last time I had surgery (donated to science or cremated if science doesn't want it). I have no debts and my brother knows about all my bank accounts.\n\nEdit3: I will write letters to them.\n\nEdit4: Maybe I wasn't very clear about this because a few people have commented about it. I'm not hiding the surgery itself from my family, just how risky it is. They're going to come see me off and we'll say our I love yous and good lucks at the hospital.\n\nEdit5: I already have an advanced medical directive from the last time I had this surgery.\n\nAnd YES I promise to post an update if I survive! You're all very sweet for wishing me well. It turns out Reddit isn't as scary as I feared (I just joined and this is my first post).\n\nEdit6: Thanks to everyone who responded with their thoughts! I honestly don't know what I want anymore. There seems to be no good answer and spending the last 4 hours reading what everyone has said and thinking about my upcoming surgery has left me feeling pretty drained. I'm going to take a break and recharge.\n\nEDIT7: Okay I'm feeling very overwhelmed here. I was only expecting to get 10 comments, maybe 20 at the most. Now there's nearly 400 comments. I wrote this post feeling pretty confident of my decision but I wanted to see if anyone out there had a different perspective, another point of view that I hadn't considered. After reading over 100 of these comments I don't know what I should do anymore. I'm feeling guilty for hiding this but I can't see what the right thing to do is. There probably *isn't* a right thing to do.\n\nSo many of you have shared their stories and experiences with the death of a loved one. I'm truly sorry you had to go through that and I appreciate your perspectives. I'm going to revisit this in the morning and look at this with fresh eyes.\n\nPS: To all the people who are setting reminders for three weeks (a bit morbid but I understand) you should make it for four weeks. If I survive, I'll need time to recover and get out of the ICU before I come back to Reddit.",
        "edited": "1560141218.0",
        "id": "bynopg",
        "is_asshole": 0,
        "num_comments": 2419.0,
        "score": 12810,
        "timestamp": 1560106749.0,
        "title": "AITA for deciding not to tell my family that the surgery I'm getting will probably kill me?",
        "verdict": "no assholes here"
    },
    {
        "body": "For background I am a 22 year old woman from a large Middle Eastern nation. In my culture arranged marriages are quite common amongst the religious population.\n\n&#x200B;\n\nI attend a prestigious private university in one of the most populous cities in our region of the world. My family is very well off as my father is the CEO of one of the most successful holdings in our nation. I am studying engineering and in my faculty there is a man who I will refer to as Ali. Ali is Syrian and sought refuge in our country. He came here with his two young sisters and his mother. His father passed away in the Syrian war. His family currently lives in a small single bedroom apartment and are supported by my countries government aid. He has a sponsor so he can attend my University.\n\n&#x200B;\n\nAli and I are both studying Civil Engineering. I have been in love with him since grade 1 of University. The problem is he has deep feelings for a Syrian girl who also ran away to my country. She doesn't want to be with him as far as I know. Since we are nearing graduation, I want to tell him that if he lets her go and chooses to start a relationship with me then him and his family would be financially secure for life. I want to propose this idea to him and his mother. I am not technically persuading him to marry me, but if he does he would be saving his family from ever having to go back to Syria. And he would know this. AITA for making this offer?\n\nEdit: for everyone begging to know my nationality, I won’t reveal this however I will say that I am NOT Arab.\n\nEDIT 2: Believe it or not I read every single response (admittedly skimmed through most). I made my decision though. I'm going to talk it out with my father. Either way whatever ends up happening I will post an update. Thanks everyone!",
        "edited": "1561266537.0",
        "id": "c3jdqi",
        "is_asshole": 0,
        "num_comments": 2084.0,
        "score": 12623,
        "timestamp": 1561166419.0,
        "title": "AITA For Bribing a Guy into an Arranged Marriage?",
        "verdict": "no assholes here"
    },
    {
        "body": "One of my cousins, Peter just had a baby with his girlfriend a few days ago. Peter and all his siblings all have very stunning blue eyes which they inherited from their mom. They always get compliments on their eyes. Peter and his girlfriend posted a picture on social media of their baby girl today saying she was born on the 23rd and I decided to give Peter a call to congratulate him. When I called he was with his girlfriend and the phone was on speaker. I congratulated both of them and said their baby was gorgeous and that they’ll be great parents. I then asked Peter “did she get your blue eyes?” (in the picture they posted on social media the eye color wasn’t visible) Peter and his girlfriend’s tone completely changed and his girlfriend said “Jesus, why are you so concerned by the eye color of my baby. It’s fucking weird” I was pretty taken aback by her reaction. I didn’t mean anything by it I was just curious. I thought this was a normal conversation point. I tried to say I didn’t mean to offend her and apologize but she kinda cut me off and said they were really busy and they had to go.\n\nI told my mom what happened and she said that Peter’s girlfriend is a new mom and is probably just emotional and thought I was insulting her baby but that I didn’t say anything wrong. However my sister said I was out of line and that the fascination people have with blue eyes is weird and there were racial implications since Peter’s girlfriend is biracial (half Jamaican). This didn’t make sense to me. I never said not having blue eyes was bad. My eyes are brown! I was just curious!\n\nAITA here?\n\n\nAnd he said the baby’s eyes are grey.",
        "edited": "1572096498.0",
        "id": "dn6rw9",
        "is_asshole": 0,
        "num_comments": 1497.0,
        "score": 12279,
        "timestamp": 1572051378.0,
        "title": "AITA for asking my friends if their daughter has blue eyes?",
        "verdict": "no assholes here"
    },
    {
        "body": "At a unit meeting the other day, my boss introduced two new hires, recent graduates who are training to become account managers. My boss told them that I am one of the top account managers in our unit and asked me what advice I can give the new hires on how to succeed at this job.\n\nI said that our job is 30% work and 70% luck, sometimes you get big deals with minimal effort and sometimes you give it everything you have but the deal still doesn’t push through. But what’s important is to have good relationships with your co-workers because work is much easier when you have a positive work environment.\n\nAfter the meeting my boss talked to me and he was not happy about the advice I gave. He said that he wanted the new hires to see me as a role model but instead I embarrassed him by encouraging them to be complacent since I said that 70% of the job is luck. He said that I know the advice I should give them is to set goals and work hard to achieve them as their careers are just beginning but I went with trying to sound cool instead of giving them the best advice.\n\nI specifically avoided telling the new hires that they should work hard because I don’t work hard myself and everyone else in the room knows that. I’m not humble bragging. I was always an average employee, I just got lucky these past three years because even without asking my clients brought me their friends who also ended up doing business with me so the deals basically just fell into my lap. But even now I have a lot of lazy days where I procrastinate or I go on sudden leaves just because I don’t feel like working.\n\nI didn’t want to be that person who doesn’t practice what she preaches, but should I have told them what they needed to hear instead of what I really wanted to say?\n\nEdit: Wow this blew up.\n\nThank you to everyone who is worried that I might get fired or I won't be promoted because of what I said, thankfully promotions in our company depend on your performance. We have guaranteed merit increases as long as we meet their our budgets, and if you go over your budget you get a bigger increase. Unless I do something against company policies or I don't meet my budget for three straight years my boss also can't recommend my termination. Even then it's not my immediate boss who decides if I get fired, so I think I'm pretty safe.\n\nI still believe that a big part of my achievements in the past three years is down to luck. I didn't do anything different than what I did the past five years. I was nice and accommodating to my clients before but they didn't refer any deals or the ones they did did not push through. I don't know what changed these last three years. But the reality is that the clients came to me and from there I just had to type some templated proposals.\n\nIn contrast I have coworkers who bust their ass marketing new clients on their own, they have good relationships with their existing clients but do not get referrals, or they make somersaults to sort out terms and conditions to make a deal happen but the client suddenly says he doesn't need the deal anymore. That's why I think that I've been lucky and I know this luck is not gonna last forever.\n\nBut I see your point that maybe I shouldn't have said what I did at a formal meeting like that in front of my boss.",
        "edited": "1573773779.0",
        "id": "dw9ciw",
        "is_asshole": 0,
        "num_comments": 769.0,
        "score": 12228,
        "timestamp": 1573737087.0,
        "title": "AITA? My boss asked me to give advice to new hires on how to excel at work, I said our job is 30% work and 70% luck.",
        "verdict": "no assholes here"
    },
    {
        "body": "Im a 36 year old man with acute myeloid leukemia. The initial chemo put it into remission, but its now come back and its not stopping. \n\nI have been on my second run of chemo for two years, and there has been little to no improvement. Just delaying the inevitable. Most people with leukemia die after 5 years. Mine is even worse.\n\nI feel sick everyday. I used to lift regularly and now all my muscles are basically gone with excess grandma skin on my arms and legs.\n\nI lost so much hair at the top of my head i just started shaving it off.\n\nI cant have sex with my wife anymore, when i try i cant maintain erections. I have pissed myself multiple times over the years in my sleep. I cant eat steaks anymore because of my stomach.\n\nI cant play with my daughters and everytime i go to one of their soccer matches i get weird looks and take all the attention off of them.\n\nI just dont have any fight left anymore. I repeat to myself everyday, \"its over, and thats ok\".\n\nThe truth is i haven't accomplished much in my life. I wanted to be a writer when i was younger but i ended up as an office manager at a car dealership. I always said i would do it later but then the years sort of piled on. I had one life and i wasted it, but so do most people i guess.\n\nI am proud of my wife and daughters. They make me very happy. They haven't accepted that its over yet but i have. My wife means well but she wants me to stay in treatment long enough to put it back into remission again. I dont see it. I just think we need to come to terms with this.\n\nI do not just want to lay in bed all day. I want to travel for these years i have left. See the country. Maybe go to italy or japan or the uk. I want to experience this planet in ways i never thought about before.\n\nI told my wife this and she says im being selfish and im giving up. I dont see it that way, i feel more alive now than ive felt in a long time. I feel like i have no fear of trying scary things or writing a book or travelling to a jungle.\n\nIve spent so many years wasted. She says she wont stick by me if i do this. AITA?",
        "edited": "False",
        "id": "ak82eh",
        "is_asshole": 0,
        "num_comments": 950.0,
        "score": 12042,
        "timestamp": 1548557078.0,
        "title": "AITA For telling my wife and family I have accepted my fate and will not have any more chemo and that I want to travel instead?",
        "verdict": "no assholes here"
    },
    {
        "body": "I went to Applebee’s with a friend and noticed a promotion on the menu where you get your food free if it doesn’t come out in 10 minutes or less. I thought that this was a bold claim and decided to put it to the test. After the waitress took our order, I put a timer on my phone and put it in front of me on the table. It felt weird to do it, but I wanted to have some sort of proof so that they didn’t think I was trying to scam them. Sure enough, 18 minutes passed before we got our food. I showed the waitress my timer and she apologized and said that she’d waive the bill. After we finished, I made sure to tip double of what it would’ve been without the promotion. AITA? And how would you deal with a promotion like this?\n\nEdit: I actually found the ad online. Turns out it was 12 minutes or less. Doesn't really change anything, but figured I'd still mention it.",
        "edited": "1564365146.0",
        "id": "cj2z39",
        "is_asshole": 0,
        "num_comments": 1023.0,
        "score": 11886,
        "timestamp": 1564355734.0,
        "title": "AITA for setting a timer next to me when I was being served at Applebee’s?",
        "verdict": "no assholes here"
    },
    {
        "body": "My brother is 18 and living with me. I am his older sister, age 22. I have 2 bedrooms (one each for me and him) and a shared bathroom. My brother has a girlfriend, also 18, who is over a lot. They are fully consenting adults, therefore they do things that I don't want to think about.\n\nThey always shower/bathe together, and because the bathroom shares a wall with my bedroom and the kitchen, no matter where I go in the flat I hear exactly what they're doing. Then the shower stops running and my brother leaves, and exactly 10 minutes later, often to the exact second, the girlfriend leaves. She spends the 10 minute interim playing games on her phone.\n\nThe reason for this is that she doesn't want me to see them leave the bathroom together. She is unaware of the sound issue and thinks that I have no idea they even entered the bathroom together, and hopes that 10 minutes will be enough for me to believe that my brother had his shower and left and then she entered and had hers separately.\n\nHowever, this 10 minute pause between them finishing in the bathroom and her leaving the bathroom is a real pain in the arse. They always do this either early in the morning when I need to shower and leave for work, or right at the end of the night when I need to do my nighttime routine before bed.\n\nWIBTA if I said to her \"look, I know what you're doing in there, I don't have a problem with it as you're fully consenting adults, but the time you wait between him leaving and you leaving is a real pain, so can you just leave together, or at least shorten the time?\"",
        "edited": "False",
        "id": "eu6ik3",
        "is_asshole": 0,
        "num_comments": 556.0,
        "score": 11694,
        "timestamp": 1580044264.0,
        "title": "WIBTA if I told my brother's girlfriend that I know what they're doing in the bathroom and I need her to hurry it up?",
        "verdict": "no assholes here"
    },
    {
        "body": "Hi. Made a new throwaway account to post this because I am... wildly conflicted right now.\n\n**Backstory:** My sister (4 years younger than me) and her husband have been married \\~2yr, together for 5. BIL and I dated during high school, and it ended under circumstances that were not ideal. BIL and I have not gotten along since he and sister got together. My sister essentially believes I'm jealous of her for marrying my \"one who got away\" (he is not that), so our relationship has ALSO suffered as a result. This whole situation is already fucked up and yes, I'm pretty sure it's putting my therapist's kid through college, but that's not the problem right now.\n\nRecently BIL has begun reaching out to me more frequently. I've been very cautious but after talking it over with people in my own life, chose to be more friendly toward him as part of an attempt at repairing certain aspects of my relationship with the entire family. Last week BIL asked if I would read a book he had written, with the underlying implication that I would help him career-wise with his aspirations as a writer. Out of politeness and curiosity, I said sure, thinking I would perhaps get a good laugh out of it and a story to tell my publishing friends.\n\nThe book... is about us. I don't know how else to put it. It's a \"domestic thriller\" (so think *Gone Girl, You,* etc.) about a man who realizes he has married \"the wrong sister\" and becomes obsessed with his SIL. It's one of the weirdest things I have ever seen. It doesn't exactly read like a manifesto, more like something you'd see on r/menwritingwomen, but aspects of the story were deeply unsettling to me personally (touching on things that happened to me in high school and later), and I don't understand why he would give this to me to read unless he wanted to either creep me out, or - as in the story - he intends to leave my sister and wanted to see if this would... Jesus, it's too weird to say. Open a door with me?\n\nHere's how I'm conflicted. People have always used art as a form of cathartic healing. If a stranger handed me this book, I would just say \"not my taste\" and move on. That said, this is my sister's husband, and I found certain elements so skin-crawlingly uncomfortable that I almost didn't finish it. That ALSO said, this is my sister's husband, and I am afraid, based on the past, that if I tell her about this, she will flip out on me and not him, and/or if she confronts him, he will also just lie about the whole thing? And on the off-chance that it's more than just tasteless catharsis, I don't want my sister to get turned into a skin suit? (There are no skin suits but you get it.) And if it IS just a fictional fantasy thriller, I'll either look like a paranoid asshole or the lawmakers who tried to ban video games after Columbine.\n\n**TLDR: My BIL and I dated in high school and he wrote a really creepy novel about being obsessed with me and I don't know whether to tell my sister for the shitstorm it could cause.**\n\n**EDIT: Whew. Went to dinner and came back to a lot more replies than when I left. I'm figuring out a way to move forward right now. Thanks to everyone who has commented, I've read them all.**",
        "edited": "1557274944.0",
        "id": "blvl17",
        "is_asshole": 0,
        "num_comments": 815.0,
        "score": 11647,
        "timestamp": 1557260088.0,
        "title": "WIBTA for telling my sister about her husband's creepy AF novel about me?",
        "verdict": "no assholes here"
    },
    {
        "body": "So I (26m) don’t like kids, I never have, and was always adamant that I would never have kids.  So much so that when I was 22 I wanted to get a vasectomy.  The doctor told me to wait and think it over since I was so young, but I eventually got one when I was 24.  It went well, and test results at the time showed I had no sperm count. \n\nMy girlfriend of three years also said she never wanted kids (wanting kids would be a dealbreaker for me) and I thought that was it and we’d be child free.  Well a last week she found out she was pregnant and we were both in shock.  Between my vasectomy and her being on birth control (for non-pregnancy related reasons) the odds of her getting pregnant should be astronomically low.  We couldn’t believe she was pregnant, and my gf assured me she didn’t cheat and was willing to take a dna test to prove it (if that’s possible at this stage) and I believe her.  I also went back to the doctor to get a sperm count, and somehow a small amount of sperm were present and there would be a small chance I could get someone pregnant.  \n\nNow I don’t want the kid, and was under the assumption she didn’t either.  She says she assumed she would get an abortion if she was pregnant, but actually being pregnant is different and she’s having second thoughts.  While I strongly want her to get an abortion, I realize that it’s ultimately her choice, but I told her that if she does go through with the pregnancy (and doesn’t adopt it), I want nothing to do with it.  I’d do whatever I legally have to do in terms of child support, but I won’t be involved with raising the kid.  Also our relationship would effectively be over because I don’t want to be with someone who has a kid.  My friends and brother think I’m a complete asshole and that I should suck it up if she chooses to have the kid.  I think I took reasonable, if not extreme precautions to ensure I never had to worry about a kid and that I shouldn’t have to raise a kid I don’t want as long as I fulfill my legal obligations.  So reddit, AITA for not wanting to raise my kid?\n\nEdit: to all the people saying the kid isn’t mine, she offered (unprompted) to take a dna test.  Along with my sperm test results and having no reason to suspect she’d cheat, I fully expect that the child would be mine.\n\nEdit 2: thank you to everyone who has responded.  After further discussion with my gf, she is set on having the baby and is slightly against adoption, but considering it.  She still wants me to be in her life, even if our relationship is over and it’s just as friends.  If she has the baby, I’d treat it the same as I do my friends kids; I’d be friendly towards them but have no interest in raising them, just with the addition of child support. We are planning to get a dna test done as well.",
        "edited": "1576862169.0",
        "id": "ed1aij",
        "is_asshole": 0,
        "num_comments": 3147.0,
        "score": 11535,
        "timestamp": 1576797570.0,
        "title": "AITA for telling my gf I want nothing to do with our (potential) kid",
        "verdict": "no assholes here"
    },
    {
        "body": "My gf since June just “came out” to me as aesexual.   I knew the term and honestly never thought about how their lives are.  I guess I just figured they lived alone.  \n\n\nMy gf however just told me that she was aesexual.  I asked her about our sex and she said she had been faking it.  That she didn’t want to lose me. \n\nI feel so gross.  We have had sex a lot.   If she didn’t enjoy that, it’s just idk wrong.  \n\nShe cried when I said I don’t think I can have a relationship without sex.   Like sobbed.   She said that’s why she never told me. \n\nI asked her how she saw our relationship progressing.  She was really adamant that we could make it work.  That we could even have kids.   But as far as sex I could just get sex toys. \n\nA relationship with her on her terms really just sounds like friends with a kid.   I already have friends.   I don’t want to have a kid with them.   \n\nShe’s super emotional right now, I don’t know how to deal with it honestly.  Her friendship relationship doesn’t work for me. ",
        "edited": "False",
        "id": "audl4e",
        "is_asshole": 0,
        "num_comments": 1660.0,
        "score": 11392,
        "timestamp": 1551048030.0,
        "title": "AITA for not even wanting to try an aesexual relationship?",
        "verdict": "no assholes here"
    },
    {
        "body": "I made the terrible mistake of watching a medical drama with my pregnant wife. We’ve been binging House M.D. and of course there’s a pregnancy complication episode where a dad is asked to choose between the baby and the mother (the mother was going to die either way it was just a little quicker). My wife said that she’d want me to choose the baby if it came to that. I told her there was no fucking way I would do that, we could have another baby but I could never have another her. She got all mad and questioned my commitment to being a father and I said I’m committed to being a father but I’m more committed to being a husband. This argument went on forever.  I told her that if she was brain dead or was going to die either way I would choose the baby but otherwise it’s her She said basically said what she wants over and over and I said I’m not spending another 50 or years without her. This is all because I love her more than anything else in the world. We’re still in disagreement over this completely hypothetical situation. Before anyone asks: yes it has occurred to me I can just lie because chances are this will never happen but it just feels wrong to lie about it.\n\nAITA?",
        "edited": "False",
        "id": "b94gx3",
        "is_asshole": 0,
        "num_comments": 1421.0,
        "score": 11183,
        "timestamp": 1554329444.0,
        "title": "AITA for telling my pregnant wife that there is pretty much not a single circumstance where I would choose saving the baby over saving her?",
        "verdict": "no assholes here"
    },
    {
        "body": "I have a 11 month old baby. Super awesome little dude. I also have a 10 year old daughter from a previous marriage. I raised her as a single dad from 18 months to the present. \n\nI've been very careful to not tell my wife how to do things or how I did them in the past because she's excited to have the  experience of a baby and she's expressed things like \"you've done this before. This is my only chance to have a baby.\" (I got the snipsnip shortly after he was born). Basically I don't want to Dadsplain parenting. \n\nThis has led to things that I personally think are potentially problematic (ie she won't do cry it out even though the doc said it's time) BUT I'm happy to let her have her way so long as lil dude is healthy and safe. (Yes we've talked about it and she knows where I stand on it. That's not what I'm worried about being an asshole about) \n\nSo the other day, I'm putting his shoes on and she tells me, \"be sure they're on the right feet.\" Or while giving him a bath \"be sure to clean his diaper area well.\" \n\nDUUUUUUUUUDE. I KNOOOOOOOOOOW.\n\n\nAnd it's been like that since the beginning. \"you've got to support his head.\" \" You swaddle him too tight\" ( I didnt. That shit's supposed to make then immobile).\n\nLike I said. I want her to enjoy the ride. But I kept a kid alive for a decade almost entirely by myself. I don't need to be told how to put a pair of shoes on a baby or any other obvious shit. \n\nWould I be the asshole if I told her \"you know I know what I'm doing, right?\"",
        "edited": "False",
        "id": "ccag0t",
        "is_asshole": 0,
        "num_comments": 1057.0,
        "score": 11041,
        "timestamp": 1562935850.0,
        "title": "WIBTA if I told my wife I know what I'm doing when it comes to our baby?",
        "verdict": "no assholes here"
    },
    {
        "body": "My daughter (15) is 5'6 and the last time she weighed herself at the doctor's office she was at 238lbs. She is morbidly obese.\n\nShe was always a chubby kid who loved food and hated activity no matter how much her dad and I tried to get her to dance, play sports, go on walks with our dog etc. she would refuse. I regret not taking her to a nutritionist earlier, but I thought that she would go into puberty and her weight would eventually be okay. Unfortunately, when she was 11 her dad and I decided to get a divorce. No special reason, it just wasn't working. We coparent well, we're friendly, we go on trips with out daughter etc., but the divorce impacted her negatively at first. \n\nShe started gaining a lot of weight around that time so we decided to take her to a nutritionist who recommended therapy for her. She initially lost about 15lbs but she was already very dependent on food. Now, she's a food addict. Her emotional eating was something she used to cope with the divorce until she adjusted, but now it's all about compensating for not having friends, compensating for not being ''pretty'', compensating for not being liked by boys etc. \n\nShe still goes to therapy regularly, she doesn't suffer from depression or another health condition that might cause her weight gain, she is simply addicted to food and at her vulnerable age, mentioning her weight to her makes her very upset and uncomfortable. Her dad and I both know this and it's been causing arguments between us. I'm a very active, fit person and I try to lead by example - no junk food allowed in the house, I cook as much as I can or I get healthy meal delivery - and this makes me the bad guy.\n\nShe's into the whole body acceptance movement and she sold the story to her dad who now allows her to raid his pantry and they eat junk together just so he wouldn't upset her because she's daddy's little girl. He's happy that he gets to be the good guy and I'm the villain who doesn't want her daughter to settle because I want her to live past 35. I encourage her to love herself, I want her to embrace how amazing she is but I don't want her to accept her condition as something normal that can't be changed. I'm tired seeing how miserable she is because of her weight and I'm tired of thinking about all the diseases that could kill her. \n\nI found a great weight management treatment facility (*\n\nAITA?\n\n__EDIT:__ Lots of repetitive question and comments. Please look through my comment history, thank you.\n\n__EDIT2:__ Again, I've explained everything about this treatment facility, her current therapy and approach to her eating disorder, the fact that the choice is ultimately hers, yes we do have a dog and no she doesn't want to walk him, no this isn't a quick fix, no I don't think my daughter hates me.\n\n__EDIT3:__ I sound like a broken record, put please read through my comments before asking the same things over and over! There's a word limit here and obviously not everything fits in the post. The facility does have therapists, specialists, doctors and all types of health professionals. They do have ED programs that she would be a part of and she would be in touch with her current therapist because she has a hard time opening up to new people, so that would help her. I double and triple checked everything and talked to so many parents and employees, but it's ultimately her choice. My fear is that her dad will cloud her judgment by bribing her with food.\n\n__EDIT4:__ Thank you guys for all of your responses. I've received a lot of great advice, your own experience with ED, personal stories, support and empathy. I appreciate all of it. I'll no longer be replying to comments because I find myself trying too hard to reach people who are twisting my words and using them against me. Maybe I'll post an update within the next few weeks when something happens, but things definitely will change around here. Again, thank you all!",
        "edited": "1574033476.0",
        "id": "dxprju",
        "is_asshole": 0,
        "num_comments": 1631.0,
        "score": 10923,
        "timestamp": 1574013008.0,
        "title": "AITA for wanting to send my teen daughter to a weight loss camp?",
        "verdict": "no assholes here"
    },
    {
        "body": "I know this might be a very trivial issue for some people, but please hear me out. Also, I'm French, so my English is average at best.\n\nWe lost our 14 yo daughter to cancer( I don't want to discuss that here ) a couple of years ago. These two years have been very difficult for us. Though I've learned to cope up, nothing can ever replace her. \n\nMy wife attended a support group, where she ended up befriending another woman, whose 11yo daughter had the same cancer our daughter had and they became close friends. Her daughter survived. We are really happy for her. She and her daughter visit us sometimes. \n\nLast time, when her daughter was here, she came across my daughter's custom made neclace which I made for her( I'm a jewellery designer by profession ). She saw it in a small room in which we made a small memorial for our daughter. It has her pictures, belongings and all her favourite things. She really liked it and asked my wife about it. \n\nNow, after they left, my wife asked me if I can make the same one for the girl. My wife told me that the girl really liked the neclace and asked if she could have one. I told her that it was something I made for my daughter and I don't want to share that or make it for anyone. No one can replace her. My wife thinks that our daughter would be really happy if we shared her memory with someone who had similar struggles and that I'm being selfish. AITA here?",
        "edited": "False",
        "id": "bhn104",
        "is_asshole": 0,
        "num_comments": 598.0,
        "score": 10722,
        "timestamp": 1556289539.0,
        "title": "AITA for telling my wife that I can't make the same custom made jewellery which I made for my daughter when she was alive, for another girl who survived the same illness?",
        "verdict": "no assholes here"
    },
    {
        "body": "I’ve known my husband is gay for several years now. At the very least he’s a gay-leaning bi-man. Our sex life has deteriorated consistently over the course of our marriage, and a few years ago I found his stash of gay porn on his work laptop (wasn’t snooping, it as on accident).\n\nThe thing is, I actually enjoy my marriage. My husband is kind and considerate. We have three beautiful kids (9, 12, 14). He makes a lot of money and takes care of us well, while I am a home maker and enjoy taking care of him.\n\nSo I’ve just kept quiet and let him keep it to himself. I don’t want to bring up in case he decides to leave or it implodes the family. I don’t want my kids to have to go through that, at least until they’re older.\n\nSo I’ve just kept quiet and let my husband stay in the closet, enjoying the fantasy/porn in his private time.\n\nAITA?",
        "edited": "False",
        "id": "bnoncj",
        "is_asshole": 0,
        "num_comments": 1443.0,
        "score": 10588,
        "timestamp": 1557665738.0,
        "title": "AITA not telling husband I know he’s gay",
        "verdict": "no assholes here"
    }
]