[
    {
        "body": "I am a high schooler with a weekend job at a coffee shop. My coworkers who work weekends are: \n\nJames - the owners son, he goes to my school. He's a shift manager but it's not a real formal thing, he's a friendly guy.\n\nDanielle - A college student who sometimes works weekends too.\n\nSo sometimes customers will come in and just be angry about such little stuff. Like literally blow up about nothing. I dunno if theyre in a bad mood already and looking for someone to take it out on or what, but it's a lot... Like how sad so your have to be to be a grown-ass man taking your anger out on high school and college kids.\n\nSo James and I were joking about having a little fun with them and hopefully getting them off our backs.\n\nSo one day I was at work and some guy was having a temper about how we don't make the coffee hot enough... Which I couldn't do a thing about because I gave it to him right out of the machine.\n\nSo James came in and was like \"sir is there a problem here\" and the guy started ranting at him too. So he was just like \"OP, this is unacceptable, you're fired.\" \n\nI started acting real sad, like \"no please don't fire me, my family needs the money, I need this job, pleaseeee\" and he played up being a hard-ass, telling me to take off my apron and leave.\n\nThe angry guy started to backtrack, like \"It isn't that big of a problem, you don't need to fire her over it. I didn't mean it\" and James was like \"No, we pride ourselves on the best customer service\"\n\nOf course after all that drama I still had my job, we were just acting. And we've done it a couple times, whenever a customer will lose their temper at Danielle or I, James will storm in and \"fire\" us. And almost every time, the person who had come in angry will apologise and say that they didn't mean it. It's kind of satisfying, making people realize their actions might actually have consequences. \n\nAnyway, I was telling my friends from school about this and a few of them thought it was a mean prank, to let someone go away thinking they'd gotten someone who desperately needs the money fired.\n\nAITA for this joke?",
        "edited": "False",
        "id": "e5k3z2",
        "is_asshole": 0,
        "num_comments": 3628.0,
        "score": 59187,
        "timestamp": 1575392873.0,
        "title": "AITA for pretending to get fired when customers get a temper with me?",
        "verdict": "not the asshole"
    },
    {
        "body": "Dad here, old fart, loves his daughter to pieces but I’m struggling to see eye to eye with my teenager and wife on this one. \n\nWe’ve always been a meat eating family, we live in the rural Midwest and bacon for breakfast is pretty much a given. This year my 14 y/o daughter decided to go vegan, and I jumped onto her support team with enthusiasm. We learned how to substitute ingredients, cook new things, try new things, I adjusted our budget to include more expensive vegan substitutes for her, etc. \n\nNone of this has been a problem for me until recently. She saw me cook bacon in a pan, and then I rinsed it out to load in the dishwasher. She exploded in anger (teen years, I’m not too fussed about the anger explosion, I know she doesn’t mean it) and said that that was HER pan for vegan food. I was completely floored and said, kiddo this here is a family pan, older than you, it’s not YOUR pan. \n\nShe asked me to purchase her a pan that she can solely use for vegan food. I didn’t want her to feel weird about food, so I said sure, and ordered her a few colored ones that are only for her. The reason they’re colored is so it helps me remember that I’m not to touch them unless I’m cooking vegan. \n\nThat wasn’t good enough. Now apparently the dishwasher is ‘contaminated’ with animal product, and the fridge has ‘bacon grease fingers’ on it (because I eat bacon and then touch the fridge) and she’s asked me and her mom to completely stop eating meat at home. I don’t mean I literally touch the fridge with greasy bacon hands, because I wash my hands, but it’s clearly enough that it upsets my daughter. \n\nfrankly I’m on team hell no, her mom is much more amenable and strongly wants me to consider taking our daughter up on the request. My wife’s reasoning is that both our parents live close so we can eat meat products there, and that she doesn’t want our daughter to feel uncomfortable in the kitchen. My daughter says she is fine with cheese and butter in the fridge, but it’s specifically meat products that make her feel sick. Now I’m sorry for her, but I feel like she just needs to adapt and live side by side, because I’m not going to stop eating bacon in my own house.",
        "edited": "False",
        "id": "dkqv29",
        "is_asshole": 0,
        "num_comments": 7700.0,
        "score": 50676,
        "timestamp": 1571609951.0,
        "title": "WIBTA for refusing to stop cooking bacon in my kitchen due to my teenage daughters vegan lifestyle?",
        "verdict": "not the asshole"
    },
    {
        "body": "So it was my birthday couple months ago. Had a party. Got some gifts. My friend “Mandy” for me a “super cute bikini”. I liked it. Said thanks. She had ripped the tags off but whatever. \n\nAnyway. Went to the community pool with my roommate. Wore bikini. Got in the water. Roommate immediately is like uhm girl.... I look and see that this bikini is now kinda see thru. \n\nHaha good joke Mandy. \n\nAnyway, Mandy invited me over to her place to hang out with her and her bf and a few others. Most leave and we’re still hanging out. I’m like hey, what if we get in your hot tub? I go change after them. And meet her bf in the hot tub she’s getting new drinks. I hop in. Immediately, he’s looking at my chest. I pretend I don’t notice and just make small talk. She comes out a few min after. And just looks in shock. Eventually gets in. “Uhh is that the one I bought?” Yeah I love it. I wear it everywhere. Make up some stuff about how I wore it to the beach, some party with lots of guys, etc. and she’s just like “oh”. \n\nWe’re in the tub for 20-30. Eventually get out and change. She approached me after and was like. “Uhm I’m sorry thought you’d notice. But it goes kinda see thru”. I’m like yeah I know why’d you buy me a ducking see thru bathing suit? “She’s like it’s a joke. Wait you knew? So you just spent last 30’ flashing my bf on purpose?” I reply I’m just wearing my birthday gift from her. \n\n\nAnyway. Aita?",
        "edited": "False",
        "id": "d7yuot",
        "is_asshole": 0,
        "num_comments": 4130.0,
        "score": 50523,
        "timestamp": 1569197811.0,
        "title": "Aita for wearing the “joke” bikini my friend got me?",
        "verdict": "not the asshole"
    },
    {
        "body": "So my son had a long-distance gf recently for about two years. She was great, a really nice girl and we all loved her welcomed her with open arms. She was flying here constantly to visit him, like a weekend a month and he didn’t lift a finger to go visit her. \n\nI tried talking to him about it several times and told him he should really start looking into flying over to her instead of expecting her to do all the travelling. He said no. And my wife probably had something to do with it as she constantly told him she was afraid of him flying. I spoke to them both and said this girl is great for him, she was willing to move over to our country too, but said there was one condition and that was he’d have to fly over to her country too. Which is fair enough. \n\nHe said no, he didn’t want to fly or travel anywhere. My son was becoming lazier and lazier, eventually telling his gf and us that he was perfectly fine never travelling anywhere including holidays etc. \n\nLast week, he told us she’s dumped him. I went on her fb page as we’re all still friends (she wrote us an apology letter about how she’s upset it didn’t work out but these things happen, so we’re on good terms) and looks like she’s with a new guy already. Me and my wife have no doubt she was seeing him whilst still in a relationship with my son. \n\nI confessed to them both that I actually agree with her decision and he should have expected it. He did not treat her properly and I hope he learns lessons for the next one because he needs to make more of an effort. I said he deserves it for his lack of effort in the relationship and for essentially just allowing this girl to spend all her money and time coming here all the time. \n\nWife and son are very upset that I said this. Very very upset and my wife says I am being horrible. \n\nAITA? I stand by what I said.",
        "edited": "False",
        "id": "daglhs",
        "is_asshole": 0,
        "num_comments": 4083.0,
        "score": 47324,
        "timestamp": 1569680504.0,
        "title": "AITA for telling my son he deserved his gf breaking up with him?",
        "verdict": "not the asshole"
    },
    {
        "body": "New to reddit, please bare with. \n\nSo I (21, guy) live with my childhood best friend (22, also a guy) and have done for 2 years now. Up until last week, things were perfect between us. \n\nHowever, he recently got a new girlfriend (23, lady) and she honestly seems absolutely great except for one thing; she seemingly has a complete aversion to knocking. She and I have quite a lot in common, and I actually like spending time with her. However it bugs the hell out of me when she just barges into my room without knocking first. Now, she's never walked in on me doing anything untoward; I'm usually just chilling on my bed or studying at my desk. However, on at least seven seperate occasions now she's done it first thing in the morning to ask if I want coffee. I sleep naked. Every time prior to the last one, I've been under the covers and she hasn't seen anything. I always point out that she *could* have and she just giggles and says \"but I didn't\". \n\nWhen she stayed over last week, in order to make my point, I intentionally slept on top of the covers. Sure enough, she barges in at 7AM, begins to ask if I want coffee and sees my you-know-what. She immediately backed out of the room and didn't speak to me for the rest of the day. My mate later pulled me aside and said I was bang out of order, accused me of deliberately exposing myself and pointed out that I'd \"threatened\" to do it before (I literally just said \"okay but what if I had no covers and you saw everything\" before). They're now framing this to others that I'm some sick creep who intentionally got naked and lay in wait of her because that's how I get my rocks off, and I'm kinda seeing how it came off that way. AITA for doing this?",
        "edited": "False",
        "id": "d10cpy",
        "is_asshole": 0,
        "num_comments": 6263.0,
        "score": 47219,
        "timestamp": 1567884099.0,
        "title": "AITA for sleeping naked on top of the covers to teach my flatmate's gf a lesson?",
        "verdict": "not the asshole"
    },
    {
        "body": "The title makes me sound horrible but hear me out.\n\n&#x200B;\n\nMy sister is severely autistic. She requires attention almost 24/7 and cannot be left alone. She is non-verbal and cannot take care of herself at all. Despite the fact that she is only 12 she is extremely destructive and violent and destroys anything she gets her hands on.\n\n&#x200B;\n\nI hate her. That should be wrong to say but it doesn't feel like it.\n\n&#x200B;\n\nI was only 6 years old when she was born and since then i've never solely had my parents attention. Even since I can remember the world has revolved around her. I was moved out of my room into the basement at 7 because she needed to be in the room next to my parents. All of my toys as a child were destroyed by her and my parents simply ignored me when I complained. Even when I was 14 and she destroyed a mac my school gave me I was in the wrong.\n\n&#x200B;\n\nAlong with this I am expected to take care of her and drop everything I do for her. I can never make plans with friend because my parents \"expect\" me to be there if they need me to take care of her. Even when I do somehow get time to myself I am required to leave if they need me. If i do not then I am punished. The recent example of this is when I went to see the new spider man movie, and was \"grounded\" because i turned my phone off in the theater.\n\n&#x200B;\n\nIt seems as if I am nothing more than a slave to them and anything involving her simply overshadows me. This last week I was chosen to give a speech at a school event. I was so exited and my parents promised to be there, but they never showed and claimed it was because of my sister. Anytime anything like this happens for me they are to busy with her.\n\n&#x200B;\n\nI've held this in for so long and it finally spilled out today. While talking about colleges with my father, he joked that I should get a degree that pays well so when their gone I can take care of my sister. I don't know why but this caused me to break down. I cried and screamed about how it always about her. I'm nothing more than a caretaker to them, that they always make it about her and that I'm expected to be her \"slave\" for the rest of my life.\n\n&#x200B;\n\nI've locked myself in my room since then and my parents have not come to check on me. Am i the asshole here?\n\n&#x200B;\n\nEdit/Update kinda:\n\nWow, thank you for all the support and love that you guys have given me. I never expected this post to reach the popularity it did. Thank you all. After thinking about it for these past hours, you are right that I don't despise my sister. It's not her fault that she was born the way she is. My parents came to talk to me a while after my break down but I was unable to bring myself to talk to them and only cried and asked them to leave. They have made arrangements with my grandfather for me to stay with him for the time being and am getting ready to go to his house. My parents want to talk to me but we have decided it's best I leave for now to have some space and time to collect myself. we will be sitting down and talking later this week about this issue. Thank you all again for the love and support through this <3\n\n&#x200B;\n\nI'll send an update your guy's way later this week if people are interested. ",
        "edited": "1551674503.0",
        "id": "awyi8k",
        "is_asshole": 0,
        "num_comments": 2754.0,
        "score": 46792,
        "timestamp": 1551646782.0,
        "title": "AITA for despising my mentally handicap sister?",
        "verdict": "not the asshole"
    },
    {
        "body": "I recently won a ‘fuck you’ amount of money. I won’t say exactly how much but it’s in the millions. It makes me feel funny even typing It’s enough to change the life of myself and my family. \n\nMy ex wife is the mother of my 2 kids. She is an amazing woman and good to the bone. We divorced 6 years ago because I had an affair with my current partner. I was in a low place in my life and I fucked up. She was in incredible pain but - like a fucking saint- she allowed me to still see our kids who mean the world to me, allowed our divorce to be as pain free as possible despite the fact that I know she was hurting. She still is close with my parents. She is respectful to me although she refuses to talk to my gf. \n\nShe was actually the first person I phoned after my mom and pops after I found out I won the lottery. She was pleased for me, joked that I could take the kids on a world round trip, and that was that. Nothing else. as soon as I won, I knew I wanted to give her a significant amount. I still love her. She’s the mother of my babies and I feel like this is some small tiny way I can show her that I’m not a complete fuck up. She deserves to know that I care despite my mistakes. She also works a shitty job in the public library which pays her peanuts- she would actually be able to pursue her hobbies this way. Give our kids a better life between us. I haven’t discussed this with my ex yet, but I have with my parents who strongly agree and my lawyer who was very surprised but on board. \n\nLong story short, when I told my gf, she was my livid. Screaming that I’m disrespecting her, accusing me of still being in love with my ex wife- I’m not *in* love with her. We’ve both grown apart, but of course I still *love* her for being an excellent co parenting partner and mother to my kids. My gf is threatening to break up with me, and tbh I’m feeling incredibly relieved over the threats. I don’t plan on changing my plans, but AITA?\n",
        "edited": "False",
        "id": "b43t53",
        "is_asshole": 0,
        "num_comments": 5487.0,
        "score": 45413,
        "timestamp": 1553253204.0,
        "title": "AITA for giving my ex wife a large amount of money I won despite the anger of my gf?",
        "verdict": "not the asshole"
    },
    {
        "body": "I (19f) study drama at uni, and my boyfriend is on the same course. My boyfriend is a really good-looking guy, but he doesn't seem to know it. He gets a lot of attention from girls and for the most part, doesn't seem to get that they're flirting with him. I'm not generally annoyed by this, and never really say anything.\n\nHowever, there's one girl in our class, let's call her Victoria, who is obsessed with my boyfriend. She goes out of her way to be paired with him in group activities (for example, if the professor picks groups by numbering us 1, 2, 3, she will move herself to be in the same number as him) and she recently stepped down from a main role in a play we're doing so she could be in a more minor one, simply because this character has a romance with my boyfriend. I know this is the case, because I've heard her say to her friends that she thinks he's hot and what not.\n\nI've never said anything to her about it, because she seems pretty insecure (always complaining about how she thinks she's ugly) and I don't see it as a big deal because my boyfriend doesn't care. However, we recently performed the play and had a small afterparty where she got slightly drunk and was bragging about how she 'definitely felt something' when they kissed in the play and she's 'going to ask him if he felt the same'. I rolled my eyes and again ignored it, until she actually went up to my boyfriend. She was a little bit drunk, and when she went up to him I was there too.\n\nVictoria started saying that she knows he must have felt a spark, he's a really good kisser, etc. I snapped, and sort of shouted at her that 'you sound incredibly desperate, going after somebody else's boyfriend. You're pathetic if you think a stage kiss means you should be together.'\n\nShe looked super embarrassed and walked away, and I later heard she'd gone home crying. I feel like a dick because she's obviously insecure and whatnot, and her friends haven't stopped calling me a bitch since. AITA?\n\nEdit: She 100% knows that I am his girlfriend, I have heard her talking about me being his girlfriend before.",
        "edited": "1573235084.0",
        "id": "dtg4jw",
        "is_asshole": 0,
        "num_comments": 4383.0,
        "score": 43361,
        "timestamp": 1573223122.0,
        "title": "AITA for telling the girl who kissed my boyfriend for a play that she is desperate and pathetic?",
        "verdict": "not the asshole"
    },
    {
        "body": "Ok this is the worst. I’m losing sleep over this.\n\nI’m getting married in a week to an awesome woman, and I cannot wait to be her husband, we are so excited.\n\nMy brother is gay, but my family doesn’t know, only me and my parents know. I come from a very old school traditional family, so the old part of the family, grandparents and some aunts/uncles still have last century’s mind, and the younger portion, cousins/sibilings are open minded, and are living in the present.\n\nSo my brother has been dating his bf for 6 months now, the dude is great, I’m so happy my brother found a great guy. But it’s kind of a secret, as he hasn’t told my family he is gay.\n\nI’ve been telling him for years that he should come out, cause I know it stresses him a lot, and I think it will make him feel better not to hide anymore, plus I bet a few family members already know anyway.\n\nBut he disagrees cause he knows a part of the family won’t accept it and it will be a lot of drama. I see the opposite, I see it as the sooner you know who the idiots are, the sooner we can cut them from our lives. I have no interest in having someone in my life that doesn’t accept my brother being gay.\n\nAnyway, that’s his decision not mine, so for now he won’t say anything.\n\nUntil a few weeks ago, when he said he wants to bring his bf to my wedding. I was not expecting that to be honest. So he went from 0 to 100 pretty fast.\n\nIf it was any other occasion I would be supportive obviously, but I don’t think my wedding day is the day to do that.  Imagine all the drama and gossip and bullshit that would happen. And I don’t want to get the attention away from my fiancée, that’s her day. And I dont wanna have to worry about that on my wedding day, and I think it’s a pretty good reason\n\nI asked him why my wedding day, he said it’s because he wants to celebrate love with the 2 people he loves the most, me and his boyfriend. This is killing me. I would fight my whole family for my brother and never speak to them again if I had to, but my wedding day is supposed to be a celebration, not a family fight, and I can’t do this to my wife, that might ruin our future. \n\nI didn’t even tell her, she is already stressed out, dont wanna make it even worse\n\nWith a heavy heart, I asked him to please come alone to the wedding, and that I hope he understands me. He  started crying and left my house without saying anything.\n\nNext day I got a text and he said “ dont worry, going alone”. I tried calling him but he didnt answer  me, and my parents don’t seem to know what’s happening because they didn’t say anything.\n\nHe eventually called me back a few days later, we spoke, he said he understands my side, but things are still weird between us\n\nThis is the worst situation of my life, am I the asshole for handling it the way I did?\n\nPS 1: I wanna thank the r\n\nPS 2: Thanks for the gold and stuff!\n\nUpdate: spoke to fiancée, couldn’t keep this from her anymore, she agreed with me.\n\nClarification: I know it won’t be my brother that would cause trouble. The trouble would start with remarks and looks from some aunt/uncle. Doesn’t matter, we are spending a lot of money on this wedding, planned it for a long time, my fiancee put her heart and soul into planning this wedding.I don’t want to see my bride or mom crying, or some idiot uncle insulting my brother. Literally every other day of my life I will support my brother’s decision to come out. Even at the wedding, I would obviously defend him. But the point is, NOT AT THE WEDDING. Also, MY BROTHER IS NOT THE ASSHOLE. Not at all.",
        "edited": "1566188713.0",
        "id": "cs0bfh",
        "is_asshole": 0,
        "num_comments": 4602.0,
        "score": 43067,
        "timestamp": 1566129347.0,
        "title": "AITA for asking my brother not to bring his boyfriend to my wedding?",
        "verdict": "not the asshole"
    },
    {
        "body": "**EDIT: THE BOYFRIEND DOESNT LIVE WITH US AND DOESNT PAY RENT OR BILLS. HIM AND HIS DAUGHTES SPEND TIME HERE AND PAY ONLY FOR THEIR FOOD: SOMETHING I DO AS WELL*** \n\nMy dad died suddenly about a year ago, and my mom found this really nice guy that she’s started seeing. I’m 23M and going into my final year of college. My moms boyfriend has two daughters ages 15 and 13. My mom has stepped in to be a mother figure to them, and the boyfriend has stepped into my extended family becoming everyone’s favourite uncle. And while i’m glad everyone else is comfortable, i’m not. \n\nHe isn’t a bad guy, I’m just still grieving my father, and it feels like he’s trying to replace him. He tries to set rules for me, things like chores and curfew, that my dad specifically didn’t because he thought they were ridiculous for an adult. Boyfriend thinks it’s only fair because i have siblings now. I think it’s ridiculous to have the same rules apply because of our age differences. \n\nHe’s trying to get me to share my stuff with his kids. They aren’t lacking for anything but he thinks it’s only fair because ~family~. \n\nI live in the basement of my moms house. I have since i was 15. When you come in the front door there’s a door to the basement and the stairs to go into the house. So it’s pretty separate. \n\nSo last night i was DDing for some friends and got home at 2 am. I had nothing to do until 3pm today since classes aren’t until next week and my new job starts in 2 weeks. So this has never been a big deal with my parents. I shot my mom a text and went to bed. \n\nTonight though, man, boyfriend flipped. I got a lecture and sent to my room and “possible loss of car privileges.”\n\nI snapped and laid it out for him. I told him i’m leaving the city after i graduate, i told him i’m glad my mom found a new partner but that i am not and will not be looking for a new father figure and he needs to respect that. I told him our relationship won’t be father/son for some time, and that he needs to respect me as an adult or that i won’t want to have a relationship with him. \n\nHe told my family and they think i’m the asshole. AITA?",
        "edited": "1567093402.0",
        "id": "cwxh47",
        "is_asshole": 0,
        "num_comments": 4499.0,
        "score": 41599,
        "timestamp": 1567063135.0,
        "title": "AITA for asking moms boyfriend to stop trying to parent me?",
        "verdict": "not the asshole"
    },
    {
        "body": "Some backstory: I had been dating my ex fiancé Sarah for four years. We had been planning to get married in November 2020 but I found out at the start of this month that she cheated on me. She begged me to give her another chance but I broke it off. \n\n\nThe problem was that being cheated on is, in my mind, completely emasculating and humiliating. So I never told anyone that was the reason we broke up. For obvious reasons, Sarah also didn’t tell people we broke up because she cheated. So people have “blamed” me for the breakup, including my mom. They just see that I dumped her out of the blue. \n\n\nI’ve gone very strict no contact with Sarah after I discovered she was cheating on me. Sarah has been talking with my mom and has convinced her that if we could talk one more time, we would be able to reconcile. My mom has been applying hard core pressure on me to talk with Sarah but I’ve explained that there’s no chance we will ever get back together. \n\n\nSo tonight I go over to my mom’s place because she’s hosting family for Christmas Eve. I’m there for a bit talking with my aunts and uncles and cousins when the doorbell rings and I can see it’s Sarah. I ask wtf is going on and my mom says she invited Sarah so we can work this out in the spirit of the holidays. \n\n\nI’m pissed now because the only way to explain my side of the story is to tell everyone I was cheated on. Complete humiliation in front of my whole family. So as my mom goes to the front door, I go into the bathroom. My mom starts knocking on the door saying that I need to come out and talk to my ex like an adult. I say fuck it, kick out the window screen and get in my car and go home. \n\n\nMy mom called a short while ago saying she’s cutting ties with me over my behavior (she’s really fixated on me jumping out of a window) and that Sarah will always be like a child to her. My sister called me after to ream me out for ruining Christmas. I broke down and told her that Sarah cheated on me which is why I dumped her and didn’t want to see her under any circumstances. She called me a big asshole who was lying to cover for myself.  Am I really in the wrong?",
        "edited": "False",
        "id": "efcc8u",
        "is_asshole": 0,
        "num_comments": 1804.0,
        "score": 41505,
        "timestamp": 1577250390.0,
        "title": "AITA for jumping out of a bathroom window to avoid my mom’s attempt at forcing a reunion between me and my ex fiancé?",
        "verdict": "not the asshole"
    },
    {
        "body": "**UPDATED 7:50 PM:** Holy crap! Thank you for the outpour of support, everyone. I never thought posting this in an online community was going to reach the right eyes so quickly! I had written this on my lunch break and was completely blown away and brought to tears when I checked back in after work. Several people reached out with helpful resources, including a litigator on Reddit who put me in contact with a colleague who practices in my state. Apparently there is precedent and people have won against the state although it did take several years.\n\n&#x200B;\n\nMy intent was to answer more questions since I wasn't able to do that while at work. I was also going to post the website as that has been a popular request, however I've been told not to continue further discussions beyond what I have already posted if I wish to pursue a civil suit.\n\n&#x200B;\n\nJust a couple things I want to address in my update here. Some people are saying I'm leaving out details. My original post was much longer but there's a 3000 character limit imposed. I had to delete a lot of things from my initial draft so I apologize if it looks like details have been left out. I did try to make sure everything that was relevant was kept. Lastly, my son is now back with me. There was a lot of paperwork and even a court hearing, but we're together now and that's what counts.\n\n&#x200B;\n\nI'm sorry if I didn't respond to your comment or private message. I'm still going through my unread messages and still have quite a lot left to read. Truly, thank you from the bottom of my heart for your support, words of encouragement, and advice that you sent my way. I can't even begin to put into words how grateful I am. Again, thank you so much to all the kind strangers who went out of their way to help.\n\n&#x200B;\n\n\\---------------------------------------------\n\n&#x200B;\n\nBack in November 2018 I was arrested at work in front of my boss and co-workers. It was the most humiliating thing I've ever experienced. I later learned at the police station that I was being charged with multiple felonies. This came as a huge surprise. Luckily I was able to keep my wits and lawyer up instead of speaking with the detective. For $13,000 which completely wiped my savings, I was able to retain a criminal defense attorney. However it cost me everything and I was unable to pay my bond. This resulted in me staying in jail for a total of 54 days. At a status hearing, my attorney presented video evidence of me gassing up my car 3 hours away from where the crimes took place and I ended up having all my charges dismissed. When I finally got out I learned that I had lost my job, was in the process of being evicted, and my son was in the state's care. His mother is a heroine addict and I haven't spoken to my own parents in nearly 15 years. They wouldn't let him go to my girlfriend because they didn't consider her family.\n\n&#x200B;\n\nSince my release, I've learned that I can't sue the police and no one gives a shit that I was locked up for 54 days because the detective did poor investigation work. I've gone to the local press about this and was told that what happened to me happens quite a bit. They took down my info but never followed up. So what I did was create a website sharing my story. I also uploaded the police report and some other documents from the discovery. Literally the only reason why I was arrested was because an eye witness said they saw me. If the detective had done his job, he could have verified that I wasn't even in town on the day the crimes took place. This is what pisses me off the most. My life was ruined because of a lazy employee.\n\n&#x200B;\n\nI'm writing this now because my website is now ranked #2 on the first page of search results when you type in my town's name. I live in a touristy town and we attract a lot of visitors over the summer. My web traffic has more than quadrupled, and apparently it's gotten someone high up's attention. I received a cease and desist letter recently, which I showed to my attorney. He said sharing my experience online isn't illegal and that everything I had stated was a fact or my own opinion, protecting me from a defamation lawsuit. Yesterday I received a visit from two officers and the detective who had arrested me. He apologized, stating \"mistakes can happen.\" They then talked to me about my website and asked if I could remove it. I said I would delete it on the condition that the detective leave his job and never do police work again. Suffice to say that isn't happening.\n\n&#x200B;\n\nAfter the visit I received, I'm more pissed off that the only reason the detective apologized to me was to get me to take down my website. I don't plan to and the only one supporting this is my girlfriend. My friends think I'm being spiteful and have suggested that I just delete it. AITA for keeping my website up?\n\nEdit: Grammar",
        "edited": "1562892640.0",
        "id": "cbybhq",
        "is_asshole": 0,
        "num_comments": 2358.0,
        "score": 41413,
        "timestamp": 1562865352.0,
        "title": "AITA for keeping my website up after being asked to remove it?",
        "verdict": "not the asshole"
    },
    {
        "body": "My mother died when I was 16. My dad married another woman two years later.\n\nMy grandparents, my dad's parents, HATE my stepmother. I really don't like her either.\n\nEven after my half-siblings were born, my grandparents never warmed up to her.\n\nMy grandparents are quite wealthy. My father has been banking on this inheritance for a while. He has even been not paying into his retirement because he's so sure that he will inherit the millions.\n\nI just found out on Saturday that I'm getting the majority of my grandparents estate. My father is getting a token amount of $50000 so he can't dispute it.\n\nMy grandparents made me promise not to give out any money after and I intend to keep  my word.\n\nBut I do feel really guilty that my father just spends his money as it's coming in because he's relying on money he won't get.\n\nI also found out my dad is in a lot of debt.\n\nAITA for not telling him?",
        "edited": "False",
        "id": "dgfkt3",
        "is_asshole": 0,
        "num_comments": 3358.0,
        "score": 41273,
        "timestamp": 1570802379.0,
        "title": "AITA for not telling my Dad he isn't getting the inheritance he's expecting?",
        "verdict": "not the asshole"
    },
    {
        "body": "I am the  by-product of my parents extra-marital affair. Both of them had spouses at the time. My birth-mother got pregnant and had to tell her husband as he was overseas when I was conceived so there was no way I was his. A few months after I was born they decided not to divorce. I was given to my grandparents on my mothers side to raise with my birth father secretly paying child support without his wife's knowledge.\n\nBoth my parents had other children, my dad's side knows nothing about me but my siblings on my mum's side were told that I am adopted by my grandparents. Recently I decided that I wanted to know more about my dad's family and I sent a friend's request to one of my siblings and my dad so I could get to know him. Well he freaked out and contacted my birth mum and they asked to speak to me over Skype. They both told me that they couldnt risk staying in contact with me and told me that they were going no-contact and to please respect it and move on with my life. \n\nWell I did pretty much the opposite. I contacted my dad's wife and shared screen shots of our conversations and told her everything. She is now divorcing him while on my mother's side I told both my siblings who then went on to tell extended family including her husband's side so now they are seperated and my siblings hate my mother. \n\nCurrently my siblings on both sides lives have been upturned and after the satisfaction has worn off I feel like I unnecessarily hurt them through my parents. AITA for ruining my parents marriages?",
        "edited": "False",
        "id": "cohdqj",
        "is_asshole": 0,
        "num_comments": 2387.0,
        "score": 41041,
        "timestamp": 1565439833.0,
        "title": "AITA for ruining both my parents marriages for disowning me?",
        "verdict": "not the asshole"
    },
    {
        "body": "I'm a software engineer, with a full time job and a side hustle of doing freelance coding work in my own time. I've always been the type to have a side hustle I put a lot of my free time into; I get really bored sitting idle.\n\nMy freelance hourly rates are $60 an hour, and at my full time job, my hourly pay works out to about $40 an hour. So that's how I value my time. \n\nAnyway, over Christmas vacation, I was staying at my parents house. My cousin was also staying over with her three young kids from Christmas to new year's.\n\nI'd been planning on doing some work on my freelance projects when I had free time; in the mornings when my family had no plans. I wasn't in any rush; I was already ahead of schedule on them all, but I didn't really have anything else to do. It was in a really rural area and it's like an hour drive to the nearest anything\n\nThen my cousin and her husband asked if I could babysit all day for three days, so they could visit some friends in the area and hang out with just adults. I said I had planned on doing freelance work at the library, and she offered to pay me to babysit.\n\nI said I could if they got close to my freelance rates. She wanted a number, and although my freelance rates are $60 I didn't feel like that was right, it was high. But I didn't want to go too low; honestly babysitting 3 kids would be harder for me than the routine coding work I had for my freelance project. I don't know a lot about kids and I've never babysat for long, and I had a feeling it would be stressful and difficult.\n\nSo I said $35, which is below what I make hourly at work, and what is the bare minimum I'd value my time for, if that time is spent doing difficult work. \n\nAnd she went crazy at me, saying that's a ridiculous rate for babysitting, that I was entitled and being selfish, that I'm trying to take advantage of how she didn't have other options, etc.\n\nI said that's way below what I'd be making if I had the time to do my own work, and I'd be putting off my own work to babysit. \n\nHer husband then got mad at me saying that I was a 24 year old girl, that I'm damn near a child myself, that my time is not worth that much and it's childish to say that it was. And that I was a stupid girl for not knowing that babysitting costs like 15 an hour, when I grew up and have kids of my own I will see how stupid I was being.\n\nI was kind of done with being called stupid so I just told them I hoped they could find someone else.\n\nMy mom thinks that I asked for something offensive, and my cousin and her husband obviously did too.\n\nAITA for giving that number?",
        "edited": "False",
        "id": "eizcvf",
        "is_asshole": 0,
        "num_comments": 9043.0,
        "score": 39521,
        "timestamp": 1577977774.0,
        "title": "AITA for saying my babysitting rates are $35 an hour?",
        "verdict": "not the asshole"
    },
    {
        "body": "Background: I graduated from college 4 years ago live at home with my parents. My sister graduated 2 years ago and also lives with my parents. We both got jobs pretty much straight out of college. I pay my parents $800/month in rent since my first paycheck.\n\nThis is a throwaway and it's still fresh and I'm really emotionally charged right now. Last night my parents were talking loudly about their financial problems in the living room. I overheard and I offered to help by paying more in rent (I was thinking $900-1000) since it covers utilities/phone/internet. My parents were grateful. Now, prior to this, I never asked my how much sister pays in rent. I always figured my parents charged us the same. So absentmindedly I asked a follow-up question.\n\nMe: How much is [my sister] paying [for rent]?\n\nMy Mom: Nothing.\n\nA long ass pause.\n\nMe: What do you mean she doesn't pay rent?\n\nMy Dad (visibly angry): Your sister doesn't pay a fucking thing!\n\nMy dad explained how my sister recently bought a brand new car and hasn't paid insurance on it so my dad had to pay for it. She doesn't pay rent. She doesn't pay utilities/phone/anything. So for the past 2 years she's been living rent free while I've been paying my parents.\n\nSo later that night we had a family sit down talk. My sister didn't want to pay rent, especially at how much I was paying. She offered $100. My parents suggested she pay $300, I pay $800 which my sister and I both rejected.\n\nThe conversation ended with this:\n\nSister: **FUCK YOU. I'M TRYING TO LIVE MY LIFE.** [These were her exact words which pissed me the fuck off to holy hell)\n\nSo my sister storms off to her room and it's now me, my parents in the living room. I'm extremely upset at this because it's massively unfair. My mom is upset that everyone's angry at each other and my dad's angry my sister won't pay rent and she won't move out and both my parents don't want to police involved.\n\nSo I say my part before leaving.\n\nMe: I'm not going to pay any more rent until she does. (It's only fair right?) And if I do pay rent, I pay whatever she's being.\n\nMy mom: What if she pays $300 and you pay $800-\n\nMe: No.\n\nMy mom: But [me], we really need the money...\n\nMe: That's too bad.\n\nI get up and go off to my room.\n\nSo this morning my dad comes in tells me that I'M AN ASSHOLE FOR NOT PAYING RENT. That I should pay rent because it's the right thing to do and all this shit. I'm like, \"what the hell? make [my sister] pay rent!\"\n\nMy mom, who's listening in.\n\n\"You've seen her! She won't listen to us!\"\n\nMe: WELL THAT'S TOO BAD.\n\nMy mom (really angry): WELL WE WOULDN'T HAVE THIS PROBLEM IF YOU DIDN'T TRY TO MAKE YOUR SISTER PAY RENT.\n\nThat was the last straw that blew it for me. I slammed the door on my parents.\n\nAs I'm typing this my parents are in the living room discussing how both their children are rotten and shit was better back in the home country/back in their day when kids listened to their parents. Like wtf?",
        "edited": "False",
        "id": "d38i34",
        "is_asshole": 0,
        "num_comments": 2908.0,
        "score": 39250,
        "timestamp": 1568297632.0,
        "title": "AITA for demanding my sister pay rent for living-at-home with my parents and refusing to pay my rent until she does?",
        "verdict": "not the asshole"
    },
    {
        "body": "I fucking hate wedding culture.\n\nIt's bullshit.\n\nMy fiance and I thought we would escape the bullshit and money by having a small thing. Well, family started trying to throw money at us to make it bigger and more spectacular. We were surprised, but it was a good surprise.\n\nThen the demands started coming out. They wanted this, they wanted that, they wanted this person to come, these colors, dresses can't do this, this person has to be flower girl, this person HAS to be a groomsman, etc etc. Suddenly it didn't feel like our wedding, but an excuse for our families to have a family reunion.\n\nWe put our foot down and said:\n\n>Thank you all for your kindness and generosity when it comes to our wedding. Unfortunately, it looks like we may not have been on the same page as the rest of you. When we were offered money for this wedding, we did not realize it came with strings attached. With so many requests and so many demands from people we didn't expect would think they had a say in *our* wedding, we have decided to give everyone their money back.   \n>  \n>Our understanding of what a gift is must be very different.  \n>  \n>If you would like to give us money without strings attached or requests or demands, we will gracefully accept it. But if you believe a gift should come with stipulations, we must regretfully, and politely decline.\n\nThis has caused an epic shitstorm. Such to the point where I have people saying they will never come to our wedding (honestly, not the worse thing in the world), that we are spoiled, we're assholes, etc etc etc. My parents are rather upset about it, but hers (who never made any demands and gave us a small cash gift) said we did the right thing. \n\nWe are halfway to canceling the whole party and just absconding into the wilderness to do the wedding the way we want. \n\nAITA? (Are We?)",
        "edited": "False",
        "id": "c8uwj2",
        "is_asshole": 0,
        "num_comments": 3102.0,
        "score": 38684,
        "timestamp": 1562194365.0,
        "title": "AITA for telling my family that if they gift us money for our wedding, there will be no \"strings attached\" or we will politely decline it?",
        "verdict": "not the asshole"
    },
    {
        "body": " Previous Post: [https://www.reddit.com/r/AmItheAsshole/comments/e1oy5c/aita\\_if\\_i\\_cancel\\_christmas\\_because\\_i\\_cant\\_afford/](https://www.reddit.com/r/AmItheAsshole/comments/e1oy5c/aita_if_i_cancel_christmas_because_i_cant_afford/) \n\nSo, it's been 2 weeks and somehow the messages are still coming in.  Thankfully the offers of charity have stopped (here's hoping they were redirected to their communities) but a good deal of them asking whether or not I stopped being a grinch and started being a good husband and father again.  So, to get those people placated first, here you go:  I DECORATED.  Pics without our faces only, sorry.  \n\n\n[https://imgur.com/H4b2Cak](https://imgur.com/H4b2Cak)\n\n[https://imgur.com/QySEGOS](https://imgur.com/QySEGOS)\n\n[https://imgur.com/w074cpg](https://imgur.com/w074cpg)\n\n&#x200B;\n\nI also spoke with a financial advisor, who is helping me set up a budget for 2020, and a counselor who helped me realize that I was worth more than the goods I could offer someone.  She recommended 2 separate therapists to me, and neither are taking new patients before the new year, so for now, my wife and I are working on our budget and cleaning out various corners of the house for things to sell.  So far, we've gotten rid of some unused basement furniture, a mini fridge that has been empty for 2 years, a bunch of wine racks and paraphernalia (we don't drink at home since the baby was born 2 years ago, so no need to keep it around) as well as some other things and made about $750, more than enough to pay all the overdue bills, put some money in savings, and groceries in the cupboard.  It's going to be a long road to pay off this cc debt, but we're finally addressing the issue head on and moving in the right direction.\n\nSince my last paycheck (that covered mortgage and utilities, no worries there, for those who asked if I was behind, thank you) I have also been offered (and taken) 3 DJ gigs for Holiday parties.  2 for personal friends/acquaintances businesses, 1 for a charity.  I refused payment for the children's charity gig, instead offering to give the money right back to the kids instead, which was gratefully accepted by the organizer.  The extra cash from the 2 paying gigs paid down some more debt, and was enough leftover to allow me to have bought some nice new books and a Moana doll for my little girl to open on Xmas morning, (to say nothing of the bags of presents from both sets of grandparents full of clothes and toys, so she'll be fine from a presents standpoint).\n\nInspired by everyone's offers of charity, I volunteered again at Paul's Place in Baltimore, where this time I donned the hairnet and apron and served hot meals.  Cell phones are prohibited inside, plus taking photos of yourself doing charity work defeats the purpose of said work.  I also organized a food drive at my office to provide meal kits for Christmas for needy families, and we were able to donate 574 lbs of food to the MD Food Bank!\n\nThank you to all who reached out and made me realize that I really was an asshole.  I let my personal shortcomings almost ruin a holiday for my wife and child.  It won't be as fancy as our last Christmases, but I have a feeling that this year will be very special to me, no matter how little is under my tree.  I realized that I have all the gifts I need, and I cannot thank the beautiful people who offered up so much charity to a grumpy stranger.  I didn't need to accept your gifts to accept your love, and the offers alone changed my life.\n\n&#x200B;\n\nHappy Holiday's y'all.",
        "edited": "False",
        "id": "e8w7e6",
        "is_asshole": 0,
        "num_comments": 887.0,
        "score": 38529,
        "timestamp": 1576009813.0,
        "title": "UPDATE: AITA if I \"cancel\" Christmas because I can't afford it this year?",
        "verdict": "not the asshole"
    },
    {
        "body": "I’m 15 years old. I have a stepsister who is a couple years older than me and she is really seriously disabled. I’m not sure what’s wrong with her because no one ever wants to discuss it with me but she’s non verbal, breaks her bones a lot, and has severe epilepsy and will have many fitting episodes. She also doesn’t understand stuff. That’s probably the easiest way to put it. She’s just a human body with nothing inside. \n\nShe’s my stepmoms daughter. My stepmom married my dad 3 years ago and they dated only for a year before that. I don’t know my stepmom very well and I don’t really get on with her. We are respectful to each other but I’m basically living with strangers because she’s so busy with her daughter and my dad. I am always on my own and I used to hate it but I’m used to it now.\n\nEver since they moved in to live with us life changed drastically for me because all the care now revolves around my stepsister. That’s fine, I get it, but both my stepmom and my dad ask me to do things for my stepsister that I don’t want to do and I resent doing. Stuff like staying home when I want to go to the mall with my friends, they’re disappointed that I don’t get her anything for her birthday with my very limited funds, etc. \n\nMy own mom passed away when I was small so I can’t go and stay anywhere else and all in all I’m just a lot more angry than I used to be because they seem really disappointed whenever I say I don’t want to do anything for her. Even stuff like feeding her- like- I don’t want to sit there feeding her banana pudding and wiping her drool. I didn’t ask for this. \n\nAnyway, she recently fell a few days ago and had a seizure for 8 minutes. She was taken to hospital and the doctors want to keep her in and look after her. I don’t want to go and visit her. I remember seeing my mom in hospital before she died and I just hate hospitals and I sort of hate my stepsister and I just don’t want to go and visit someone who doesn’t even know I’m there. \n\nMy stepmom is really upset with me and so is my dad. They haven’t yelled at me or anything but they are both being super cold towards me because I don’t want to visit. My grandma who lives in Canada called me up out the blue and told me it was okay and I don’t need to force myself to go to the hospital so I’m assuming my dad has told her I’m refusing to go. He keeps pleading with me but I keep telling him I’m not doing it. I told him hospitals remind me of mom and he got even more upset and said my stepsister might die and I need to stop being so selfish towards my stepmom. \n\nI just want to know what Reddit thinks because half my friends think I should go and the other half think I’m justified in saying no.",
        "edited": "False",
        "id": "d1btlg",
        "is_asshole": 0,
        "num_comments": 4383.0,
        "score": 38421,
        "timestamp": 1567954116.0,
        "title": "AITA because I refuse to go and visit my special needs stepsister in hospital even though she’s very sick? I low key hate her.",
        "verdict": "not the asshole"
    },
    {
        "body": "This issue is honestly making me frustrated. Almost everyone is saying I am in the wrong, people are talking behind my back and I genuinely don't know if what I did was correct or not. I just feel so lost. Please, please do help.\n\nI am 17, suffered a major accident while cycling when I was 13. I have 2 really deep,long facial scars. I have been bullied really bad because of it. I am tall, ugly and intimidating as per most girls. People make fun of other people by saying things like \"Why don't you just hook up with u/throwawayfor2k19.\" I am honestly used to it. Those people didn't matter to me anyway.\n\nBut there is this girl I had known since middle school. Let's call her Back I guess? Sorry, I honestly don't know how this works. I had a really, really big crush on her till a few days ago. I thought she was geniunely sweet and amazing. My family is incredibly supportive so they urged me to ask her out. I can play a guitar so I made this whole song for her. I went to the neighbouring city to get her favorite chocolate and stuff like that. This was the first time I felt like really going and asking someone out in my life, and I felt that regardless of what I do, she shall see me for who I am and at least accept me as a friend.\n\nI was over the moon when she ended up accepting. We went to a fancy restaurant,had a fun time together and walked for 30 minutes. She was really sweet to me. The next week or so was honestly heaven. People started noticing me, even her friends seemed friendly with me, I honestly cried everyday because I felt so fortunate to get so much love.\nIt all broke down when a friend of hers, who was on Instagram and followed Beck, sent screenshots to me. I honestly felt betrayed and disgusted.\n\nShe had posts saying 'Fulfilled his lifelong wish by being his Valentine's\", 'Making his day by finally helping him interact with my friends','he is ugly but beautiful people accept ugly people' '#uglypeoplematter' etc. Beck's friend then explained me that she apparently wanted a good social media image and had thus asked all her friends to be kind to me and tolerate me till the first week of March, and then distance themselves from me. She apparently wanted to win some stupid 'positive role model' award for her college application because she was lagging behind in community service.And thought playing with my feelings for a few days wouldn't hurt, and apparently since I was ugly she was the kind one to give me attention anyway.\n\nI was in tears and honestly felt disgusted. My blood was boiling. I researched about this award, found a Facebook page about it online.I went to the authorities to confirm if her name was on the nominations list, and then had my friend's at work and family as alibi.\n\nShe is apparently crying a lot because she received a message from the committee saying her nomination was withdrawn. I am now even more ostracised in school, but honestly I have no remorse whatsoever and feel far more satisfied.\n\n\nEdit: I am honestly really grateful for not only judging me(not in that way) but also giving me love and support. Each comment means the world to me. I am honestly crying reading some of the encouragement. No one besides my family has said these things to me. I know it might seem silly,but it geniunely means the world to me guys. From the bottom of my heart,thank you.\n\nEdit 2: Honestly the support is geniunely overwhelming. I promise to not let you down and to continue being a good person. Thank you for the gold.Thank you all so much for the private messages you have sent me too. I honestly have gone through as many as I can and I just feel really fortunate and grateful.\n\nI sincerely hope you all have an amazing life ahead. Thank you so so much, this has been one of the highlights of my year.\n\nEdit 3: I am sorry for boring you with all these edits. I geniunely can't thank you guys enough. I showed my parent's these posts and they had tears of joy too. I am so thankful to each and every one of you guys, loads of love.\n\nBUT, I have been noticing a worrying number of DMs saying me I could have used her body and had some fun after knowing the truth etc.\n\nI am not this kind of person and I hope nobody is. I have my own integrity. It's NOT right to just forcefully have sex with her, that's appalling. A couple of other DMs sent me links to secret webcams to expose her nudes etc. It's honestly horrifying. I am not that kind of person and shall never ever be one. I just want to make the world a better place and the people around me happy. \n\nI thank these people for their support, but their way to go around it is very wrong. A lot of women ARE amazing. My mother is amazing, the person who sent the screenshots is amazing, my coworkers are amazing, and I am sure many women out there are amazing.  Please don't tell me to take 'the red pill' or anything of that sort. Because I am not going to do that, ever. Please don't say all women are manipulative etc. \n\nThis post isn't anti-women in anyway, it's me talking about the person I believe wronged me.",
        "edited": "1551434049.0",
        "id": "avtmig",
        "is_asshole": 0,
        "num_comments": 270.0,
        "score": 37929,
        "timestamp": 1551374542.0,
        "title": "AITA For purposely stopping my classmate from winning an award and subsequently making her cry?",
        "verdict": "not the asshole"
    },
    {
        "body": "I have a female co-worker who repeatedly calls me out regarding my weight. I'm female 5'9\" 115lbs and very thin. She is very overweight. All the time she makes comments about my weight. She doesn't call me by name she calls me \"slim\" and I even heard her say one time \"go ask toothpick\" and she has said stuff like \"you need some meat on your bones\" & \"you need to eat\". I have only worked there 8 days. I have asked her very nicely to stop. Yesterday I asked her to stop calling me slim again and she basically said it's her mouth and she can say what she wants. \n\nToday when she said \"morning slim\" I replied \"morning chunky\" and she got upset and actually started crying. Everybody here at work, (only 6 of us total) is saying I'm wrong and I should apologize because being called fat is \"different\" than being called skinny because being called skinny is a \"compliment\". I said as long as she calls me slim, I will call her chunky and now I'm the bad person. AITA if I don't apologize? The owner/manager has completely ignored the situation saying it's \"a high school issue and we should figure it out\".\n\n",
        "edited": "1558030129.0",
        "id": "bpe2di",
        "is_asshole": 0,
        "num_comments": 1896.0,
        "score": 37093,
        "timestamp": 1558021056.0,
        "title": "AITA For calling my co-worker \"chunky\" after she repeatedly calls me \"slim\" and makes references to my weight after I asked her multiple times not to.",
        "verdict": "not the asshole"
    },
    {
        "body": "I have 3 kids, 15F, 12F and 7M. My oldest has always been a cuddler, and that suits me fine because I am too. Recently my in laws were over, and we were all watching a movie together. It was a kids movie, and so my 15yo was bored out of her mind and tired, so she started to snuggle up to me and go to sleep.\n\nAfter the movie was over, we sent all the kids to bed/their rooms and got chatting for a bit longer. There was a fair bit of wine involved (I was sober though), and eventually after a short silence my FIL let it drop that he thought it was inappropriate I still cuddled with my 15yo. I don't really know why he brought it up suddenly, but I was prepared to laugh it off and just assumed it was the alcohol. To my surprise, my wife and MIL both agreed with him.\n\nI have a lot of respect for my in-laws, I get along with them great and I consider them closer than my own parents. Obviously I'm quite fond of my wife as well, but I outright told them to \"fuck off and go fuck themselves\" and then left them and went to bed. I've never spoken to any of them like that before, but it felt like the right thing to say in the moment. They all want me to apologize for being so rude to them. AITA?\n\n&#x200B;\n\nEdit due to info request: We were not spooning, she was sitting next to me laying on my chest.\n\nEdit of my own free will: Idk if it's important info, but I didn't yell.\n\nEdit: I think I've read most everything now, thanks for all the messages of support and hate, I liked them all. Some people asked me to make an update post, I don't think I will, sorry. I've been speaking to them over the past few days and I know why they said what they said (although it's not relevant to me telling them to fuck off), but it's pretty personal and I don't feel like sharing. I wont be apologizing to any of them, especially now that I know their reasoning. I love my wife, but it hurts that she doesn't trust me.",
        "edited": "1566542226.0",
        "id": "ctwk69",
        "is_asshole": 0,
        "num_comments": 2691.0,
        "score": 37089,
        "timestamp": 1566475961.0,
        "title": "AITA for telling my wife and in-laws to fuck off after they told me to stop cuddling my daughter?",
        "verdict": "not the asshole"
    },
    {
        "body": "Hi all. \n\nI gave birth four weeks ago, and we decided to have a ''baby ceremony'', where everyone gets to meet our lovely daughter Charlotte. \n\nMy cousin Alice and her parents were among the guests. The first thing I'll say about her is that she has expensive taste. She's the sort of person who has a *minimum* price range for how much she spends on clothing. She doesn't own anything that isn't designer and has some items of clothing that cost thousands. She is a banker and still lives with parents so can afford the lifestyle. \n\nIt was Alice's turn to hold the baby and she was happy to at first, but suddenly Charlotte vomited on her. Alice handed Charlotte back to me and ran off crying, and spent the rest of the event crying in the car. I went to see her to apologise but she didn't want to hear any of it. My mum gave her one of her shirts which was too big for her and she felt completely upset and humiliated.\n\nToday I got a call from my mum, saying that she'd been on the phone to her sister (Alice's mum) saying that they want me to reimburse the cost of the blouse (roughly £1800) since it was completely ruined. \n\nI have said no. At the end of the day we all know what babies can be like. She took a risk wearing something so expensive knowing a baby was nearby and unfortunately it backfired. I feel bad for her but it was not my fault. \n\nAm I doing the right thing by refusing to pay up?",
        "edited": "False",
        "id": "cw43oc",
        "is_asshole": 0,
        "num_comments": 9024.0,
        "score": 36204,
        "timestamp": 1566910725.0,
        "title": "AITA for refusing to pay back my cousin after my baby ruined her blouse?",
        "verdict": "not the asshole"
    },
    {
        "body": "I'm 25(M) and have lived with my girlfriend for the last few months. I pay rent and all bills because a few months ago she was kicked out of her parents home (that's a story for another time), although she also does have a job (she is horrible with her money and has no savings).\n\nSo a few weeks ago my little brother (10) moved in with me, and my grandparents said they were going to move overseas and could not take him - my parents passed a few years ago, and when they passed I was still in college and hence couldn't take him in, even though I loved him very much (still obviously do). When I got my own place, I felt it would be selfish to uproot his new home, so just left him with my grandparents. However, I visited him almost every day whilst he was living there.\n\nWhen I informed my girlfriend of my little brother moving in, she was very angry, although she eventually calmed down and accepted it - probably because she realised she could do nothing about it.\n\nMy girlfriend has been quite aggressive to my little brother. My little brother is very shy and has anxiety issues, and often has panic attacks. Therefore, the day before he came I told my girlfriend to be welcoming and make him feel wanted on her part.\n\nHowever, the last few weeks have been very concerning. She has been very aggressive with my brother. Yesterday, when he accidentally spilt his drink on MY lap, she yelled at him and called him worthless. He started crying and kept apologising to her, whilst hugging me and hiding his head in shame.\n\nI told her that she could no longer live with me given how she treated my brother. I was aware that by making her leave, that she would be homeless. However, my brother comes first.\n\nAITA for making her homeless without giving her time to sort out other arrangements?\n\n\n\nEDIT#2: Regarding my grandparents, they had been planning to move to their country of birth (Finland) for years now. They had sorted all the details out before my parents died. They postponed it. They felt very guilty when they told me that they wanted to live their last years in their homeland, but I understood.",
        "edited": "1578415806.0",
        "id": "elc7z5",
        "is_asshole": 0,
        "num_comments": 2595.0,
        "score": 35635,
        "timestamp": 1578407241.0,
        "title": "AITA For making my girlfriend homeless after she yelled at my little brother?",
        "verdict": "not the asshole"
    },
    {
        "body": "My wife and I are both 42 and in marriage counselling after our marriage basically went to shit after having kids (6 and 4 year old twins). A lot of issues and disagreements have come up in our marriage that have driven us apart and I have been working through my resentment that going back for one more baby resulted in twins, including one which we are pretty sure has ADHD and ODD and is a *nightmare* child). \n\nOur counsellor asked me if I would have children if I had to do it all over again and I said \"honestly, no\". \n\nI love my kids and would take a bullet for them, but if I had the chance to go back to 24 when I finished grad school and could do my life over again, I wouldn't choose fatherhood. It is not the fulfilling experience everyone claims and while I love my children, the sacrifices are not worth it to me. I had a much happier life before having children and have gone from someone who loved life to someone who just.....makes it through the day, working a job he hates to provide for the wife and kids while silently wishing this wasn't my life. \n\nMy wife is *furious* and taking it the wrong way and even told our 6 year old \"daddy wishes you were never born\" which makes me livid. You don't tell the kid that.\n\nYes, I wish I never had kids, but I do love them, would never hurt them or want to upset them. And I didn't say it to/in front of my kids and I never ever will. I said it in marriage counselling, what should be a safe space to talk about feelings. \n\nIt has become a huge fight, our marriage is not going to be saved now, and I know she will try and use this against my in divorce court to try and get sole custody and take everything and lie to the kids who I do love and still want to be a Dad to them. She is incapable of understanding that you can love your kids but also feel that parenthood was the best choice for you. \n \nAITA for saying it though?\n\nEdit: Ok this blew the fuck up and there is no way I can reply to everyone's questions. But to address a couple I have 3 kids not 4. One child is 6, two are four. English is not my first language and I forgot the comma, and even so that sentence would have been much clearer in my native language. \n\nWhen I say I resent having twins, I am not saying it is my wife's fault! But 3 children is more than we budgeted/bargained for and I need to pick up a lot overtime I that I would not have had to pick up if we just had 2 kids, and that is what I resent (that and the child with ADHD/ODD). My life is basically work and dealing with my kids. And do you know what ODD is? This child always refuses to do what is asked, gets angry and throws a tantrum when asked to do something he doesn't want to do, hits and kicks others, deliberately annoys and hurts others, is extremely spiteful, screams and kicks me constantly. ALWAYS. All day. Every day. It's exhausting and it is hell. \n\nYeah. I would't have him again. Most people wouldn't if they had to raise him.  \n\nJust because I wouldn't do this over again doesn't mean I'm not committed to being a good dad and being present in their lives. I just would not do it over again if I could redo my adult life. \n\nMy first kid was not born at 24, I just said that because if I could do my whole post-University life differently, I would change some other things too (mainly career) and to be honest, after all this, I regret marrying my wife, which is why I said it that way.\n\nRegarding calling the ADHD/ODD twin a nightmare, go google what that means. It is very difficult to manage and he has even been kicked out of three daycare places because they could not handle him and my parents even refuse to babysit him. We never get a break from home and no one can handle time.",
        "edited": "1575835612.0",
        "id": "e7t57k",
        "is_asshole": 0,
        "num_comments": 5324.0,
        "score": 35608,
        "timestamp": 1575807869.0,
        "title": "AITA for admitting I regret having children.",
        "verdict": "not the asshole"
    },
    {
        "body": "So my last name is Doe. It hasn't affected my life much apart from occasionally being called \"Dodo\" while growing up or friends spelling it \"D'Oh\" as a joke, and I'm generally pretty neutral about it.\n\nMy wife is six months pregnant and wants to name our future son after her grandfather, who died of cancer in September. His name was John. \n\nI liked her grandfather, and I know he and my wife were very close, but I won't even consider it, not even for our son's middle name. I feel that's just setting him up a world of problems, especially when he grows up and has to apply for jobs. Nobody's going to believe \"John Doe\" is his real name. \n\nMy wife thinks I'm being an asshole for vetoing a name with a strong family connection and says I'm exaggerating the issues he would face. AITA?",
        "edited": "False",
        "id": "ejycvt",
        "is_asshole": 0,
        "num_comments": 4160.0,
        "score": 35587,
        "timestamp": 1578153807.0,
        "title": "AITA for not wanting my son to literally be named \"John Doe?\"",
        "verdict": "not the asshole"
    },
    {
        "body": "I (46M) live with my wife and my 17 year old son. My wife has been on a different continent for about a month taking care of her dying mother, so it has just been me and my son for that time.\n\nMy son and I have a very close relationship where he tells me almost everything going on in his life. On Saturday, he told me that he was going to his first ever high school party this upcoming weekend. He was a bit nervous since he had never really drank before, but he knew that he was going to on that occasion. I'm not sure if this is relevant, but this is in Canada where the drinking age is 19 (in my province), and teenage drinking is very common.\n\nI asked my son if he wanted to have a few beers with me while we watched a sports game that night, as a \"test run\" of sorts. My logic was that if he goes into the party with zero awareness of his tolerance then it could end badly, and it would be best for him to find out his limit in the safety of his home with me.\n\nWe had some beers over a few hours in the night, and I cut him off at 6 (he has had beer in the past, but never more than one at a time). He was pretty drunk but he was okay, and slept it off. We talked about it the next day, and we agreed that six was a bit much for him, and now he knows to have fewer than that at the party.\n\nI was actually pretty content with this whole situation, since he had his \"first experience\" drinking in a safe environment, and I feel much more comfortable with him going to a party now. However, in an effort to be transparent I told my wife about it the other day over the phone, and she was livid. She thinks it was reckless and irresponsible.\n\nAITA?\n\nINFO: I understandably am getting flack for not telling my wife beforehand, but I figured she had enough going on and I didn't need to bother her with something that seemed pretty trivial at the time\n\nEDIT: Thanks for all the comments, I am reading every single one! I appreciate the different perspectives",
        "edited": "1576101400.0",
        "id": "e9bilu",
        "is_asshole": 0,
        "num_comments": 4841.0,
        "score": 35105,
        "timestamp": 1576091398.0,
        "title": "AITA for suggesting/letting my 17 year old son get drunk?",
        "verdict": "not the asshole"
    },
    {
        "body": "I've worked at my office for 8 years. I'm on good terms with management and most of my co-workers.\n​\n\nFive months ago, a new guy was hired on a 6-month probationary period. I'm not his supervisor, but I'm definitely a senior employee. I'll call the guy Ted Faro, because he's a dick.\n\n​\n\nSupervisor was going around introducing Ted to people, and when he got to me said \"This is John\" and described my job.\n\n​\n\nTed: \"Hi, Jack.\"\n\nMe: \"It's John.\"\n\n​\nTed: \"What?\"\n​\n\nMe: \"My name's John, not Jack.\"\n\nTed: \"It's close enough for me.\"\n\nSupervisor: \"His name's John, not Jack. Let's move on.\"\n\n​\n\nThis continued for a few months. Despite reminders from supervisors (when he referred to me when I wasn't present) and myself, he continued to use the name Jack. I finally told him \"You either use my name, or I ignore you completely, no matter what the situation is.\"\n\n​\n\nHis response was \"Sure thing, Jackie boy.\"\n\n​\n\nSince I don't work directly with him, I figured \"screw it\" and that I'd ignore him.\n\n​\n\nRecently he had a 2-day business trip that required car rental. I work late some nights, and Ted came to me and says \"Hey, Jack, I'll be dropping the rental car off at 7 when I get back. See you there for a lift back to the office!\"\n\n​\n\n(they closed at 6 and there's a drop box)\n\n​\n\nAs promised, I ignored him.\n\n​\n\n7:15 rolls around on the night he's dropping off and I get a call. I recognize his number, so I ignored it. He called 7 more times, then starts e-mailing.\n\nThe first one was along the lines of \"Jack I'm at Enterprise. Come pick me up.\"\n\nE-mails pour in every 5-10 minutes, addressing me as Jack, Jack-o, Jackie, and Jackie-boy. The emails also started being laced with profanity and a couple threats.\n\n​\n\nI signed out and went home. It was raining hard.\n\nNext morning, I saw that Ted had sent a few more e-mails. I printed them off. At 10am, he storms up to my desk and  screams \"Where the [f-bomb] were you? I told you when to pick me up! I HAD TO TAKE A CAB! DO YOU KNOW HOW MUCH THAT COST ME?!\" He goes on like that for a bit until his supervisor came and hauled him away and asked to speak to me.\n\n​\n\nSupervisor: \"Ted tells me that you ignored his requests for a pickup when he dropped off the rental. He was caught out in the rain.\"\n\n​\n\nI relayed what happened, and showed him the printed e-mails. I'd highlighted the threats.\n\nSupervisor: \"I can see why you wouldn't want to spend time around him. But it was still kind of inconsiderate to leave him stranded in the rain. That's not the greatest neighborhood and he could have been hurt.\" he sighed and said \"With the threats and him being on probation, he no longer works here. Just try not to be an a-hole in retaliation to your coworkers.\"\n\n​\n\nA few people at the office have commented that I'm the jerk for ignoring Ted and getting him riled up, which got him fired.\n\n​\n\n*AM* I the a-hole on this?",
        "edited": "False",
        "id": "cccdat",
        "is_asshole": 0,
        "num_comments": 4659.0,
        "score": 34703,
        "timestamp": 1562945600.0,
        "title": "AITA For ignoring a coworker who refused to use my actual name?",
        "verdict": "not the asshole"
    },
    {
        "body": "I sound like a real asshole but I've completely lost my mind over this.\n\nI'm 17 and my stepbrother is 17. We both have our driving license.\n\nI just found out 5 days ago that my dad and stepmom bought a used car for my stepbrother. They got me a 600 dollar gift card to best buy. \n\nI know $600 is a lot of money but what the fuck? Am I crazy or is it super unfair? It's literally the straw that broke the goddamn camel's back.\n\nI'm actually so pissed off that I've moved to my mom's house full time.\n\nMy dad seems to be genuinely sorry and told me he's looking for a car now but that it'll take a while.\n\nI messaged him back saying that I'll decide if I want to see him after he decides to be fair for once. I've ignored all other calls and messages from him since.\n\nMy stepbrother messaged me saying that I need to chill out and that he'll let me use his car. He also said that I need to stop bitching and ruining everyone's Christmas. I told him to get in his civic and fuck off.\n\nAITA?",
        "edited": "False",
        "id": "ebjcyh",
        "is_asshole": 0,
        "num_comments": 4241.0,
        "score": 34366,
        "timestamp": 1576522509.0,
        "title": "AITA for demanding the same Christmas present my stepbrother got?",
        "verdict": "not the asshole"
    },
    {
        "body": "Throwaway for anonymity sake incase this does go further. \n\nTo preface this, I (24F) am vegan, and have been for a good 10 years. I have not eaten meat since I was roughly 3-4 years old when I found out where meat comes from (spoiler alert: there were a lot of tears). This is no secret and everyone in my life knows and respects this - or so I thought. \n\n\nFour nights ago, I was at a party and I will admit, I got white girl wasted. My friends thought it would be funny to feed me chicken nuggets as a prank. I checked with them before chowing down \"are these vegan?\" To which my friends replied \"yeah, they're sunfed\" (a type of vegan chickenless chicken). They tasted off to me but I figured it was just because I was drunk. I was wrong. \n\nI found out the next day when my sister sent me a message telling me to check my friends Snapchat story. The story was them showing the nugget packaging, and then showing them giving them to me (including the conversation where I asked if it was vegan). The and then later them mocking me and pretending to be me when I found out I ate meat (things like fake crying and yelling \"the CHICKENS!!!\"). I took a screen recording of the video and took it to the police, on the grounds of food tampering, and now 3 of my (ex) friends are facing charges. \n\nThey all think that I'm overreacting to a 'harmless' prank, so Reddit, AITA? In my view, they took advantage of my drunken state, tampered with my food, and publically humiliated me. In their view, it was just a prank.",
        "edited": "False",
        "id": "devz7y",
        "is_asshole": 0,
        "num_comments": 6157.0,
        "score": 34001,
        "timestamp": 1570514714.0,
        "title": "AITA for going to the police over a 'prank'",
        "verdict": "not the asshole"
    },
    {
        "body": "My sisters car broke down 6 months ago because of her own stupidity. I won't go into it here but she ignored the advice of a mechanic and because of that her car broke. I decided to be nice and offer my sister my car until she could get hers fixed as i could bike to work while she needed to drive. She did not get her car fixed for some reason. She claimed to be saving money to do so but every time her paycheck came she spent it. My parents have even offered her a loan to fix her car but she refused. Along with all of this, she has been abusing my generosity and taking my car all day and night. I told her she could use it for work but is seems to her that is a free pass to use my car, not fill it with gas, and take it when I specifically tell her not to.\n\n&#x200B;\n\nRecently I've been needed to get to work very early and I really don't feel like riding my bike 6 miles at 3 in the morning so I told my sister she had 30 days until I took the spare key from her and she is no longer allowed to use it. That was 32 days ago. Yesterday morning she woke up specifically before me to take my car (at 2:30 in the morning). I called her and demanded she bring it back but she just hung up on me. because of this I reported it stolen.\n\n&#x200B;\n\nMy sister was arrested 30 minutes later and my parents had to go bail her out. My sister is now facing charges for unauthorized use of a car and my parents and her are pissed. They claim I want way to far here but honestly, i feel justified. My parents are worried if she's found guilty she will loose her job but in my opinion, it's her own fault. Am i wrong here? Am i an asshole?",
        "edited": "False",
        "id": "bp8v29",
        "is_asshole": 0,
        "num_comments": 4482.0,
        "score": 33855,
        "timestamp": 1557985220.0,
        "title": "AITA for reporting my car stolen when my sister took it after I told her not to?",
        "verdict": "not the asshole"
    },
    {
        "body": "When I was a in middle school, I was viciously bullied by this boy, who I’ll call Z. He spread rumours about me, called me stupid and useless every chance he got, and made school a living hell. \n\nIt’s been 12 years, and Z has since come out as MtF transgender. She messaged me over social media and asked to meet up. We went out for coffee, where she apologised for bullying me. It was along the lines of, “I’m sorry for being mean. I was young, and I was struggling with my gender identity.”\n\nI thanked her for her apology. When she asked if she was forgiven, and I tried to avoid answering. I am still not over what she did to me. What Z did to me impacted me greatly, as I was a impressionable young girl. I struggled with self esteem for years afterwards. \n\nZ started getting defensive. She told me that I was being petty and that I should forgive her. I told her, “Why? You will always be the boy that bullied me.  An apology won’t change that.” She got really offended when I said the word boy, and said that I was misgendering her. She called me a petty, transphobic, vindictive, and ignorant, then stormed out. \n\nAITA?",
        "edited": "False",
        "id": "dcb1vq",
        "is_asshole": 0,
        "num_comments": 2804.0,
        "score": 33834,
        "timestamp": 1570026946.0,
        "title": "AITA for I telling my childhood bully (who is MtF transgender) that she will always be the “boy who bullied me”?",
        "verdict": "not the asshole"
    },
    {
        "body": "I’m the dad of a 25 year old young woman who I love very much. I’ve been able to have a good relationship with my daughter and I enjoy my time with her, but there’s one thing about her that would give many people pause - she is a diagnosed sociopath.\n\nShe exhibited odd, disturbing behavior at a young age, and after a serious incident of abuse towards her younger sister, I realized she needed professional help. Throughout her elementary years she struggled heavily, getting in lots of trouble in school for lying, cruelty and all other types of misbehaviors. With an enormous amount of therapy & support, her bad behavior was minimized as she grew older. She received an ASPD diagnosis at 18, and I had suspected it for long prior.\n\nAfter her aggressive behavior was tamed, her following years were much more fruitful. She’s law-abiding; has a decent job and a good education; and has many good friendships and admirers. Especially male admirers; she is very, very charming and adept at attracting guys and maintaining their interest. She uses that old dating guide “The Rules” like a Bible. She currently has a boyfriend of about a year and a half who’s crazy about her, and who I have a very strong relationship with (we live in the same area and spend time together regularly). He is a **great** guy, very kind, funny and intelligent.\n\nBut I doubt she loves him. We’ve had some very honest, in-depth discussions about her mental health since her diagnosis, and she’s been open with me that she doesn’t feel love or empathy towards anyone, even family. When she acted very sad and broken up over the death of one of her closest friends at the funeral, she confessed to me privately that it was all a put-on, and that she felt “pretty neutral” about the whole thing. She has also stated she has never once felt guilty about anything she’s ever done, and doesn’t know what guilt feels like. While she enjoys being around her boyfriend and is sexually attracted to him, I highly doubt she feels much of anything towards him love-wise.\n\nHer boyfriend (who might propose soon) **has** **no idea** about her diagnosis, and she’s been very upfront with me that she has no plans to ever tell him, thinking it’ll scare him away. I’ve made it clear to her that she needs to tell him the truth before they marry; that he has the right to know and consider it; **or I will**; to which she always responds, “I know you wouldn’t dare.” I actually would - I really like and respect this young man, and would feel awful keeping this “secret” from him, and letting him walk into a marriage without this piece of knowledge.\n\nI’m not trying to sabotage my daughter’s future. **Maybe** her boyfriend’s love of her personality and other aspects is enough that it won’t end the relationship. It’s his decision to make; but he deserves all the facts. Someday he’s bound to find out she’s a bit “off”; it can’t be kept a secret forever. AITA?",
        "edited": "False",
        "id": "briguv",
        "is_asshole": 0,
        "num_comments": 5035.0,
        "score": 33513,
        "timestamp": 1558487281.0,
        "title": "AITA for wanting my daughter’s boyfriend/soon-to-be fiance to know her dark secret before marriage?",
        "verdict": "not the asshole"
    },
    {
        "body": "I know the title sounds absolutely terrible. \n \nMy ex and I were together for 5 years. I decided to propose, but she rejected me. The next day, we had a talk. She realized that she was gay, since \"I've been trying to hard to please myself from men\". We broke up.\n \nThe very next day, I get bombarded with text messages. My friends asked if this was true, and they linked me to a post. It was a Facebook (who uses Facebook) post (exposing me) about me cheating. She said that's why we broke up. Now I usually am not evil, but this pissed me off. She was destroying my reputation, for god knows why. I simply commented that the real reason that we broke up was because she is gay. People didn't believe me, until my ex literally screamed at me for outing her. Then a lot of people started to call her out for her lies. I know I'm probably a huge asshole. Though I feel like she deserves it.\n \nBut alas, AITA?\n \nNo. I did not cheat on her.\n \nYes. I did have sex with someone the day that we broke up. But it was after.",
        "edited": "1573864133.0",
        "id": "dwrlls",
        "is_asshole": 0,
        "num_comments": 4209.0,
        "score": 33487,
        "timestamp": 1573828528.0,
        "title": "AITA for outing my ex as gay after she told everyone that I cheated on her?",
        "verdict": "not the asshole"
    },
    {
        "body": "My stepsister (20F) and I (24M) have never gotten along. Her mom and my dad got married when we were six and ten so we've known each other for a long time. In my stepmom's eyes, she could do no wrong and anything bad that happened was pinned on me. My dad is a complete pushover so he would always fall over to whatever my stepmom would say.\n\nWhen I was about 15, I started gaining weight. My gf broke up with me (woohoo high school romance), I started failing some of my classes, and I quit baseball. I started to stress-eat and ballooned up from 125 pounds to 162. I guess at that point she decided she was \"cooler\" than I was and started mocking me and making fun of me, calling me names like \"fatass\" and \"chubster\". I would constantly go to my stepmom about it and she would tell me she's just teasing, she's so much younger, why are you getting upset? I got pissed off to the point where I just started avoiding her and locking myself upstairs in my room with a bag of chips. At 22 I hit 270 pounds and I knew I had gone too far. I was way past my weight limit and bordering on obese. So as a New Year's resolution, I decided to start losing weight. I cut out all junk food and started hitting the gym. Around this time my stepsister started to overeat too, I don't really know why but she gained over 30 pounds. She still was constantly belittling me about my weight (which admittedly, was way over hers).\n\nBy the end of this year, I lost 120 lbs. It felt amazing. My stepsister now weighed more than me. Over Christmas dinner, all the aunts and uncles and cousins were complimenting me on my weight loss, telling me how I looked so much better. My stepsister just sat there smoldering. Every time someone said something she'd add, \"He's still pretty big\", \"Well he didn't get rid of that face roundness\", \"Maybe lose a little more around that gut\". It was infuriating and I was getting angrier.\n\nNow here's where I might be TA. Finally, at her last little snide, \"Look, you know you'll just put it all back on. Why do you even bother?\" I flipped out. I yelled, \"Why can't you just be happy for me, instead of getting on me for every little thing?\"She said back to me, \"Defensive much?\"  \n\"Oh, I'm sorry. Did I hurt your 200-pound feelings?\" I asked her. I probably should have stopped there but I kept going. \"Calling me a fatass. Look at your plate! You've eaten half the table, fatty!\" She started crying and left the table. My stepmom screamed at me, saying just because I was insecure I can't take it out on everyone. I said, \"Oh, so *now* you're talking. Not in the past ten years of constant 'fatty' and 'lardass' and 'porker'!\"  \n\"But you're way older!\" she whined.\n\nI left the table too and went home. I woke up today to a thousand messages from my stepmom, my dad, and my stepsister. They were saying I wasn't welcome to their house until I apologized. I'm not going to.\n\nAITA?\n\n",
        "edited": "1577544023.0",
        "id": "efz1kb",
        "is_asshole": 0,
        "num_comments": 1971.0,
        "score": 33485,
        "timestamp": 1577385345.0,
        "title": "AITA for blowing up at my stepsister at her comments about my lost weight?",
        "verdict": "not the asshole"
    },
    {
        "body": "The title sounds so stupid but here we go anyways.\n\nI’m 24 and I’m an addict who has been in recovery for the past six months. \n\nI used and used until I was basically in poverty and my older sister helped bail me out more than once. \n\nShe’s my best friend and I know it hurt her a lot to see me like that. \n\nShe also met her fiancé two years ago and he really only knew me as the junkie brother then. He’s not my biggest fan to say the least considering how much I put my sister through. \n\nDespite this she still invited me to her wedding last week because I am her brother and she wanted me to be there. \n\nWhen I get to the reception, my brother in law is greeting people as they walk in. \n\nWhen I walk by he pulls me to the side and in front of everyone starts patting me down and says that he needs to check me to make sure I “didn’t bring anything in”.  I instinctively pull away, because why wouldn’t I, and I tell him not to touch me. \n\nHe tells me to “calm down” and that if I want to be here then he needs to do this. I tell him he’s being ridiculous and I try to push past him. He stops me and tells me that he doesn’t want to throw me out but he “will if he has to.” I told him that he’s trying to look tough but it’s just making him look stupid. \n\nAt this point I’m getting more and more angry and I’m practically yelling in his face at this point. Bystanders came between us and separated us and told my BIL to just “drop it.” He said he would but that “they can deal with it when I get out of hand.”\n\nI just went to go find a seat after that. \n\nAfter the reception, a lot of my family told me that I should’ve let him just do it and that I was acting like a huge asshole and like I had “something to hide.” \n\nI don’t think he had any right to pat me down, especially in front of people and I don’t think my reaction was over the top. If anything, he was the one acting like a huge douche by trying to start drama so he can look tough. My sister has refused to take any sides in this. \n\nAITA?",
        "edited": "False",
        "id": "cmvrbe",
        "is_asshole": 0,
        "num_comments": 3078.0,
        "score": 33406,
        "timestamp": 1565123343.0,
        "title": "AITA for getting upset that my sister’s fiancé pulled me aside and patted me down at their wedding?",
        "verdict": "not the asshole"
    },
    {
        "body": "Okay this is a doozy, so please strap in and bear with me. For context here, my sister is 30, I am 22. \n\nTen years ago, my sister had a miscarriage. Obviously, it was devastating for her and the whole family and it took her a couple of years to fully heal from it. We're still not 100% sure why it happened, but it was a one off and she's since had three very healthy, beautiful children, including a set of twins. \n\nSo here's the thing. My sister and I don't really get on. She resented me as a kid because she had to share mum's attention and because she thought mum left her dad to be with mine. Never really grew out of that resentment and she was pretty much my biggest bully throughout childhood and my teenage years. One thing she absolutely cannot stand is when  mum and I do things without her, or when mum pays more attention to me than to her. When this happens she calls mum and says she's feeling really upset about the miscarriage and without fail mum goes running. This includes a trip to Paris I took mum on for her birthday earlier this year, which she cut short because sister said she needed her. Also includes when I had a manic episode so bad I was hospitalised and sister managed to need mum every time she was planning to visit me and so she never did. Note, these times when mum is spending more time with me than her are the only times sister brings up what happened and certainly the only times she still gets so upset about it. \n\nSo recently I was sick. Like, don't leave the bathroom for days, can only keep water down sick. Didn't manage to get the doctor, but I think it was norovirus. It lasted about a week Mum was popping in daily on her way home from work to check on me and stuff. On the last day of being seriously unwell, when I felt I could eat again, Mum offered to make me some soup while she was there, which I accepted. She was halfway through making it when sister called her saying she was upset about the miscarriage and she told me I'd have to finish it myself because she had to go. I didn't say anything to Mum and I finished making the soup, but I sent my sister a text saying she really needs to stop bringing it up for attention because she can't bear me getting some instead. I guess she told mum and her dad because I'm hearing from all sides what a horrible, insensitive, selfish bastard I am and how dare I say that to her. I understand she may still be traumatised, I just think it's really weird how that trauma solely manifests whenever I'm getting attention and she isn't. AITA?",
        "edited": "False",
        "id": "eejyso",
        "is_asshole": 0,
        "num_comments": 2265.0,
        "score": 32443,
        "timestamp": 1577103764.0,
        "title": "AITA for saying my sister needs to stop bringing up her miscarriage for attention?",
        "verdict": "not the asshole"
    },
    {
        "body": "My daughter is 3, and sometimes gets scared I’ll stop loving her when she does something bad(for no good reason mind you, I make sure she always knows why I’m upset, and that I’m mad at her actions, not her). Today she bumped a glass off the table and started crying.\n\nShe asked if I still love her and I said “I love you more than anything” and gave her a kiss. My wife was watching and stormed off. I made sure my daughter was fine and cleaned up the glass and went to go see what was going on. \n\nMy wife was crying and calling me an asshole who doesn’t love her (I guess I have 2 irrational 3 years olds now). I said of course I love her and asked why she was wigging out.\n\nShe said that because I said the above phrase to my daughter, it meant she didn’t mean as much to me. Is this really something I’m not supposed to say? My mother said it to me, and my dad didn’t freak out.",
        "edited": "False",
        "id": "ehw713",
        "is_asshole": 0,
        "num_comments": 4854.0,
        "score": 32390,
        "timestamp": 1577758340.0,
        "title": "AITA for saying “I love you more than anything” to my daughter in front of my wife",
        "verdict": "not the asshole"
    },
    {
        "body": "My son was born when I was only 15 years old, and I’ve been a single dad since I was 18. It was hard living for a long time money-wise but I always tried to do best by my son. Today I own my own gym and my son is now 22 and going to college and works at my gym full-time. He came out to me when he was 14 years old and I’ve always been supportive of him and his identity. \n\nI’ve been with my fiancé now for about 2 years and while she does come from a very deep religious and conservative family, she has never had any issue with my son – at least nothing she has ever expressed to me. My son has been dating his boyfriend since he was 18 and I’ve gotten to know him really well. However my fiancé told me recently that she does not want my son’s boyfriend to come to the wedding nor does she want her parents to even get the inclination that my son is gay. That if they found out, they would have a complete fit. This really bothered me because I refuse to ask my son to go back in the closet. What is going to happen in the future? When my son gets married himself? Will they want him and his husband barred from other family events? He’s my son and will be the best man and it would be unfair to deny him a plus one because her family has an issue with gay people. When I told her this, she got very angry with me and told me that I was being selfish and over-dramatic – that it would just be for this one day, that she wants the perfect wedding. I told her that this was unacceptable and that I was not going to ask my son not to bring his boyfriend. It’s my wedding too and I was his boyfriend there. \n\nAfter that I got the silent treatment for a day and since then it hasn’t been discussed again. However, it has left an extremely bad taste in my mouth and has me contemplating calling the wedding off. I do not want to marry into a family that would potentially discriminate against my son. I love my fiance very much but my son will always come first. I told my brother and he said that I was being the asshole here – that it would just be for one day and that since my son is an adult, it’s unlikely that he would have that much interaction with his “step grandparents” in the future anyway. I still don’t feel comfortable about the entire situation and am really thinking about calling the wedding off. Would I be the asshole if I did this? Am I being unreasonable here?",
        "edited": "False",
        "id": "btvqmi",
        "is_asshole": 0,
        "num_comments": 4917.0,
        "score": 32351,
        "timestamp": 1559018219.0,
        "title": "WIBTA if I called off my wedding because my fiance does not want my son to bring his boyfriend to the wedding?",
        "verdict": "not the asshole"
    },
    {
        "body": "I am a teenager and my mom is kinda famous on Instagram and blogging. She had a mommy blog all when I was growing up and of course me and my sister were always involved. \n\nIt sucks because there's so much our there about us and it's what's gonna come up when I'm looking for a job, when I'm dating, when anyone looks up my name.\n\nI found a website that will print custom jackets, print all over the front and back and arms... And I ordered some hoodies that say a bunch of phrases all over them.\n\n\"No photos\" \"no videos\" \"i do not consent to be photographed\" \"no means no\" \"respect my privacy\" \"no cameras\" \"no profiting off my image\"\n\nIt sounds silly but it looks pretty sick actually. I got one for me and one for my nine year old sister who's started to not always want photos.\n\nAnd I guess the idea is that my mom can't take good looking pictures, even candid ones, with us in the hoodies without them having a pretty strong message that we don't want to be in pictures.\n\nMy mom was mad when they showed up, and really mad when I'm wearing mine. Like she says she just wants pictures to remember my young years by, she won't post ones without asking\n\nBut I know that's a whole mess anyway; she always says that and then negotiates me into letting her post, like either by saying that's how she makes income so if I want money for something, to stop arguing about pictures. Or posting without asking and then saying I thought it would be ok because you're face wasn't visible / you're just in the background, etc.\n\nAnd I'm always like \"no you didn't THINK. if you thought at all you'd remember what I said I want. No new pictures of me or mentions of me online. Remove all pictures that include me that you've ever posted. and delete any writing that mentions me. \n\nI am just so fed up, and upset that my mom is mad at me for wearing my new hoodie everyday. She's mad I won't take it off for any event and thinks it's inappropriate to wear to certian things.\n\nI know it's really weird looking but it feels like my only option.\n\nEdit to add a couple more things... She also says all the mentions of consent and \"no means no\" and \"this body is my own\" (sorry forgot to mention that one earlier) imply something more inappropriate and that it is really inappropriate to wear those words out in public. We've also fought about me wearing it to family events and school events with a generally dressier dress code, because it looks like a \"gangster hoody\". I don't know what to say to that, but I don't agree\n\nAITA for always wearing my no photos hoodie?",
        "edited": "1580322429.0",
        "id": "evqd98",
        "is_asshole": 0,
        "num_comments": 3468.0,
        "score": 32033,
        "timestamp": 1580320520.0,
        "title": "AITA? My mom is an influencer. I am sick of being a part of it, I had \"NO PHOTOS\" hoodies printed for me and my little sister.",
        "verdict": "not the asshole"
    },
    {
        "body": "Train is packed, it's hot, I'm tired and looking for a place to sit. Everything was occupied, but at one point I see an old lady get up and start making her way to the doors. I went over to sit in new place, but found a purse in it instead, belonging to the girl in the window seat. I asked her if she could move the purse, but she didn't respond. I noticed she had headphones in, so I figured I'll just pick up the purse and hand it to her as I'm sitting down.\n\nAs soon as I touched that thing, she went off on me with the most disgusted look and tone, asking me what the fuck I was doing. I explained. She then had the nerve to lie that she was keeping the seat for her friend. I told her I knew for a fact she was alone because I just saw the old lady get up, to which she did not respond. So I started making my way down, forcing her to pick up her purse if she didn't want it crushed under my ass.\n\nThis released an even bigger tirade and series of \"what the fuck is your problem\"-s. I saw another old lady looking for a seat and approaching ours, so I figured I'd had enough petty bullshit, turned around to the girl - who was slightly overweight - locked eyes with her and told her \"Oh I'm sorry, I didn't realize you actually needed two seats to be able to fit. My bad, I'll get up now\". I got up and offered my seat to the old lady, who took it with a smile, seemingly ignoring the huge shitstorm that was spewing out of the girl's mouth as I was walking away.\n\nI noticed some people gave me dirty looks, but others were chuckling, so I kinda wondered if I stepped too much out of line there.",
        "edited": "False",
        "id": "cmcou6",
        "is_asshole": 0,
        "num_comments": 3239.0,
        "score": 31892,
        "timestamp": 1565020244.0,
        "title": "AITA for insulting a girl's weight after she went off on me for touching her purse on a crowded train?",
        "verdict": "not the asshole"
    },
    {
        "body": "I work at a petting zoo here, and this weekend we had two teenager (around 16, boyfriend and girlfriend) who were antagonizing a llama.\n\nI told them \"you might want to cut that out! Llamas spit in self-defense.\" But they kind of laughed my warning off.\n\nNow, I knew that llama spit was a whole lot worse than they probably thought it was. But I decided not to tell them about that. I figured if they persisted, I'd trust the llama to teach them a lesson.\n\nThe llama was being patient. At one point it gave them a \"warning spit\" (just saliva) and they went \"eww\" and laughed about it and brushed it off, and then kept going at it.\n\nFinally, the llama had enough...and unleashed its green, defensive spit that llamas are known for. It got the girl square in the face. She dropped to her knees and started retching, and eventually threw up. Her boyfriend was gagging and ran away, towards the building that I was in.\n\nTo make things worse for them, I didn't even let them come in to wash up in the petting zoo's only bathroom! It was a slow day, so I just locked the doors. I told them I didn't want that smell inside, and made them leave the farm without washing up.\n\nAITA? The girl's parents called me the next day and yelled at me saying that was too harsh. Maybe it was...I knew that if you don't wash out llama spit right away the smell sinks into your skin and becomes extremely hard to remove, but I wanted the lesson to sink in as well.",
        "edited": "1567449724.0",
        "id": "cyt2nl",
        "is_asshole": 0,
        "num_comments": 2886.0,
        "score": 31794,
        "timestamp": 1567449640.0,
        "title": "AITA for allowing two teenagers to be spit on by a llama?",
        "verdict": "not the asshole"
    },
    {
        "body": "I have a small group of close friends (all males around the age of 25) that I hang out with almost every day. We've all known each other almost all our lives and recently (~1.5 years) got a new addition to our group, John. \n\nI never really liked John. He was rude, obnoxious, and would always talk like he knows everything. He was also incredibly pretentious. A friend of mine said \"Einstein\" once and John interrupted him to say, \"I have no idea who you are talking about. Do you mean the reknown scientist Albert EinSHTein?\". I once put up a snapchat story saying, \"I love college football!\", and he replied to my story with \"It's called gridiron you moron\".  I don't understand how but my friends readily accepted him into our friends circle. \n\nOn one night about 5-6 months ago, we had a little get-together and were just drinking and having fun. John was kind of tipsy. We had some new girls show up so I was kinda working my charm on them. They asked me what I did and I went \"I'm a Biomed Engineer\". I don't know why that triggered John so much, but he went on this hour long tirade about how I'm just a drone in a rat race. He kept telling me about how I'm just like every other person and lacked creativity. He later passed out, but his little tirade became a running joke in our group.\n\nEvery time I mention work or anything, John would start roasting me. He nicknamed me 'drone' and kept calling me that even though I expressed multiple times that I dont like to be called a drone. He would keep telling me about how easy engineering is (he watched some intro to engineering courses online) and that any monkey with a brain can do what I do. That really pissed me off. Once I told him to shut the fuck up but he was like, \"What are you going to do, fight me? I dare you to swing\". I didn't want to fight him so now I started getting referred to as a 'pussy'. \n\nOver the last few months or so I kinda went frontpage a couple of times on Reddit and everyone was like, \"damn M0shka you famous now\" (as a joke). That triggered him even more. He'd say stuff like \"His posts suck. They're not even funny. Reddit is now just filled with stupid facebookers who upvote stupid clickbait shit and downvote meaningful talent.\" \n\n\nAt this point it is relevant to bring up what John does. He's a 'photographer' who works as a barista at Starbucks. How good is he? Honestly, he started off as an annoying kid with a DSLR, no talent, and a facebook page where he uploaded 3/10 pictures. Over the years he got slightly better but it's still terrible. I'd say he's more of a 5/10 now. 2 weeks ago, he got rejected from his dream job and made an Instagram post about how National Georgraphy discriminated him because of his skin color (brown). \n\nLast week, we had a surprise birthday party at his place with his family (he lives with his parents) and friends. At the party, I apologized to him (I hadn't met him since the post) and said, \"I'm sorry you didn't get Nat Geo\". To which he got angry again and said, \"I'd rather eat my own shit than be a drone like you. What I'm doing is making real art and it's something your robot brain won't ever understand now or in the future, so I actually feel sorry for you\". He said stuff like this in front of a girl I was with who got so enraged that she left and told me to tell them that shes sick or something. \n\nThat's it. I fucking lost it. We were handing out mics to talk about our favorite memory with John and I took that opportunity to say, \"Well John, your pictures fucking suck, no wonder Nat Geo rejected you. You're a 27 year old barista with no college degree, mooching off your parents, and taking worse pictures than any jackass with an iPhone camera. You're not going to amount to anything in life so just --- *I get cut off here*\" \n\nHis dad grabbed the mic and shoved me. John came charging at me but everyone just held him back. The rest of the guys were like get him out of here, and I got kicked out. No one has talked to me since the incident and John blocked me from all social media. Our group chat has been pretty silent too. John also apparently made a roast post about me. Idk if I should apologize to him or not. Sorry for the long post. I know John is an asshole, but AITA? ",
        "edited": "False",
        "id": "9wg9ep",
        "is_asshole": 0,
        "num_comments": 3368.0,
        "score": 31525,
        "timestamp": 1542045391.0,
        "title": "AITA for telling someone that his art sucks and he won't amount to much in life in front of his friends and family.",
        "verdict": "not the asshole"
    },
    {
        "body": "I'm a bit of a jackass I will admit, but hear me out. So today I was at my parent's house to celebrate Christmas Eve with my side of the family (as this year I will be spending Christmas with my girlfriend's this year). Anyways, we opened presents up early this morning. Something I should note about my sister is that she LOVES her children. Which is great and I do love my nephews, but every year she gets me magnets, pictures, blankets and pretty much anything she can plaster her kids on. \n\nWhile it's nice, I don't have a shrine at my house dedicated to them and I know this might sound selfish, but I don't really want them as I don't know what to do with them. They end up in a drawer or something, cause one year she got me a large tapestry thing with her kids on it, and it was HUGE. Obviously I didn't want to hang it up as it quite literally covered the entire wall. I never say anything to her as I don't want to offend her and ruin Christmas.\n\nSo that's when I had the genius idea of doing the same thing but with my dog. I put him in a little tie, took his picture and put it in a frame. I love my dog as my child, so I figured I'd gift it to my sister. (I also got her a $25 Starbucks card as she's obsessed with them and I wasn't trying to be petty). Anyways, she opens it up and her face drops. Then she goes to me and says, \"what the fuck am I supposed to do with this?\" Without a thought I said, \"same thing I do with yours, it'll look good on your coffee table\". \n\nLong story short, she got mad, my family is pretty much on my side expect for a couple of people who thought it was funny but in the end \"dogs aren't comparable to humans\". Which I don't necessarily agree with and wasn't the point of the gift, but whatever, I thought it was funny, but I need unbiased opinons, AITA?",
        "edited": "False",
        "id": "ef49r2",
        "is_asshole": 0,
        "num_comments": 2657.0,
        "score": 31281,
        "timestamp": 1577208307.0,
        "title": "AITA for gifting my sister pictures of my dog?",
        "verdict": "not the asshole"
    },
    {
        "body": "I know I likely am, but the extend of which I'm unsure about. \n\nMy son is almost 17. This Christmas we bought him an expensive computer gaming chair, as he plays a lot of online multiplayer shooters. My son has some anger issues, which he's currently in therapy for, and these shooters tend to bring out his temper more than normal. However, for the past few months he's been keeping it together well, so I figured the chair might be a fair present. \n\nI was wrong, because the day after Christmas he was gaming, started to have bad luck and apparently people in-game were fucking with him because he was losing his patience. This culminated in him screaming insults and then picking up his chair and slamming it into the ground, breaking the back of it.\n\nAfter talking him down, we had a very serious conversation about him no longer being allowed to play multiplayer games while under my roof until his therapist feels comfortable with his progress, talked about coping mechanisms, etc. However, I made it very clear this was unacceptable and he would be grounded. We've had these heart-to-hearts many times, so it's not like every time he has an outburst I'm making light of it. It's a serious issue and treated like such.\n\nHowever, when he came to me later that day and told me he'd like me to replace the chair because it was a gift, he \"really liked it\" and \"it would only be fair\", the frustration, disbelief and disappointment in his behavior boiled over and I started laughing hysterically. As in a full laughing fit, barely able to breathe or talk. The more he'd plead his case, the harder I'd laugh, repeatedly asking him how it was \"fair\" in his mind to have me replace a gift I paid for that he broke in anger.\n\nThis obviously pissed him off more, which led to him getting emotional, but I just couldn't seem to stop myself. I tried walking out of the room and asking him to drop it but every time he'd say \"but I need a chair!\" or \"What am I supposed to do now\" I'd laugh again. I tried explaining that I'm not laughing at his feelings, I'm laughing at how absurd it is for him as a teenager to expect me to replace shit he can't be bothered to treat with respect and then whine about it when he broke it.\n\nHe's still pissed about it, and feels slighted. I feel bad for laughing, and honestly wonder if I had some sort of mini-stress break myself, because it's never happened before and I couldn't seem to stop. But at the same time, I stand by the fact that his request *was* ridiculous enough to make most people *want* to laugh. How badly did I fuck up?",
        "edited": "False",
        "id": "ei9igg",
        "is_asshole": 0,
        "num_comments": 3529.0,
        "score": 31136,
        "timestamp": 1577829619.0,
        "title": "AITA for laughing uncontrollably at my son when he asked me to replace a Christmas gift he broke out of anger?",
        "verdict": "not the asshole"
    },
    {
        "body": "When my daughter was 14, wife and I decided we would buy a car for her to use on her 16th if she proved herself to be responsible, got good grades, etc. There would be a \"contract\" of sorts to ensure we were all on the same page. The stipulations were continuing good grades, good attitude, she could only bring one friend with her somewhere (to begin with), we had to know where she was, and the obvious two: don't drink & drive, and don't text and drive. \n\nWe made it clear that **we** were buying the car, but it was for her to use. We got the car, a 2012 Honda Civic. She has a summer job right now, it's summer break so she's out doing stuff with her friends, etc. In a few months she will be off to college. Everything was going swimmingly. Until someone on that NextDoor app started posting pictures and videos of bad drivers in the area. And lo and behold, my daughter was posted with her face down as she texted and rolled through a stop sign. Once with her face down in her phone at a stoplight. I was livid. My wife was the one who showed it to me. We found out there were more instances (from her Instagram Stories) and we decided... no.\n\nWife and I up and sold the car. We didn't lose very much in the process, except of course our daughter completely came unraveled. It's so unfair, I didn't hurt anyone, everyone's doing it, how am I supposed to get to work, what about when I go to college? Well, we said no, it's not unfair, you hurt us by being a shitty, irresponsible driver, no, not everyone's doing it, you can walk, ride your bike, or take the bus, and as for college, you don't need the car to get to and from classes, and again, ride your bike or walk. She tried to play the \"how can you send your daughter to college without her safety in mind?\" card and I said \"Well, well, well, now you're concerned about safety?\" and she just up and screamed. \n\nThis has everyone in our life up in arms and divided. Her grandparents think we're being over the top and awful, that grounding her would have sufficed. They've threatened that THEY will buy her a car again if we try to send her to college without one. \n\nThe car is already sold, so there's no going back. I think what we did was absolutely correct, that actions have consequences and we would be in the wrong to pull back from that. In terms of her going to college? Well, she made that choice. She had a car, it came with certain stipulations, she disobeyed us, and now she pays the price. \n\nSo AITA?",
        "edited": "False",
        "id": "cb6xz4",
        "is_asshole": 0,
        "num_comments": 6682.0,
        "score": 30976,
        "timestamp": 1562706692.0,
        "title": "AITA for selling my daughter's car after discovering her texting & driving?",
        "verdict": "not the asshole"
    },
    {
        "body": "I'm sitting at the airport and this older lady sat down right next to me and took her iPad out and starts watching a show quite loud. \n\nTo me this is a foul in public however I just ignored it and put my earbuds in. \n\nAfter a while I made a phone call using my earbuds. Literally 30 seconds into my call she interrupts me and asks me to quit being rude and talk quietly so she can hear her show.\n\nI was as polite as I could and said that not only herself but everyone for about 10 feet and I could hear her show word for word and that making a phone call isn't rude but watching a show on your device full volume in a public waiting area is actually very rude and that is why people use headphones. \n\nShe said she has every right to enjoy her show without being interrupted by a rude and selfish phone call or having to use headphones. \n\nI said she was absolutely right and I am completely wrong, please enjoy your show while we  wait for the plane and I will do  the same.       I then proceeded to take out my iPad and open ice cubes good cop bad cop music video and play it full volume on my device without my earbuds. \n\nI have never seen someone storm off so mad. \n\nQuick edit. I turned the music video off almost immediately after she left. ",
        "edited": "1549902288.0",
        "id": "aphmhd",
        "is_asshole": 0,
        "num_comments": 788.0,
        "score": 30875,
        "timestamp": 1549900726.0,
        "title": "Aita for giving a woman a taste of her own behavior",
        "verdict": "not the asshole"
    },
    {
        "body": "I love strawberries. I love them so much that I planted 300 strawberry plants in my garden. After I harvest, I make lots of strawberry jelly to give to my family, friends, and neighbors. I donate the leftovers to my local food bank.\n\nLately I've had a big problem with all the neighborhood kids coming in my yard and stealing my strawberries. The last time I caught them I threatened them with the police because they was so reckless they smashed over 50 of my plants.\n\nI caught them in my yard again this afternoon, instead of calling the police I grabbed my garden hose and sprayed them while chasing them out of my yard. \n\nI just had a group of angry parents come to my house complaining about my actions. Absolutely none of them was willing to apologize for their children's actions. One parent in particular is threatening to sue me, because her son's iPhone 10 was ruined with water. I told her that was her problem for letting her eight-year-old son have a $1,000 phone. Then I threatened to spray them with my hose if they didn't get off of my property.",
        "edited": "1561495875.0",
        "id": "c5eeb5",
        "is_asshole": 0,
        "num_comments": 2082.0,
        "score": 30775,
        "timestamp": 1561493413.0,
        "title": "AITA for spraying the neighborhood kids with my garden hose?",
        "verdict": "not the asshole"
    },
    {
        "body": "About two months ago, my husband and I got “married” in a beautiful ceremony. It was SO MUCH FUN. We went on a honeymoon after. The price tag makes me wheeze, but my parents were insistent on paying for 95% of it, saying it’s their only daughter’s wedding. As a result, the wedding was way more fancy than something my husband or I could afford! My husband and I paid the rest — his family did not contribute (which is fine!). \n\nThe wedding was lovely, but missing one piece - the marriage license. About a year and a half ago, I was going through some serious health issues (the issues are resolved now, thankfully!). I had recently graduated from school and didn’t have health insurance. My husband and I decided to get married so I could join his health insurance. It was a quick Justice of the Peace ceremony. We were always planning to have a ceremony at some point in the future. A few months after that, he “proposed” (something I didn’t see coming!), the wedding occurred, and here we are today, planning for kids. \n\nVery few people knew we got legally married about a year and a half ago. We weren’t trying to be deceptive. However, part of it was that I wasn’t comfortable revealing my health issues. My husband respected this. My parents knew about our legal marriage, but his mother did not. His mom (I’ll call her Carol) and I aren’t close. She’s fine enough in low doses, but...\n\nWe’re currently in the process of moving. This past weekend, his mother came to help us pack up things. As we were packing files (birth certificate, social security cards, etc.), somehow our marriage license must’ve slipped out. Carol picked it up and kept insisting we need to frame it. And then she noticed the date. \n\nCarol lost it. She insisted we lied to everyone. She said our wedding ceremony was just a “gift grab” (our wedding website stated that someone’s presence was gift enough— we still got many generous gifts and we are forever grateful). Carol went and called her twin sister, my husband’s aunt, and the sister called and lashed out at us. She said we were sneaky and deceptive. She is saying she may want her gift back—something we are fine with giving her. \n\nFor me and my husband, the legal wedding was just so I could get insurance. A means to an end. Our wedding date is what we will celebrate. Are we assholes for not being more upfront? I’ve been really upset and confused and waffle back and forth. My husband insists we are not assholes.",
        "edited": "False",
        "id": "d9m02m",
        "is_asshole": 0,
        "num_comments": 3310.0,
        "score": 30708,
        "timestamp": 1569515262.0,
        "title": "AITA for having a wedding and not disclosing we were already legally married?",
        "verdict": "not the asshole"
    },
    {
        "body": "When I was 25, we found out that my father had been cheating on my mother for years and he had a 7 year old daughter with his mistress. In one split second, the happy family I knew was gone, and I went through the darkest time in my life.\n\nMy parents divorced and per their prenup, my mother walked away with most of their assets (since she also contributed more to the family income). She never forgave my dad for what he did and never talked to him again, though she grudgingly allowed me to have whatever relationship I wanted to have with him. I eventually forgave my dad mostly because I was tired of carrying so much anger and hurt in my heart. I talk to him but I want nothing to do with his mistress or my half sister.\n\nMy mother died last year and left me everything - her money, her real estate assets, and her business, which I now own and operate. I am in a relatively comfortable financial position, while my dad is... getting by. He was never a good businessman on his own and lost a lot of his money on businesses that later went belly up.\n\nThis year my half sister was diagnosed with a life threatening sickness, and she has been in the hospital for the last four months. The bills are mounting and my dad came to me for help because they are now in a situation where they are finding it difficult to come up with money for my half sister's treatment.\n\nThe thing is, I don't want to use my mother's money to pay for the treatment of the child her husband had with his other woman. Though it's not my half sister's fault, it feels so unfair when I think that the money my mother worked hard all her life for will go to a child that neither my mother and I have any responsibility towards, and the very same child of the man and the woman who hurt her so much at that. I'd really rather use it to grow her company and let my dad and my half sister's mother figure out how to get money for her treatment. They are her parents after all. The only thing tying me to her is my father saying \"She is your sister\" and \"If she dies because she didn't get the treatment she needs, would you be able to sleep at night?\"\n\nAITA?",
        "edited": "False",
        "id": "cz5vk2",
        "is_asshole": 0,
        "num_comments": 8085.0,
        "score": 30562,
        "timestamp": 1567522198.0,
        "title": "AITA for refusing to use the money I inherited from my mother to pay for medical treatment for my half-sister, who has a life threatening sickness? She is the child of my father and the woman he cheated on my mother with.",
        "verdict": "not the asshole"
    }
]